<template>
    <div class="destination">
        <div class="hero-section">
            <div class="banner">
                <img src="@/assets/images/destination/mandalay/banner.jpg" class="banner" alt="">
            </div>
            <div class="content">
                <div class="hero-header">
                    <img src="@/assets/images/destination/travel.gif" class="icon" alt="">
                
                    <h3>Places to Visit in</h3>
                    <h2>MANDALAY</h2>
                    <div class="scroll-down">
                        <div class="container">
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <span class="text">Scroll down</span>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="places">
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
            <div class="row">
                <div class="place-card-wrapper" v-for="(card, i) in paginatedData" :key="i">
                    <div class="place-card" :class="{odd: i%2 !== 0}">
                        <div class="place-img ">
                            <div :class="`swiper place-swiper`" data-aos-delay="100">
                                <div class="swiper-wrapper">
                                    <div class="swiper-slide" v-for="(img, i) in card.images" :key="i">
                                        <img :src="img" class="float-start" alt="">
                                    </div>
                                </div>
                                <div class="swiper-pagination" id="swiper-paginate"></div>
                            </div>
                        </div>
                        <div class="place-content">
                            <h2>{{card.title}}  </h2>
                            <p v-html="card.content">
                            </p>
                        </div>
                    </div>
                </div>
            </div>
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
        </div>
    </div>
</template>

<script>
    import { ref, onMounted, computed, watch } from 'vue';
    export default {
        setup() {
            const pageNumber = ref(0);
            const size = 5;
            const swiper = ref(null);

            const places = [
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mandalay_hill/1.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_hill/2.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_hill/3.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_hill/4.jpg'),
                        ],
                    title: `မန္တလေးတောင်`,
                    status: 0,
                    content: `မန္တလေးတောင်သည် မန္တလေးမြို့၏ မြောက်ဖက်တွင် တည်ရှိပြီး ပင်လယ်ရေမျက်နှာပြင်မှ (၂၃၀) မီတာမြင့်သည်။ မန္တလေးတောင်ထိပ်သည် ပင်လယ်ပြင်မှအထက် ပေပေါင်း(၇၇၆)ပေ၊ တောင်ခြေမြေပြင်မှ ပေပေါင်း(၅၀၀)ကျော်မြင့်သည်။ မန္တလေးတောင်ကို ဘုရားကျောင်းကန်များနှင့် ခြံရံထားပြီး၊ မန္တလေးမြို့နှင့် မန္တလေးတောင်တို့သည် တင့်တယ်စွာပနံရလှသည်။ မန္တလေးတောင်ပေါ်မှနေ၍ နန်းမြို့ရိုး၊ ကျုံးနှင့်တကွ မန္တလေးမြို့၏ရှုခင်းကို ကောင်းမွန်စွာမြင်တွေ့ရပေသည်။   <br><br>
                    မန္တလေးတောင်နှင့်စန္ဒမုခိအမည်ရ ဘီလူးမတို့သည် သမိုင်းကြောင်းအရ ဆက်စပ်လျက်ရှိပါသည်။ မန္တလေးတောင်သမိုင်းတွင် ဂေါတမဗုဒ္ဓသည် ယင်းနေရာသို့ ကြွရောက်တော်မူလာရာ စန္ဒမုခိဘီလူးမသည် တစ်စုံတစ်ရာလှူဒါန်းရန်ရှာကြံပါသော်လည်း မရရှိသဖြင့် ၎င်း၏သားမြတ်တို့ကို လှူဒါန်းရန်ဆုံးဖြတ်ကာ လှူဒါန်းလိုက်လေသည်။ ယင်းကဲ့သို့ ထူးကဲသော အလှူဒါနကြောင့် စန္ဒမုခိဘီလူးမသည် နောင်အခါ ဤအရပ်ဒေသတောင်ခြေတွင် မြို့တော်တည်၍ သာသနာတော်ကို ကြီးစွာထောက်ပံ့သော မင်းဖြစ်လတ္တံ့ဟု ဗျာဒိတ်ပေးညွှန်ပြတော်မူခဲ့သည်။ ထို့ကြောင့် ဗုဒ္ဓဘာသာဝင်တို့သည် မင်းတုန်းမင်းအား စန္ဒမုခိဘီလူးမ ဖြစ်ခဲ့ဖူးသူဟု ယုံကြည်ကြသည်။ ထိုယုံကြည်မှုကြောင့် မန္တလေးတော်ပေါ်ရှိ ထောင့်(၄)ထောင့်တို့တွင် စန္ဒမုခိဘီလူးမက မြတ်စွာဘုရားရှင်ကို ဖူးမြော်ဟန်ရုပ်တုများကို ထားရှိထားပေသည်။  <br> <br>
                    မန္တလေးတောင်သို့မတက်မှီ ကြီးမားသော ခြင်္သေ့ရုပ်တုကြီးနှစ်ခုက တောင်ခြေတွင် စောင့်ကြပ်ကြိုဆို လျက်ရှိပါသည်။ တောင်ပေါ်သို့ အနောက်ဖက်၊ မြောက်ဖက်၊ တောင်ဖက်နှင့် အရှေ့တောင်ဖက်ရှိ စောင်းတန်းများမှ ခြေလျင်ဖြင့်တက်ရခြင်းသည် တက်ရကျိုးနပ်လှပေသည်။ တောင်ပေါ်သို့ တစ်လမ်းမောင်း တောင်တက်ကားလမ်းမှလည်း တက်နိုင်ပါသေးသည်။ သို့သော် စောင်းတန်းတစ်လျှောက်မြင်တွေ့နိုင်သော အရောင်အသွေးစုံလင်လှသည့် ဘုရားဖူးများ၊ ရှုမျှော်ခင်းများကို လက်လွှတ်ရပေလိမ့်မည်။ ခြေလှမ်းအပေါ် မူတည်၍ တောင်တက်ချိန်သည် မိနစ်(၃၀)ခန့်၊ လှေကားထစ်ပေါင်း(၁၇၂၉)ထစ်ကို တက်ရပေမည်။ မန္တလေးတောင်ပေါ်တွင် ကြည်ညိုသပ္ပာယ်ဖွယ်ကောင်းလှသော ဆုတောင်းပြည့်ဘုရားကို ဖူးမြှော်နိုင်ပြီး၊ လှပကြည်နူးဖွယ်နေဝင်ချိန်ရှုခင်းကိုလည်း ကြည့်ရှုနိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mahar_myat_muni/1.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_myat_muni/2.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_myat_muni/3.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_myat_muni/4.jpg'),
                        ],
                    title: `မဟာမြတ်မုနိဘုရားကြီး`,
                    status: 0,
                    content: `မန္တလေးမြို့၏ သမိုင်းဝင်ကျက်သရေဆောင်သော မဟာမြတ်မုနိဘုရားကြီးသည် မန္တလေးမြို့၊ ချမ်းမြသာစည်မြို့နယ်၊ ကျွန်းလုံးဥသျှောင်ရပ်ကွက် တည်ရှိပါသည်။ ထူးခြားအံ့ဩဖွယ်ကောင်းသော မဟာမြတ်မုနိဘုရားကြီးသည် ဉာဏ်တော် (၄)မီတာ၊ အလေးချိန် (၆.၅)တန်ရှိပြီး စိန်၊ ပတ္တမြား၊ နီလာများဖြင့် စီခြယ်ထားသော သင်းကျစ်တော်နှင့်အတူ ကြေးဖြင့် ပုံသွန်းလောင်းထားပါသည်။   <br><br>
                    မဟာမြတ်မုနိဘုရားကြီး၏ နေ့စဉ်မျက်နှာသစ်တော်ရေနှင့် တံပူတော်ကပ်လှူခြင်း အခမ်းအနားသည် ဘုရားဖူးများကို အထူးဆွဲဆောင်လျက်ရှိပါသည်။ မျက်နှာသစ်တော်ရေ ကပ်လှူပူဇော်ခြင်းကို နံနက်(၄:၀၀-၄:၃၀)နာရီတွင်ပြုလုပ်ပြီး၊ ထေရ်ကြီးဝါကြီး သံဃာတော်အရှင်သူမြတ်များက ဦးဆောင်ကာ ဝတ်ဖြူစင်ကြယ် ဝတ်ဥပသိကာများက ဝေယျာဝစ္စပြုလုပ်ပူဇော်ကြပါသည်။ နံနက်ခင်း မောင်းထိုးသံနှင့်အတူ သံဃာတော် မထေရ်မြတ်ကြီးတစ်ပါးက မျက်နှာသစ်တော်ရေကပ်လှူခြင်း၊ သန့်ရှင်းစင်ကြယ်သော မျက်နှာသုတ်ပုဝါဖြင့် သန့်စင်ပေးခြင်း၊ တံပူတော်များကပ်လှူပေးခြင်းတို့ကို ဆောင်ရွက်ကြပါသည်။ များစွာသော ဘုရားဖူးများသည် သံဃာတော်များစွန့်ကြဲသည့် မျက်နှာသုတ်ပုဝါများ၊ မျက်နှာသစ်တော်ရေ နံ့သာရေများကို ကိုးကွယ်ဆောင် ထားရန် လာရောက်ယူဆောင်ကြပါသည်။ ထို့အပြင် ဆွမ်း၊ ပန်း၊ ရေချမ်း၊ သစ်သီး စသည်တို့ကို ကပ်လှူ ပူဇော်ကြပြီး ဘုရားကြီး၏ နေ့တဓူဝလှုပ်ရှား လုပ်ဆောင်မှုများပင်ဖြစ်ပါသည်။   <br> <br>
                    မဟာမြတ်မုနိရုပ်ရှင်တော်မြတ်ကြီး၏ ဗုဒ္ဓပူဇနိယပွဲတော်ကို ဖေဖော်ဝါရီလတွင် (၂)ရက်တိုင် ကျင်းပ ကြပါသည်။ ဘုရားပွဲတွင် မီးဖိုကြီးများဖို၍ ကောက်ညှင်း၊ အုန်းသီး၊ ဂျင်း၊ နှမ်းတို့ဖြင့် ထမနဲထိုး၍ သံဃာတော်များကို လောင်းလှူကြပါသည်။ ထို့အပြင် ဦးရွှေရိုး၊ ဒေါ်မိုးအက ကဲ့သို့သော ရိုးရာဖျော်ဖြေပွဲများကို ပြုလုပ်ကြပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/eain_daw_yar/1.jpg'),
                            require('@/assets/images/destination/mandalay/eain_daw_yar/1.jpg'),
                            require('@/assets/images/destination/mandalay/eain_daw_yar/1.jpg'),
                            require('@/assets/images/destination/mandalay/eain_daw_yar/1.jpg'),
                            require('@/assets/images/destination/mandalay/eain_daw_yar/1.jpg'),
                        ],
                    title: `အိမ်တော်ရာဘုရား`,
                    status: 0,
                    content: `အိမ်တော်ရာဘုရားသည် မန္တလေးတိုင်းဒေသကြီး၊ ချမ်းအေးသာစံမြို့နယ်၊ ၈၇ လမ်း၊ ၂၇လမ်းနှင့် ၂၈လမ်းကြားတွင်ရှိသည်။ ပုဂံမင်းသည် ၁၈၄၆ ခုနှစ်၊ နိုဝင်ဘာလ ၁၇ ရက်နေ့တွင် ကုန်းဘောင်မင်းဆက်၏ နဝမမြောက်ဘုရင် ဖြစ်လာခဲ့ပြီးနောက် မဂႅလာအိမ်တော်ရာနေရာတွင် စေတီတော်တစ်ဆူတည်ထားရန် ရည်ရွယ်ခဲ့သည့်အတိုင်း ၁၈၄၇ ခုနှစ်၊ နိုဝင်ဘာလ ၁၈ ရက်နေ့တွင် ကိုယ်တိုင်အုတ်မြစ်ချခဲ့သည်။ အိမ်တော်ရာ စေတီသည် ဉာဏ်တော်အမြင့်(၉၉)ပေ၊ ထီးတော်အမြင့်(၁၃)ပေ(၁၀)လက်မ၊ ထီးတော်အဝ (၆)ပေရှိပါသည်။ အိမ်တော်ရာစေတီကို ၁၈၄၈ ခုနှစ်၊ နိုဝင်ဘာလ ၁၆ ရက်နေ့တွင် ထီးတော်တင်လှူခဲ့ပြီး စေတီတော်အား မဟာလောကရံသီဟု ဘွဲ့အမည်သမုတ်ခဲ့သည်။ မဟာလောကရံသီ အိမ်တော်ရာစေတီ၏ မဟာရာမ် တံတိုင်းအတွင်းရှိ ထောင့်လေးထောင့်၌ (၁) အလယ်နန်းတော် စလင်းမြို့စားမိဖုရား သီရိတိလောက အတုလရတနာဒေဝီတည်သည့် စေတီတစ်ဆူ၊ (၂) ခမည်းတော်မင်းတရားကြီး မိဖုရား စလေမြို့စားတည်သည့် စေတီတစ်ဆူ၊ (၃) ငယ်ရွယ်တော်မူစဉ်က မင်းတရားကြီး၏ အထိန်းတော်ဖြစ်ခဲ့ဖူးသော တောင်ပြုံးကြီးမြို့ ဟင်္သာတမြို့စားတည်သော စေတီတစ်ဆူ၊ (၄) မင်္ဂလာအိမ်တော်ပါ ကျွန်တော်ရင်းဖြစ်သော ကျီဝန်၊ အတွင်းဝန် မင်းကြီး မဟာသက်တော်ရှည်တည်သော စေတီတစ်ဆူ ပေါင်း စေတီရံလေးဆူရှိသည်။ အိမ်တော်ရာ ဘုရားသည် ရေမြေ့ရှင်ဘုရင်မင်းမြတ်၏ ကောင်းမှုကုသိုလ်တော်ဖြစ်သည့်အလျောက် မင်းညီ မင်းသား မှူးတော်မတ်တော် ကတော်မယားများမှစ၍ ကုသိုလ်တော်ပွား လှူဒါန်းကြသည်များသောကြောင့် မဟာရာမ် တံတိုင်းကြီးအတွင်း ရှေးမြန်မာ ဗိသုကာအကျော်အမော်တို့၏ လက်စွမ်းပြ ပြာသာဒ် တန်ဆောင်း ရှေးဟောင်းအဆောက်အအုံကြီးများ ပြည့်လျက်ရှိသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/2.jpg'),
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/2.jpg'),
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/kyaw_taw_gyi_pagoda/2.jpg'),
                        ],
                    title: `ကျောက်တော်ကြီးဘုရား`,
                    status: 0,
                    content: `ကျောက်တော်ကြီးဘုရားသည် မန္တလေးမြို့၊ အောင်မြေသာဇံမြို့နယ်၊ ဥပုတ်တော်ရပ်ကွက်၊ မန္တလေးတောင်ခြေအနီးတွင် တည်ရှိသည်။ ကျောက်တော်ကြီးဘုရားသည် မန္တလေးရတနာပုံ ရွှေမြို့တော်ကြီးကို တည်ထောင်တော်မူသော ပဉ္စမသင်္ဂါယနာတင် မင်းတုန်းမင်း၏ ကုသိုလ်ဖြစ်သည်။ မြို့တော်တည်ထောင်ပြီး ငါးနှစ်ခန့်အကြာ မြန်မာသက္ကရာဇ် ၁၂၂၆ ခုနှစ်၌ မတ္တရာမြို့ရှိ စကျင်တောင်မှ ရရှိသော တစ်လုံးတစ်ခဲတည်းသော စကျင်ကျောက်ကြီးကို ပုံတော်ကြမ်း ထုဆစ်စေခဲ့ပြီး မန္တလေးသို့ သယ်ဆောင်ယူကာ မင်းတုန်းမင်းကိုယ်တိုင် မျက်ခုံး၊ မျက်ရေးတို့ကို ရေးဆွဲလျက် မဟာသကျမာရဇိန်ဟု ကမ္ပည်းတင်ခဲ့သည်။ ဉာဏ်တော်အမြင့်မှာ ၂၆ ပေ၊ ၆ လက်မရှိပြီး စကျင်တောင်မှ ရသောကျောက်ကို အစွဲပြု၍ “ကျောက်တော်ကြီးဘုရား”ဟု ခေါ်ဝေါ်သမုတ်ကြသည်။   <br><br>
                    ကျောက်တော်ကြီးဘုရားပွဲကို နှစ်စဥ်နှစ်တိုင်း သီတင်းကျွတ်လဆန်း (၁၃)ရက်နေ့မှ လပြည့်ကျော် (၇)ရက်နေ့အထိ စည်စည်ကားကားကျင်းပကြသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/2.jpg'),
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/3.jpg'),
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/4.jpg'),
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/5.jpg'),
                            require('@/assets/images/destination/mandalay/kuthodaw_pagoda/6.png'),
                        ],
                    title: `ကုသိုလ်တော်ဘုရား`,
                    status: 0,
                    content: `ကုသိုလ်တော်ဘုရားသည် မန္တလေးတောင်၏ အရှေ့တောင်ဖက်တွင်တည်ရှိပြီး မင်းတုန်းမင်း၏ ကုသိုလ်တော်ဖြစ်သည်။ မြန်မာသက္ကရာဇ် ၁၂၂၄ ခုနှစ်၊ ဝါဆိုလတွင် မင်းတုန်းမင်း တည်ထားကိုးကွယ်ခဲ့သော ဘုရားဖြစ်ပြီး ဘွဲ့အမည်မှာ မဟာလောကမာရဇိန်ဖြစ်သည်။ <br><br>
                    ကုသိုလ်တော်ဘုရားသည် ပုဂံရှိရွှေစည်းခုံဘုရား၏ ပုံစံကိုယူ၍ တည်ထားခြင်းဖြစ်သည်။ ကမ္ဘာ့အကြီးဆုံး စာအုပ်ကြီးဟုခေါ်ဆိုကြသော (၇၂၉)ချပ်သော ကျောက်စာချပ်များသည် ဘုရားပရဝုဏ် အတွင်း တည်ရှိသည်။ စေတီငယ်တစ်ဆူတွင်  (၁၅၃)စင်တီမီတာမြင့်၍ (၁၀၇)အကျယ်ရှိသော ကျောက်စာချပ် တစ်ချပ်စီ ထည့်သွင်းထားပြီး ကျောက်စာချပ်များပေါ်တွင် ဗုဒ္ဓဘုရားရှင်၏ သုတ်၊ ဝိနည်း၊ အဘိဓမ္မာ ဟူသော ပိဋကတ်(၃)ပုံပါစာသားများကို ကျောက်စာ၏ မျက်နှာစာနှစ်ဖက်စလုံးတွင် ရေးထွင်းထားပါသည်။ အဖြူရောင် စေတီငယ်များကြားတွင် လျှောက်လမ်းကလေးများရှိပြီး၊ ဘုရားပရဝုဏ်၏အလယ်တွင် (၇၂)မီတာအမြင့်ရှိ ရွှေရောင်ပုထိုးတော်တစ်ဆူရှိပါသည်။ ကုသိုလ်တော်ဘုရားသည် UNESCO ၏ ကမ္ဘာ့အမွေအနှစ်စာရင်းဝင် အဖြစ် (၂၀၁၃)ခုနှစ်တွင် ထည့်သွင်းခံရသည်။ <br><br>
                    ကုသိုလ်တော်ဘုရားတွင် ကျောက်စာချပ်များမှ ပါဠိဘာသာအရေးအသားများကိုလည်းကောင်း၊ ကျောက်စာချပ်ရေ(၇၀၀)ကျော်ရှိ ကမ္ဘာ့အကြီးဆုံးစာအုပ်ကြီးကိုလည်းကောင်း လေ့လာနိုင်ပြီး မြန်မာ့ရိုးရာ ဗိသုကာလက်ရာများ၊ ဘုရားသမိုင်းများကို လေ့လာနိုင်ပါသည်။  
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/kyauk_sein_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/kyauk_sein_pagoda/2.jpg'),
                            require('@/assets/images/destination/mandalay/kyauk_sein_pagoda/3.jpg'),
                            require('@/assets/images/destination/mandalay/kyauk_sein_pagoda/3.jpg'),
                        ],
                    title: `ကျောက်စိမ်းစေတီတော်`,
                    status: 0,
                    content: `ကျောက်စိမ်းစေတီတော်သည် မန္တလေးတိုင်းဒေသကြီး၊ အမရပူရမြို့နယ်တွင် တည်ရှိပြီး ကျောက်စိမ်း များဖြင့် မွန်းမံချယ်သထားသည့် စေတီတစ်ဆူဖြစ်သည်။ ဘွဲ့တော်အပြည့်အစုံမှာ “ဝေရောစန” ကျောက်စိမ်း စေတီတော်ဖြစ်သည်။ ၂၀၁၂ ခုနှစ်၊ ဒီဇင်ဘာလ၊ (၂၁)ရက်နေ့တွင် မြေသန့်မဟာမင်္ဂလာကျင်းပပြီး အဆင့်ဆင့် ဆောင်ရွက်ခဲ့ရာ ၂၀၁၅ ခုနှစ်၊ ဇွန်လ၊ (၅)ရက်နေ့တွင် ထီးတော်တင်မင်္ဂလာကို အောင်မြင်စွာ ကျင်းပပြီးစီးခဲ့ သည်။ စေတီတော်ကြီးတည်ထားသောအခါ အရည်အသွေးစံချိန်မီ ကျောက်စိမ်းတန်ချိန် တစ်ထောင်ကျော်ကို အသုံးပြုခဲ့သည်။ စေတီတော်၏ အလှူရှင် မိသားစုမှာ သီဟသုဓမ္မမဏိဇောတဓရ ဦးစိုးနိုင်၊ ဒေါ်အေးအေးခိုင် (အေးအေးခိုင် ကျောက်မျက်ကုမ္ပဏီ) မိသားစုဖြစ်သည်။ စေတီတော်သာမက ဘုရားဝတ္တကမြေ အလှူရှင် လည်းဖြစ်သည်။ စေတီတော်ကြီး တည်ထားပူဇော်နိုင်ရန် (၂၅)နှစ်ကျော်ကာလတိုင်အောင် ကျောက်စိမ်းများကို စုဆောင်းခဲ့ရသည်။ <br> <br>
                    စေတီတော်မြတ်ကြီး၏ အတိုင်းအတာပမာဏမှာ ထီးတော်မပါ ဉာဏ်တော်အမြင့် (၇၅)ပေ (၆)လက်မ၊ လုံးပတ်တော် (၁၇၆)ပေ၊ ပန်းတင်ခုံအလျား (၅၂)ပေ (၆)လက်မ၊ အနံ (၅၂)ပေ (၆)လက်မ၊ အမြင့် (၁၂)ပေ၊ ငှက်ပျောဖူးအမြင့် (၈)ပေ (၆)လက်မ၊ ထီးတော်အမြင့် (၇)ပေ အသီးသီးရှိသည်။ စေတီတော်ကြီးအား လှိုဏ်ဂူပုံသဏ္ဍာန်တည်ထား၍ အရပ်လေးမျက်နှာတွင် ဂူပေါက်ဝလေးပေါက်ပါရှိပြီး ကျောက်စိမ်း ရုပ်ပွားတော်များ ပူဇော်ထားရှိသည်။ အရှေ့အနောက် ပူဇော်ထားရှိသော ကျောက်စိမ်းရုပ်ပွားတော်မှာ ဉာဏ်တော်(၃၁)လက်မစီရှိသည်။ တောင်ဘက်မုခ်ဦးရှိ ရုပ်ပွားတော်မှာ ဉာဏ်တော်(၄၉)လက်မနှင့် မြောက်ဘက်မုခ်ဦးရှိ ရုပ်ပွားတော်မှာ ဉာဏ်တော်(၅၀)လက်မခွဲရှိသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/1.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/2.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/3.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/4.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/5.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_nan_daw_kyaung/6.jpg'),
                        ],
                    title: `ရွှေကျောင်း (ခ) ရွှေနန်းတော်ကျောင်း`,
                    status: 0,
                    content: `ရွှေကျောင်းဟုလူသိများသော ရွှေနန်းတော်ကျောင်းသည် နှစ်ပေါင်း(၁၃၀)ကျော်သက်တမ်းရှိပြီး မန္တလေးတိုင်း‌ဒေသကြီး၊ အောင်မြေသာဇံမြို့နယ်၊ ဒေါနဘွားရပ်ကွက်တွင်တည်ရှိသည်။  ကုန်းဘောင်ခေတ် (၁၉)ရာစု မြန်မာအနုပညာ ဗိသုကာလက်ရာ စံပြုကျောင်းကြီးဖြစ်သည်။ ရွှေနန်းတော်ကြီးမှာ အမိုးသုံးဆင့်၊ လယ်ပေါ်နှစ်ထပ်၊ စမြင်ပါသော ဇေတဝန်ဆောင်ဖြစ်သည်။ ကျောင်းကြီးတစ်ဆောင်လုံးတွင် အရှေ့ အနောက်တိုင်(၁၅)လုံးတန်းနှင့် တောင်မြောက်(၁၀)လုံးတန်းရှိခြင်းကြောင့် တိုင်ပေါင်း(၁၅၀)တိုင်၊ နယားရုပ် ထောက်တိုင်ပေါင်း(၅၄)တိုင်နှင့် သရက်ကင်းအုတ် လှေကားငါးစင်းဖြင့် တည်ဆောက်ထားသည်။ ကျောင်းကြီး တစ်ခုလုံးတွင် မြန်မာမှုသစ်သားပန်းပု အခြေခံ ခြူးပန်း၊ ခြူးနွယ်အပြောက်အမွှမ်းများ၊ ရုပ်လုံးရုပ်ကြွများ၊ ကျေးငှက်တိရစ္ဆာန်ရုပ်များ၊ နံရံကပ်ရုပ်ကြွများနှင့် အတွင်းမာရဘင် အရှေ့ပိုင်ကွန်းစင်တိုင် အခြေတွင် ဇာတ်ကြီးဆယ်ဘွဲ့၊ တောထွက်ခန်း၊ မဟာပဒုမဇာတ်၊ ဥတေနဇာတ်တော်များကို စိတ်ဝင်စားဖွယ် လက်ရာ မြောက်စွာ အနုစိတ်တပ်ဆင်ထားသည်။ ၁၉ ရာစု ကုန်းဘောင်ခေတ်ရှိ မြန်မာမှုဗိသုကာလက်ရာများကို အသုံးပြုထားပြီး ထိုခေတ်က ငွေဒင်္ဂါး တစ်သိန်းနှစ်သောင်းကျပ် ကုန်ကျခဲ့သည်။ နန်းတော်မှ ပြောင်းလဲ လာခဲ့သည့်ကျောင်းဖြစ်၍ ရွှေနန်းတော်ကျောင်းဟု အမည်ပေးခဲ့သော်လည်း ကျောင်းတော် အတွင်းအပြင် တစ်ခုလုံးကို ရွှေပိန်းချထားသည့်အတွက် ရွှေကျောင်းဟု လူသိများလာသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/atumashi_kyaung/1.jpg'),
                            require('@/assets/images/destination/mandalay/atumashi_kyaung/2.jpg'),
                        ],
                    title: `အတုမရှိကျောင်း (ခ) မဟာအတုလဝေယန်ကျောင်းတော်ကြီး `,
                    status: 0,
                    content: `မဟာအတုလဝေယန်ကျောင်းတော်ကြီး (ခ) အတုမရှိကျောင်းသည် မန္တလေးမြို့၊ အောင်မြေသာဇံမြို့နယ်၊ ဒေါနဘွားရပ်ကွက်၊ ရွှေကျောင်းနှင့်ကပ်လျက်တွင် တည်ရှိသည်။ မင်းတုန်းမင်းကြီးမှ ‌၁၈၅၉ ခုနှစ်တွင် ယောအတွင်းဝန် ဦးဘိုးလှိုင်အား ဦးစီးတည်ဆောက်စေခဲ့ရာ ၁၈၇၇ ခုနှစ်တွင် တည်ဆောက် ပြီးစီးခဲ့သည်။ ကျွန်းသစ်များဖြင့် ဆောက်လုပ်ထားကာ အင်္ဂတေအနုအမွမ်းများဖြင့် အပြင်မှတန်ဆာဆင် ထားသော ဘုံငါးဆင့်အဆောက်အဦဖြစ်ပြီး ရှေးရိုးအစဥ်အလာ ဘုန်းကြီးကျောင်းများနှင့် တည်ဆောက်ပုံ မတူဘဲ ဇေတဝန်တစ်ဆောင်တည်းဖြင့် တည်ဆောက်ထားသော ကျောင်းကြီးဖြစ်သည်။ ကျောင်းတော်ကြီးသည် အရှေ့အနောက်လှေကားအဆုံး (၃၃၉)ပေ၊ တောင်မြောက်(၂၈၁)ပေကျယ်၀န်းပြီး အမြင့်ပေ(၁၀၀)ရှိသည်။ အုတ်အင်္ဂတေဖြင့်ရံထားသော ကျွန်းတိုင်ပေါင်း(၂၄၆)တိုင်ဖြင့် တည်ဆောက်ထားပါ သည်။ မြန်မာမှုပန်းတော့ အုတ်အင်္ဂတေလက်ရာ မကရ်းလှေကားကြီး (၆)စင်းဖြင့် တည်ဆောက်ထားပါသည်။ နံရံမှတိုင်များတွင် ဖရုံမြှောင့်ခံ စုလစ်၊ မွန်းချွန်းများ၊ အမွှမ်းပန်းများ၊ မြန်မာဥဒေါင်းရုပ်နှင့် အင်္ဂတေကနုတ်ပန်း လက်ရာများ၊ ရတနာပုံခေတ် သစ်သားတံခါးမကြီးများမှာလည်း ဂုဏ်ယူ၀ံ့ကြွားဖွယ်ရာ စံနမူနာပြ လက်ရာများ ဖြစ်သည်။ ၁၈၉၀ ခုနှစ်တွင် မန္တလေးမြို့ မီးလောင်ကျွမ်းစဥ်က ကျောင်းဆောင်တစ်ခုလုံး မီးခခဲ့သောကြောင့် ၁၉၉၆ ခုနှစ်တွင် မြန်မာနိုင်ငံ ရှေးဟောင်းသုတေသနဌာနမှ မူလအတိုင်း ပြန်လည်ဆောက်လုပ်ခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mandalay_palace/1.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/2.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/3.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/4.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/5.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/6.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/7.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/8.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/9.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/10.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/11.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/12.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/13.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/14.jpg'),
                            require('@/assets/images/destination/mandalay/mandalay_palace/15.jpg'),
                        ],
                    title: `မန္တလေးနန်းတော် (ခ) မြနန်းစံကျော်ရွှေနန်းတော် `,
                    status: 0,
                    content: `မန္တလေးနန်းတော်သည် မန္တလေးမြို့၊ အောင်မြေသာဇံမြို့နယ်တွင်တည်ရှိပြီး ကုန်းဘောင်မင်းဆက်၏ နောက်ဆုံးနန်းတော်ဖြစ်သည်။ <br><br>
                    မင်းတုန်းမင်းသည် ၁၈၅၇ ခုနှစ်တွင် နန်းတော်၊ ကျုံး၊ နန်းမြို့ရိုး စသည်တို့ကို ဆောက်လုပ်ပြီး ရတနာပုံ နေပြည်တော်အဖြစ် စိုးစံခဲ့သည်။ ၄၁၃ ဟက်တာရှိသော နန်းတော်ဝင်းကို လေးဖက်လေးတန်တွင် ၂ ကီလိုမီတာအရှည်ရှိသော မြို့ရိုးနှင့် ကျုံးတို့က ကာရံထားသည်။ မြို့ရိုးတစ်လျှောက် ၁၆၉ မီတာတိုင်းတွင် ရဲမက်များကင်းစောင့်နိုင်ရန် သူရဲခိုများ ထည့်သွင်းတည်ဆောက်ထားသည်။ မြို့ရိုးတစ်ဖက်စီတွင် တံခါး (၃)ပေါက်စီရှိကာ စုစုပေါင်း တံခါး(၁၂)ပေါက်ရှိပြီး ပတ်လည်တွင် ကျုံးကိုကူးရန် တံတား(၅)စင်းရှိသည်။ နန်းတော်အတွင်းတွင် ပဟိုရ်စင်၊ စွယ်တော်စင်၊ လွှတ်တော်၊ တော်ဝင်ဂူဗိမာန်များ၊ ဒဂႅါးသွန်းစက်ရုံ၊ မြေနန်းပြဿဒ်တော်၊ အရှေ့ဇေတဝန်ဆောင်၊ ဗောင်းတော်ဆောင်၊ မှန်နန်းဆောင်၊ ဗြဲတိုက်ဆောင်၊ လေသာဆောင်၊ လက်ဖက်ရည်တော်ဆောင်၊ ရွှေတိုက်တော်၊ ပန်းခုံတော် အုတ်တိုက်၊ တောင်စမုတ်ဆောင်၊ မြောက်စမုတ်ဆောင်၊ တောင်ထားဝယ်ဆောင်နှင့် မြောက်ထားဝယ်ဆောင်၊ နန်းမြင့်၊ အနောက်ပိုင်း မင်းဆောင်တော်၊ အနောက်စမုတ်ဆောင်၊ အနောက်ပွဲတက်ဇေတဝန်ဆောင်တော်၊ တောင်ဖက်ဝဲဆောင်နှင့် မြောက်ဖက်ဝဲဆောင်၊ အနောက်ပိုင်း မိဖုရားဆောင်များ စသည်တို့ကိုလည်း တစ်စုတစ်ဝေးတည်း လေ့လာနိုင်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mahar_gandarone_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_gandarone_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_gandarone_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_gandarone_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_gandarone_monastery/5.jpg'),
                        ],
                    title: `မဟာဂန္ဓာရုံကျောင်းတိုက်`,
                    status: 0,
                    content: `မဟာဂန္ဓာရုံကျောင်းတိုက်သည် မန္တလေးတိုင်းဒေသကြီး၊ အမရပူရမြို့၊ တောင်သမန်အင်းအနီးတွင် တည်ရှိသည်။ ၁၉၁၀ ခုနှစ်တွင် တည်ဆောက်ခဲ့ပြီး သာသနာဆိုင်ရာ စာပေကျမ်းဂန်များ သင်ကြားပေးရာ ဘုန်းတော်ကြီးကျောင်းအဖြစ် ကမ္ဘာတွင်ထင်ရှားလူသိများပါသည်။ အဆိုပါ ဘုန်းတော်ကြီး ကျောင်း၌ သံဃာအပါး(၃၀၀၀)ကျော် စာပေသင်ကြားလျက်ရှိပြီး ဘာသာရေးဆိုင်ရာ စည်းမျဉ်းစည်းကမ်း တိကျစွာလိုက်နာသော ဘုန်းတော်ကြီးကျောင်းအဖြစ် ထင်ရှားပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/1.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/2.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/3.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/4.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/5.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/6.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/7.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/8.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/9.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_waiyan_bonetar/10.jpg'),
                        ],
                    title: `မဟာဝေယံဘုံသာ ဗားကရာကျောင်းတော် `,
                    status: 0,
                    content: `မဟာဝေယံဘုံသာ ဗားကရာကျောင်းသည် မန္တလေးတိုင်းဒေသကြီး၊ အမရပူရမြို့၊ မန္တလေး-စစ်ကိုင်း ကားလမ်းဘေးတွင် တည်ရှိသည်။ ကျောင်းတော်ကြီးသည် သက္ကရာဇ် ၁၁၄၄ ခုနှစ်တွင် ဘိုးတော် ဗဒုံမင်းတရားကြီးက ဆောက်လုပ်လှူဒါန်းခဲ့ပြီး ပထမဗားကရာကျောင်းကြီးသည် သက္ကရာဇ် ၁၁၈၃ ခုနှစ်တွင် မီးခပျက်စီးခဲ့သည်။ သာယာဝတီမင်း၏သားတော် ပုဂံမင်းသည် သက္ကရာဇ် ၁၂၀၉ ခုနှစ်တွင် ဒုတိယ မဟာဝေယံဘုံသာ ကျောင်းတော်ကြီးကို မြန်မာမှုအနုပညာလက်ရာတို့ဖြင့် ခန့်ညားလှပစွာ တည်ဆောက် လှူဒါန်းခဲ့ပြီး မင်းတုန်းမင်းလက်ထက် သက္ကရာဇ် ၁၂၂၈ ခုနှစ်တွင် ထပ်မံမီးလောင်ပြီး ပျက်စီးခဲ့ရာ အုန်လှေခါးကြီး (၈)စင်းသာ ကျန်ရှိခဲ့သည်။ လွတ်လပ်ရေးရပြီးနောက်တွင် ဗားကရာကျောင်းတော်ကြီးသည် တောချုံအတိ ဖုံးလွှမ်းတိမ်မြှုပ်ခဲ့ရာမှ သက္ကရာဇ် ၁၃၁၃ ခုနှစ်တွင် မြသိန်းတန်ဆရာတော် အရှင်ဉာဏုတ္တရက ပြန်လည်ဖော်ထုတ်ခဲ့သည်။ ယခုအခါ ရှေးမူမပျက် ပြန်လည်ပြုပြင်တည်ဆောက်ထားသည့် မဟာဝေယံဘုံသာ ဗားကရာကျောင်းတော်ကြီးကို ရှေးဟောင်းပြတိုက်အဖြစ် ဖွင့်လှစ်ထားပြီး ၁၇ ရာစု၊ ၁၈ ရာစုနှင့် ၁၉ ရာစုမှ သမိုင်းဝင် ဗုဒ္ဓဆင်းတုတော်များ၊ ရုပ်ပွားတော်များကို လေ့လာဖူးမြှော်နိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/shwe_kyin_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_kyin_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_kyin_monastery/3.jpg'),
                        ],
                    title: `မဟာဓမ္မိကာရာမ ရွှေကျင်ကျောင်းတိုက် `,
                    status: 0,
                    content: `မန္တလေးတောင်ခြေရှိ မဟာဓမ္မိကာရာမ ရွှေကျင်ကျောင်းတိုက်ကို သက္ကရာဇ် ၁၂၂၂ ခုနှစ်တွင် မင်းတုန်းမင်းတရားကြီးက ဆောက်လုပ်လှူဒါန်းခဲ့သည်။ ရွှေကျင်ကျောင်းတိုက်သည် ရှေးအကျဆုံးနှင့် တန်ဖိုး မဖြတ်နိုင်ဆုံး ဘုန်းကြီးကျောင်းဖြစ်သည်။ ကျောင်းကြီးမှာ ကျောင်းဦးပြသာဒ်​ဆောင်၊ စနု​ဆောင်၊ ​ဇေတဝန်​ဆောင်၊ ​ဘောဂ​ဆောင်​တွေနဲ့ ဖွဲ့စည်းထားပြီး အလှူရှင်မင်းတရားကြီးမှ တခမ်းတနားတည်​ဆောက် လှူဒါန်းခဲ့တာကို သိမြင်နိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/pyay_monastery/1.jpg'),
                        ],
                    title: `ပြည်ကျောင်းတိုက် (ခ) မဟာအတုလွတ်ဘုံစံပြည်ကျောင်းတိုက် `,
                    status: 0,
                    content: `ပြည်ကျောင်းတိုက် (ခ) မဟာအတုလွတ်ဘုံစံပြည်ကျောင်းတိုက်သည် ရန်ကုန်မှ မန္တလေးမြို့သို့အဝင် တံခွန်တိုင်အဝိုင်းပတ်အနီး ၇၈ လမ်းမကြီး၏ ညာဖက်ခြမ်းတွင်တည်ရှိသည်။ သာယာဝတီမင်းကြီး၏ သားတော် ပြည်မင်းသားက မြန်မာသက္ကရာဇ် ၁၂၀၁ ခုနှစ်တွင် ဆောက်လုပ်လှူဒါန်းခဲ့သည်။ သက်တမ်းအားဖြင့် နှစ်(၁၈၀)ကျော်ရှိပြီဖြစ်သော သစ်သားကျောင်းတိုက်ကြီးကို ကျွန်းသစ်တိုင်လုံးပေါင်း (၁၄၀)ကျော်ဖြင့် တည်ဆောက်ထားပြီး ဇေတဝန်ဆောင်မကြီးနှင့် အပြိုင်ဝဲယာတွင် ဆောင်ပွားနှစ်ဆောင် ပါဝင်ဖွဲ့စည်းထားပါသည်။ ပြည်ကျောင်းတိုက်တွင် ရှေးဟောင်းဗုဒ္ဓရုပ်ပွားတော်များ၊ ရှေးဟောင်း မှန်စီရွှေချ လက်ရာများ၊ ပလ္လင်တံကဲများ၊ စာတိုက်ဗီရိုများ၊ ယွန်းသေတ္တာကြီးများ၊ ဇာတ်တော်များဖြင့် ရုပ်လုံးရုပ်ကြွပုံများ ‌ဖော်ထားသော ကျွန်းသေတ္တာများ၊ ရှေးဟောင်းပေစာထုပ်များ၊ ရှေးဟောင်းကြေးခေါင်းလောင်း၊ တိုင်ရှည်များမှ ကနုတ်ပန်းများ၊ နတ်ရုပ်၊ သိကြားရုပ်နှင့် ပန်းပုရုပ်လုံးရုပ်ကြွများကို လေ့လာတွေ့ရှိနိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/shwe_inbin_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_inbin_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_inbin_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/shwe_inbin_monastery/4.jpg'),
                        ],
                    title: `ရွှေအင်ပင်ကျောင်း `,
                    status: 0,
                    content: `ရွှေအင်ပင်ကျောင်းသည် မန္တလေးမြို့၊ မဟာအောင်မြေမြို့နယ်၊ ဒေးဝန်းအရှေ့ရပ်ကွက်၊ ၃၇ လမ်းနှင့် ၃၈ လမ်းကြား၊ ၈၉ လမ်း အနောက်ဖက်ခြမ်းတွင် တည်ရှိသည်။ သီပေါမင်းပါတော်မူပြီး (၁၀)နှစ်အကြာ ၁၈၉၅ ခုနှစ်တွင် တရုတ်လူမျိုးသူဌေး ဦးစက်ရွှင်နှင့် ဇနီးဒေါ်ဘွားတို့က ဆောက်လုပ်လှူဒါန်းခဲ့ပြီး ယခုအခါ သက်တမ်း နှစ်(၁၀၀)ကျော်ရှိသော သမိုင်းဝင်ရှေးဟောင်းအမွေအနှစ် အဆောက်အအုံတစ်ခုဖြစ်သည်။ ကျောင်းကြီးကို တိုင်လုံးပေါင်း (၁၆၇)တိုင်ဖြင့် ဆောက်လုပ်ထားပြီး သရက်ကင်းပုံစံ ထုထည်ကြီးမားသော အုတ်လှေကား ရှစ်စင်းတပ်ဆင်ထားပါသည်။ ကျောင်းတိုက်ဝင်ပေါက်တံခါးများ၏ တစ်ဖက်စီတွင် လောကပါလ နတ်မင်းကြီး လေးပါးပုံများနှင့် စမြင်ပတ်လည် လက်ရမ်းများတွင် ကနုတ်ပန်းများနှင့် ရုပ်လုံးရုပ်ကြွများကို အသေးစိတ် ထုလုပ်ထားပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/mahar_tabayin_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_tabayin_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_tabayin_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_tabayin_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/mahar_tabayin_monastery/5.jpg'),
                        ],
                    title: `အက္ကပတ်မြင်းဝန်အုတ်ကျောင်း (ခ) မဟာဒီပဲရင်းကျောင်းတိုက်  `,
                    status: 0,
                    content: `မဟာဒီပဲရင်းကျောင်းတိုက်သည် မန္တလေးမြို့၊ အောင်မြေသာစံမြို့နယ်၊ ၈၆ လမ်း၊ ၁၈ လမ်းနှင့် ၁၉ လမ်းကြားတွင် တည်ရှိသည်။ သီပေါမင်းလက်ထက် အက္ကပတ်မြင်းဝန် ပင်လယ်မြို့စား မင်းကြီး မဟာမင်းထင်ရာဇာဘွဲ့ခံ ဦးချုံက ၁၈၈၃ ခုနှစ်တွင် ဆောက်လုပ်လှူဒါန်းခဲ့သည်။ အလှူရှင်အမည်ကို အစွဲပြု၍ “အက္ကပတ်မြင်းဝန်အုတ်ကျောင်း” ဟုထင်ရှားသည်။ ကျောင်းတိုက်မှာ ဘုရားခန်းဆောင်တစ်ခု၊ နှစ်ထပ် အုတ်တိုက် သုံးခုတို့ဖြင့် ဥရောပပုံစံအတိုင်း ဆောက်လုပ်ထားသော အုတ်ကျောင်းတိုက်ကြီးဖြစ်ပြီး မီးလောင်ခံခဲ့ရခြင်း၊ ဒုတိယကမ္ဘာစစ်အတွင်း ဗုံးဒဏ်ထိခံခဲ့ရခြင်းတို့ကြောင့် အပျက်အစီးထုထည်များကို မြင်တွေ့နိုင်ပါသည်။ အုတ်ကျောင်းကြီး၏ အ‌ရှေ့မျက်နှာစာတွင် ကမ္ဘာ့မဏ္ဍိုင် ဆုတောင်းပြည့်စေတီတော်ကို ဖူးမြှော်နိုင်ပါသည်။ ထိုစေတီတော်၏အတွင်းပိုင်းတွင် အဆင့်ပေါင်း(၁၀)ဆင့်ဖြင့် တည်ထားသော မဏ္ဍိုင် ဆောက်လုပ်ထားပြီး ထိုမဏ္ဍိုင်၏အဆင့်တိုင်းတွင် ဗုဒ္ဓဆင်းတုတော်များ ပူဇော်ခံထားရှိကာ စေတီတော် အတွင်းပိုင်း အလင်းရောင်ရရှိရန် စေတီတော်အလယ်တွင် အပေါက်ကြီးဖောက်ထားသည်ကို အခြားစေတီများ နှင့်မတူ ထူးခြားစွာ ဖူးမြှော်မြင်တွေ့နိုင်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/yamethin_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/yamethin_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/yamethin_monastery/3.jpg'),
                        ],
                    title: `ရမည်းသင်းကျောင်း `,
                    status: 0,
                    content: `ရမည်းသင်းကျောင်းသည် မန္တလေးမြို့၊ ၆၂ လမ်း၊ ၂၃ လမ်းနှင့် ၂၄ လမ်းကြား၊ မဟာဝိသုဒ္ဓါရုံ ကျောင်းတိုက်အတွင်း တည်ရှိသည်။ ၄င်းကျောင်းသည် နှစ်ပေါင်း(၂၀၀)နီးပါးသက်တမ်းရှိ ကျွန်းသားဖြင့် ဆောက်လုပ်ထားသည့် ကျောင်းဆောင်ကြီးဖြစ်သည်။ ကျောင်းကြီး၏ သမိုင်းကြောင်းအရ အမရပူရ နန်းတော်ကို ရတနာပုံ နေပြည်တော်ဆီ ပြောင်းရွှေ့တဲ့အခါ နန်းတော်ရဲ့အစိတ်အပိုင်းအချို့ကို ဘုန်းကြီး ကျောင်းအဖြစ် ဆောက်လုပ်လှူဒါန်းခဲ့ခြင်းဖြစ်ကြောင်းသိရသည်။ ရတနာပုံခေတ်လက်ရာ ကျောင်းဆောင်ကြီး ဖြစ်ပြီး ကျောင်းကြီးရဲ့အလှူရှင်မှာ မင်းတုန်းမင်းကြီးရဲ့ မိဖုရားတစ်ပါးဖြစ်တဲ့ ရမည်းသင်းမိဖုရား ဖြစ်သည်။ ကျောင်းဆောင်ကြီးမှာ ဒေါင်းပုံစံတံဆိပ်ကြီးနှင့် ပြဿဒ်ဘုံအဆင့်ဆင့်ဖြင့် ခမ်းနားတင့်တယ်လှပြီး မှန်စီရွှေချ အနုစိတ်လက်ရာများကို လေ့လာနိုင်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/moe_gaung_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/moe_gaung_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/moe_gaung_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/moe_gaung_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/moe_gaung_monastery/5.jpg'),
                        ],
                    title: `မိုးကောင်းကျောင်း `,
                    status: 0,
                    content: `မိုးကောင်းကျောင်းသည် မန္တလေးမြို့၊ ချမ်းအေးသာစံမြို့နယ်၊ ရမည်းသင်းကျောင်း၏ အရှေ့မျက်စောင်းထိုး မဟာဝိသုဒ္ဒါရာမတိုက်ဝန်းတွင်တည်ရှိပြီး သစ်သားကျောင်းတော်ဖြစ်ကာ ၁၈၄၇ ခုနှစ်တွင် မိုးကောင်းမိဖုရားက တည်ဆောက်ခဲ့သည်။ ကျောင်းတော်ကြီးကို လှေကား(၅)စင်း၊ ကျွန်းတိုင်လုံးပေါင်း (၃၄၁)တိုင်ဖြင့် အရှေ့အနောက် ပေ(၄၃၀)၊ အကျယ်(၁၉၈)ပေရှိခဲ့ကြောင်း၊ ၁၂၇၁ ခုနှစ်၊ ကဆုန်လဆန်း (၅)ရက်နေ့တွင် မန္တလေးမီးလောင်ရာမှ ပါသွားခဲ့‌ကြောင်း လေ့လာဖော်ပြထားပါသည်။ ၁၉၉၈ ခုနှစ်မှာ မိုးကောင်းမိဖုရားကြီးရဲ့ကျောင်းကို မြစ်တော်စပ်သူများက မွမ်းမံပြီး ကုသိုလ်ပြုပါတယ်လို့ ကျောက်စာတွင် ရေးထားပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/kyay_myin_monastery/1.jpg'),
                        ],
                    title: `ကြေးမြင်ကျောင်း `,
                    status: 0,
                    content: `ကြေးမြင်ကျောင်း (ရန္တပိုရွာစားကျောင်း) ဟုလည်းသိကြသည်။ ၄င်းကျောင်းသည် ရမည်းသင်း ကျောင်းနဲ့ မိုးကောင်းကျောင်းတို့ရဲ့ အရှေ့ဖက်တွင်တည်ရှိသည့် သမိုင်းဝင် ဘုန်းတော်ကြီးကျောင်း တစ်ခုဖြစ်သည်။ ကျောင်းတော်ကြီး၏ မူလအလှူရှင်သည် ရန္တပိုရွာစားဖြစ်ပြီး နောက်ပိုင်းမှာ မင်းတုန်းမင်းကြီး၏ ကြင်ရာတော်ငယ်တစ်ပါးဖြစ်သည့် ကြေးမြင်မိဖုရားက ၁၂၇၃ ခုနှစ်မှာ ပြန်လည်ပြုပြင် ခဲ့ပါသည်။ ကျောင်းတိုက်မှာ ဘုံသုံးဆင့်ပါရှိပြီး ရေနံဆီဝအောင် သုတ်လိမ်းကာ ထိန်းသိမ်းထားသဖြင့် အကောင်းပကတိအတိုင်း ကျန်နေပါသေးသည်။ ကျောင်းဆောင်ကြီးပေါ်တွင် ကြေးခုတင်၊ ရှေးမှန်အိမ်၊ မီးအိမ်များ၊ စာတိုက်ဗီရိုများနှင့် ရှေးဟောင်း မှန်ဗီရိုများကို တွေ့မြင်လေ့လာနိုင်မှာ ဖြစ်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/targawon_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/targawon_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/targawon_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/targawon_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/targawon_monastery/5.jpg'),
                        ],
                    title: `သာကဝန်ကျောင်း `,
                    status: 0,
                    content: `ကင်းဝန်မင်းကြီး ဦးကောင်း၏ ကောင်းမှုတော် သာကဝန်ကျောင်းတော်ကြီးသည် မန္တလေးမြို့၊ မဟာအောင်မြေမြို့နယ်၊ ၈၆ လမ်းနှင့် ၈၇ လမ်းကြား၊ ၃၈ လမ်းတွင်တည်ရှိပြီး သစ်သားဖြင့် အနောက်တိုင်းဟန် တည်ဆောက်ထားသော ရတနာပုံခေတ်လက်ရာဖြစ်သည်။ သာကဝန်ကျောင်းကို ကင်းဝန်မင်းကြီး ဦးကောင်းမှ မြန်မာသက္ကရာဇ် ၁၂၄၁ ခုနှစ်တွင် ငွေကျပ် ၅၀၀၀၀ ကျော် ကျခံသုံးစွဲ တည်ဆောက်ခဲ့ပြီး ပထမကျော် ပထမစာတော်ချကျမ်းပြု စလင်းဆရာတော် ဦးပညာသီဟအား လှူဒါန်းခဲ့ပါသည်။ တည်ဆောက်မှုအားလုံးကို ကျွန်းသားဖြင့်သာ ဆောက်လုပ်ထားပါသည်။ ကျောင်းတော်တွင် ကင်းဝန်မင်းကြီးသည် ဥရောပသို့ သံတမန်အဖြစ် သွားရောက်သည့်အခါတွင် တွေ့ရှိခဲ့သည့် အနောက်နိုင်ငံမှ အလှတန်ဆာများဖြစ်သည့် Corinthian တိုင်များ၊ ပန်းတန်းများ (Friezes) နှင့် အခုံးများ စသည်တို့ပါဝင်သည်။ ကျောင်းတော်ကို အမိုးခုံးပါဝင်ပြီး တိုက်တန်းများဖြင့် ဝန်းရံထားကာ ဥရောပဗိသုကာပညာရှင်များဖြစ်ကြသည့် အီတလီလူမျိုး M. Comodo နှင့် ပြင်သစ်လူမျိုး M. Bonvallein တို့က ဒီဇိုင်းရေးဆွဲထားသည်။ ကျောင်းတွင် တပ်ဆင်ထားသည့် အုတ်လှေကားများအနက် မြောက်ဖက်လှေကားသည် အကြီးဆုံးနှင့် အကျယ်ဆုံးဖြစ်သည်။ ကျောင်းတော်ကြီးရှိ ထူးခြားဆန်းပြားသော အနုအရွလက်ရာများကြောင့် ထိုခေတ်က မြန်မာ့လက်မှုပညာ နယ်ပယ် အဆင့်အတန်းမြင့်မားလှပုံကို တွေ့မြင်နိုင်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/tin_kazar_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/tin_kazar_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/tin_kazar_monastery/3.jpg'),
                        ],
                    title: `သင်္ဂဇာကျောင်း `,
                    status: 0,
                    content: `သင်္ဂဇာကျောင်းသည် မန္တလေးတိုင်းဒေသကြီး၊ ချမ်းအေးသာစံမြို့နယ်၊ လမ်း ၉၀၊ ၃၂ လမ်းနှင့် ၃၄ လမ်းကြားတွင်တည်ရှိပြီး သစ်သားကျောင်းဆောင်ကြီးဖြစ်သည်။ ခရစ်သက္ကရာဇ် ၁၈၆၁ ခုနှစ်တွင် ကျောင်းတော်ကို မင်းတုန်းမင်းတရားကြီးက သင်္ဂဇာဆရာတော် သီတင်းသုံးရန်အတွက် ဆောက်လုပ်လှူဒါန်းခဲ့သည်။ ကျောင်းတိုက်ကြီးမှာ ကျောင်းဦးပြဿဒ်ဆောင်၊ စနုဆောင်၊ ဘောဂဆောင်တွေနဲ့ ဖွဲ့စည်းတည်ဆောက်ထားပြီး သရက်ကင်းလှေကား၊ ပန်းပုလက်ရာတွေကလည်း လက်ရာမြောက်လှပါသည်။ နှစ်(၁၀၀)ကျော်သက်တမ်းရှိပြီ ဖြစ်သည့် သင်္ဂဇာကျောင်းသည် ကာလရွေ့လျားမှုကြောင့် ပျက်ဆီးယိုယွင်းမှုတွေများနေပေမယ့် လေ့လာသူတွေ အတွက် စိတ်ဝင်စားစရာများကို တွေ့မြင်နိုင်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/5.jpg'),
                            require('@/assets/images/destination/mandalay/yaw_min_gyi_monastery/6.jpg'),
                        ],
                    title: `ယောမင်းကြီးအုတ်ကျောင်း `,
                    status: 0,
                    content: `ယောမင်းကြီးအုတ်ကျောင်းသည် မန္တလေးတောင်ရဲ့ အနောက်ဖက်၊ ဥပုသ်တော်ရပ်ကွက်၊ ဂေါက်ကွင်းနဲ့ မျက်နှာချင်းဆိုင် မန္တလေး-မတ္တရာလမ်းရဲ့ လက်ဝဲဘက်ခြမ်းတွင် တည်ရှိပါသည်။ ကျောင်းတိုက်ကြီးကို မြန်မာသက္ကရာဇ် ၁၂၂၈ ခုနှစ်တွင် ယောအတွင်းဝန် ဦးဘိုးလှိုင်က ငွေကျပ် ၉၀၀၀၀ အကုန်အကျခံ၍ ဆောက်လုပ်လှူဒါန်းခဲ့ပါသည်။ ကျောင်းကြီးသည် မန္တလေးတွင်ရှိသည့် တခြားအုတ်ကျောင်း တွေနဲ့မတူဘဲ အနောက်တိုင်းဗိသုကာကို မြန်မာမှုလက်ရာတွေနဲ့ ရောယှက်တည်ဆောက်ထားတဲ့ ကျောင်းကြီး တစ်ကျောင်းလည်းဖြစ်သည်။ ကျောင်းကြီးရဲ့ အမိုးတွေကို အင်ကြင်းသားရက်မနဲ့ မြားတန်းတော်မှာ အုတ်ချပ်တွေခင်းပြီး တည်ဆောက်ထားခြင်းဖြစ်ပါသည်။ ကျောင်းမှာသုံးထားတဲ့ အုတ်တိုင်ကြီးတွေသည် အာသောကခေတ်က တိုင်လုံးတွေကိုပုံစံယူပြီး တည်ဆောက်ခဲ့တာဟု ဆိုပါသည်။ ကျောင်းတော်ကြီးဟာ ဒုတိယကမ္ဘာစစ်အတွင်းမှာ ဗုံးဒဏ်သင့်ပြီး အချို့အစိတ်အပိုင်းတွေ ပျက်စီးခဲ့ရပေမယ့် ယနေ့ခေတ်အထိတောင် ခမ်းနားထည်ဝါနေဆဲပဲ ဖြစ်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/myin_won_mingyi_monastery/1.jpg'),
                        ],
                    title: `မြင်းဝန်မင်းကြီးကျောင်း `,
                    status: 0,
                    content: `မြင်းဝန်မင်းကြီးကျောင်းသည် မန္တလေးမြို့၊ ဘုရားကြီးမြောက်ဖက်ခြမ်း ၄၂×၄၅ လမ်းကြား၊ ၈၄×၈၂ လမ်းကြားတွင် တည်ရှိသည်။ ကျောင်းတိုက်ကြီးကို အမရပူရခေတ် ဘိုးတော်ဘုရားလက်ထက် သက္ကရာဇ် ၁၁၄၇ ခုနှစ်တွင် မြင်းဝန်မင်းကြီး ဦးမြတ်ထင်က ဆောက်လုပ်လှူဒါန်းခဲ့ပါသည်။ မင်းတုန်းမင်းလက်ထက် သက္ကရာဇ် ၁၂၃၁ ခုနှစ်တွင် ကျောင်းကြီးမီးလောင်ပျက်စီးခဲ့တာမို့ ကိုလိုနီခေတ်ရောက်မှ ပြန်လည် တည်ဆောက်ခဲ့တာလို့ သိရပါသည်။ ကျောင်းတိုက်ကြီးထဲတွင် တစ်ထပ်ဝရံတာခံပြီး ဘေးပတ်ပတ်လည်မှာ ရွှေရောင်သစ်ထွင်း ကနုတ်လက်ရာများကို လေ့လာနိုင်ပါသည်။ ကျောင်ဆောင်တစ်ခုလုံးကို ကိုလိုနီခေတ် လက်ရာများနဲ့ အမြင်ဆန်းပြီး ထူးခြားစွာတည်ဆောက်ထားတာမို့ သွားရောက်လေ့လာသင့်တဲ့ ကျောင်းဆောင် ကြီးဖြစ်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/khay_mar_ti_won_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/khay_mar_ti_won_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/khay_mar_ti_won_monastery/3.jpg'),
                        ],
                    title: `ခေမာသီဝံကျောင်း `,
                    status: 0,
                    content: `ခေမာသီဝံကျောင်းသည် မန္တလေးမြို့ ၈၇ လမ်း၊ ၂၀ လမ်းနှင့် ၂၁ လမ်းကြားတွင်တည်ရှိပြီး နှစ်ပေါင်း (၁၀၀)ကျော်သက်တမ်းရှိသည့် အုတ်ကျောင်းကြီးဖြစ်သည်။ သီပေါမင်းလက်ထက်က ဆောက်လုပ်ခဲ့သည့် ကျောင်းအမည်ကို အစွဲပြုပြီး ခေမာသီဝံကျောင်းလို့ခေါ်သလို "သာသနဇောတိက" အုတ်ကျောင်းဟုလည်း ခေါ်ကြသည်။ သာသန​ဇောတိက အုတ်ကျောင်းကြီးကို မန္တ​လေးမြို့ ပြည်​ကြီးကျက်​သ​ရေရပ်​​နေ ဇရပ်​အစ်မကြီးရဲ့သမီး မမဇင်​က ၁၉၁၉ ခုနှစ်​မှာ​ ဆောက်လုပ်​လှူဒါန်းခဲ့ကြောင်း သိရပါသည်။ ​အရင်က ကျောင်းတိုက်ကြီးသည် သံဃာအပါး(၂၀၀)ကျော်​ သီတင်းသုံးနိုင်​​အောင်​ ကျယ်ဝန်းခဲ့တာလို့ ဆိုပါသည်။ ဒုတိယ ကမ္ဘာစစ်တွင် ဗုံးဒဏ်သင့်ခဲ့တာကြောင့် ရှေ့မျက်နှာစာနဲ့ လှေကားလောက်ပဲ ကျန်ရှိပါတော့သည်။ ဒါပေမယ့်လည်း ကျောင်းကြီးရဲ့ အရင်ခေတ်အခါတုန်းက ခံ့ညားထည်ဝါခဲ့မှုကို ယနေ့အချိန်ထိတောင် ပြန်မြင်နေရဆဲ ဖြစ်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/saint_joeseph_cathedral/1.jpg'),
                            require('@/assets/images/destination/mandalay/saint_joeseph_cathedral/2.jpg'),
                        ],
                    title: `စိန်ဂျိူးဆက်ဘုရားရှိခိုးကျောင်း `,
                    status: 0,
                    content: `စိန်ဂျိူးဆက်ဘုရားရှိခိုးကျောင်းသည် မန္တလေးမြို့၊ ချမ်းအေးသာစံမြို့နယ်၊ အောင်နန်းရိပ်သာအရှေ့၊ လမ်း ၈၀၊ ၃၄ လမ်းနှင့် ၃၅ လမ်းကြားတွင်တည်ရှိသည်။ မန္တလေးရှိ အသင်းတော်နယ်ခံများမှ ကောင်းမွန်စွာ စောင့်ရှောက်ထားသော အေးချမ်းသည့်ကတ်သလစ်ခရစ်ယာန် ဘုရားကျောင်းဖြစ်သည်။ ၁၉၁၀ ပြည့်နှစ်တွင် မြန်မာနိုင်ငံသို့ရောက်ရှိလာသော ပြင်သစ်ကတ်သလစ်သာသနာပြု ခရစ်ယာန်ဘုန်းတော်ကြီး ဖာသာ ဂျိုးဇက်လဖုန်းက ၁၉၁၉ ခုနှစ်တွင် စတင်ဆောက်လုပ်ခဲ့ပြီး ၁၉၃၃ ခုနှစ်တွင် တည်ဆောက်ပြီးစီးခဲ့သည်။ အနောက်ဥရောပ အနုပညာလက်ရာဖြင့် တည်ဆောက်ခဲ့သော ဘုရားရှိခိုးကျောင်းဖြစ်သည်။ ၄င်းဘုရား ရှိခိုးကျောင်းကို ၂၀၂၂ ခုနှစ်၊ ဧပြီလ ၈ ရက်နေ့တွင် သာသနာရေးနှင့် ယဉ်ကျေးမှုဝန်ကြီးဌာနက ရှေးဟောင်း အဆောက်အအုံအဖြစ် သတ်မှတ်ခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/u_bein_bridge/1.jpg'),
                            require('@/assets/images/destination/mandalay/u_bein_bridge/2.jpg'),
                            require('@/assets/images/destination/mandalay/u_bein_bridge/3.jpg'),
                            require('@/assets/images/destination/mandalay/u_bein_bridge/4.jpg'),
                        ],
                    title: `ဦးပိန်တံတား `,
                    status: 0,
                    content: `ဦးပိန်တံတားသည် မန္တလေးတိုင်းဒေသကြီး၊ အမရပူရမြို့နယ်ရှိ တောင်သမန်အင်းကို ဖြတ်ကျော်ကာ တည်ဆောက်ထားပြီး (၀.၇၅)မိုင်ရှည်လား၍ ကမ္ဘာပေါ်တွင် အရှည်ဆုံးကျွန်းတံတားဖြစ်သည်။ သက္ကရာဇ် ၁၂၁၁ ခုနှစ် ပုဂံမင်းလက်ထက်တွင် အမရပူရမြို့စာရေး ဦးပိန်တည်ဆောက်ခဲ့သောကြောင့် ဦးပိန်တံတားဟု အမည်ခေါ်တွင်ကြသည်။ ခြေလှမ်းဖြင့်တိုင်းတာ၍ ဆောက်ခဲ့ရသော မြန်မာမှုတံတားကြီးဖြစ်ပြီး လှိုင်းဒဏ် လေဒဏ်ခံနိုင်အောင် ဖြောင့်တန်းစွာမဆောက်ပဲ တောင်ဖက်သို့ဦးမော့ကွေ့ဝိုက်ကာ ကျင်တွယ်ပုံသဏ္ဍာန် ဆောက်လုပ်ထားခြင်းဖြစ်သည်။ တံတားကြီး၏တိုင်များမှာ ဇရပ်လေးဆောင်မှ တိုင်များပါပေါင်းလျှင် တိုင်ပေါင်း (၁၀၈၆)တိုင်ရှိပြီး ယခုအခါ တံတားကြီး၏သက်တမ်းမှာ နှစ်ပေါင်း(၁၅၀)‌ကျော်ပြီဖြစ်သည်။ တံတား၏တိုင်များမှာ အင်းဝနှင့် စစ်ကိုင်းမြို့ဟောင်းများမှ နန်းတော်တိုင်များဖြစ်သည်။ ဦးပိန်တံတားသည် ယနေ့အခါတွင် တောင်သမန်အင်း၏ အထင်ကရပြယုဂ်အနေဖြင့် ထင်ရှားလျက်ရှိပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/zay_cho/1.jpg'),
                        ],
                    title: `စျေးချို `,
                    status: 0,
                    content: `အစားအသောက်စုံလင်လှသည့် မန္တလေးမြို့ရဲ့ စျေးချိုသည် အထက်မြန်မာပြည်တွင် အကြီးဆုံး‌စျေး တစ်ခုဖြစ်ပြီး မြန်မာနိုင်ငံတွင် ရှေးအကျဆုံး စျေးတစ်ခုလည်းဖြစ်သည်။ ၁၉၉၀ ခုနှစ်တွင် ပြည်ထောင်စု အစိုးရ၏ ခွင့်ပြုချက်ဖြင့် အဆောက်အဦများကို ပြန်လည်မွန်းမံခဲ့သည်။  <br><br>
                    ဈေးချိုတွင် မြန်မာနိုင်ငံအတွင်း ပစ္စည်းတွေသာမက ထိုင်းနိုင်ငံ၊ တရုတ်နိုင်ငံနှင့် အိန္ဒိယနိုင်ငံများမှ တင်သွင်းသော ပစ္စည်းများကိုလည်း ရရှိနိုင်သည်။  လက်လီ၊ လက်ကားရောင်း၀ယ်တဲ့ ဈေးဖြစ်သည့်အတွက် တခြားဈေးတွေမှာ ဈေး၀ယ်ခြင်းထက် ပိုမိုသက်သာတာကို တွေ့နိုင်ပါသည်။ စားသောက်ကုန်မှသည် အကောင်းဆုံးသောရက်ထည်များအထိ အမျိူးစုံသော လူသုံးကုန်ပစ္စည်းများ၊ လက်ဆောင်ပစ္စည်းများနှင့် ဒေသထွက်ကုန်ပစ္စည်းများကို ဝယ်ယူရရှိနိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/tup_pa_wadi/1.jpg'),
                            require('@/assets/images/destination/mandalay/tup_pa_wadi/2.jpg'),
                            require('@/assets/images/destination/mandalay/tup_pa_wadi/3.jpg'),
                            require('@/assets/images/destination/mandalay/tup_pa_wadi/4.jpg'),
                        ],
                    title: `တမ္ပဝတီ (ကြေးသွန်း၊ ကြေးခတ် ပန်းတဥ်းလုပ်ငန်း)  `,
                    status: 0,
                    content: `ယဉ်ကျေးမှုမြို့တော် မန္တလေးတွင် မြန်မာ့ပန်းဆယ်မျိုးအတတ်ပညာများ များစွာတည်ရှိလျက်ရှိရာ အဆိုပါအတတ်ပညာများတွင် တစ်ခုအပါအဝင်ဖြစ်သော ကြေးသွန်း၊ ကြေးခတ် ပန်းတဉ်းလုပ်ငန်းကို မန္တလေးမြို့၊ ချမ်းမြသာစည်မြို့နယ်ရှိ တမ္ပဝတီရပ်ကွက်၌ တွင်ကျယ်စွာလုပ်ကိုင်လျက်ရှိပါသည်။ အဆိုပါ ကြေးသွန်း(ပန်းတဉ်း) လုပ်ငန်းကို တမ္ပဝတီရပ်ကွက် တစ်ရပ်ကွက်လုံးနီးပါး လုပ်ကိုင်လျက်ရှိပြီး ဆင်းတုတော်၊ ခေါင်းလောင်း၊ မောင်း၊ မောင်းဆိုင်း၊ ကြေးစည်၊ လင်းကွင်း၊ ကြေးဖြင့်ပြုလုပ်သော ဆက်စပ်ပစ္စည်းအမျိုးမျိုး လုပ်ကိုင်လျက်ရှိပါသည်။ ခရီးသွားဧည့်သည်များအနေဖြင့် အလုပ်ရုံကိုလည်ပတ်နိုင်ရုံသာမက လက်မှုလုပ်ငန်း များကို နားလည်ကြည့်ရှုခြင်းနှင့် အမှတ်တရလက်ဆောင်များလည်း ဝယ်ယူနိုင်သောနေရာဖြစ်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/stone_carving/1.jpg'),
                            require('@/assets/images/destination/mandalay/stone_carving/2.jpg'),
                            require('@/assets/images/destination/mandalay/stone_carving/3.jpg'),
                            require('@/assets/images/destination/mandalay/stone_carving/4.jpg'),
                        ],
                    title: `နှစ်တစ်ရာကျော် ကျောက်ဆစ်လုပ်ငန်း `,
                    status: 0,
                    content: `မန္တလေးတိုင်းဒေသကြီး၊ ချမ်းမြသာစည်မြို့နယ်၊ မဟာမုနိဘုရားကြီးအနောက်ဖက်မုခ်မှာရှိတဲ့ ကျောက်ဆစ်လုပ်ငန်းဟာ သက်တမ်းရာစုနှစ်တစ်ခုကျော်လာခဲ့ပြီဖြစ်သည်။ ဤနေရာလမ်းတစ်လျှောက်မှာ စကျင်ကျောက်ဆစ် ထုလုပ်တဲ့လုပ်ငန်းနဲ့ ဆိုင်ခန်းတွေကို တွေ့ရမည်ဖြစ်သည်။ ဘုရားဆင်းတုတော်တွေအပြင် ကွမ်ရင်ရုပ်တု၊ ဆင်ရုပ်တု၊ နဂါးရုပ်တုအပါအ၀င် အခြားရုပ်တုတွေနဲ့ ထုလက်စ ရုပ်တုများစွာကို တွေ့ရမည်ဖြစ်သည်။ မြန်မာနိုင်ငံအနှံ့ ဘုရားစေတီများမှာ ထားရှိပူဇော်ကြတဲ့ ဆင်းတုတော်များနဲ့ ရုပ်တုတွေကို ၄င်းကျောက်ဆစ်တန်းကတစ်ဆင့် ဖြန့်ချိရောင်းချကြလျက်ရှိသည်။ ခရီးသွားဧည့်သည်များသည် လက်မှုလုပ်ငန်းကို နားလည်ကြည့်ရှုခြင်းနှင့် အမှတ်တရလက်ဆောင်များလည်း ဝယ်ယူနိုင်သောနေရာ ဖြစ်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/win_gabar_pagoda/1.jpg'),
                            require('@/assets/images/destination/mandalay/win_gabar_pagoda/2.jpg'),
                        ],
                    title: `အင်းဝမြို့ဟောင်းနှင့် လေ့လာစရာ ဝင်္ကပါစေတီ `,
                    status: 0,
                    content: `အင်းဝရှေးဟောင်းယဉ်ကျေးမှုနယ်မြေသည် စိတ်ဝင်စားဖွယ်ရာများစွာတည်ရှိပြီး ပြည်တွင်းပြည်ပ ခရီးသွားဧည့်သည်များကို အထူးဆွဲဆောင်နိုင်သည့် သမိုင်းဝင်နေရာတစ်ခုဖြစ်သည်။ စိတ်ဝင်စားဖွယ် လေ့လာစရာ များစွာတည်ရှိသော အင်းဝမြို့သည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်အတွင်း တည်ရှိသည်။ <br><br>
                    အင်းဝရှေးဟောင်းနယ်မြေရှိ စိတ်ဝင်စားဖွယ်ရာစေတီများထဲတွင် ဝင်္ကပါစေတီလည်း ပါဝင်သည်။ ဝင်္ကပါစေတီမှာ စိတ်ဝင်စားဖွယ်ရာကောင်းပြီး လိုဏ်ဂူကြီးသဏ္ဍာန်တည်ထားသည်။ အတွင်းဖက်တွင် အကွေ့အကောက်များဖြင့် လှည့်ပတ်၍တက်နိုင်သော လှေကားများပါရှိသည်။ စေတီအတွင်းပိုင်းကို ဝင်လိုက်သည်နှင့်အေးမြပြီး ဝင်ပေါက်ထွက်ပေါက် မမှားအောင်သွားရသည်မှာ ပိုမိုစိတ်ဝင်စားဖွယ် ကောင်းလှသည်။ စေတီကြီး၏ ပြင်ပနံရံပတ်လည်တွင် ညောင်ရမ်းခေတ်လက်ရာ အင်္ဂတေပန်းတော့ ကြာမှောက်တချို့တစ်ဝက်ကို လေ့လာနိုင်သည်။ ဝင်္ကပါပေါက်များကို ကျော်လွန်ကာ စေတီတော် အပေါ်ပိုင်းသို့ရောက်သည်နှင့် အနီးနားရှိ ဘုရားစုမြင်ကွင်းများကို မြင်တွေ့နိုင်ပြီး ပြည်တွင်းခရီးသွား ဧည့်သည်များနှင့် နိုင်ငံတကာခရီးသွားဧည့်သည်များကို အထူးဆွဲဆောင်စေသည့်နေရာအဖြစ် တည်ရှိနေသည်။ <br><br>
                    အင်းဝမြို့ကို မင်းလေးပါးက လေးကြိမ်လေးခါတိတိ ပြန်လည်တည်ခဲ့သည့်အတွက် ဗိသုကာ အနုပညာလက်ရာမျိုးစုံတည်ရှိသည်။ အင်းဝမြို့ကို သတိုးမင်းဖျားက သက္ကရာဇ် ၇၂၆ ခုနှစ်၊ တပေါင်းလဆန်း ၆ ရက်နေ့တွင် ပထမဆုံးတည်ခဲ့သည်။ မြို့နန်းကို (၇)လနှင့်အပြီးတည်ကာ မြို့ကို ရတနာပူရမြို့၊ နန်းကို ရွှေဘုံသာနန်းဟု ကမ္ပည်းတင်ခဲ့သည်။ အင်းဝမြို့သည် မြို့သက် (၄၇၃)နှစ်ကြာမြင့်ခဲ့ပြီး မင်းဆက် (၃၄)ဆက် စိုးစံခဲ့သော မြို့ဖြစ်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/lay_htat_gyi_temple/1.jpg'),
                        ],
                    title: `လေးထပ်ကြီးကျောင်း`,
                    status: 0,
                    content: `လေးထပ်ကြီးကျောင်းသည် မန္တလေးတိုင်းဒေသကြီး၊ အင်းဝမြို့ဟောင်းတွင် တည်ရှိသည်။ မူလလေးထပ်ကျောင်းဆောင်ကြီးကို ခရစ်နှစ် ၁၆၀၁ ခုနှစ်တွင် ဒုတိယအင်းဝခေတ် စတည်ထောင်သူ ညောင်ရမ်းမင်းတရားကြီးက တည်ဆောက်လှူဒါန်းခဲ့ခြင်း ဖြစ်သည်။ သို့သော် ပင်းတလဲမင်းလက်ထက် ခရစ်နှစ် ၁၆၅၈ ခုနှစ်တွင် ညောင်ရမ်းမင်းကောင်းမှု မူလလေးထပ်ကျောင်းဆောင်ကြီးသည် မီးလောင် ပျက်စီးခဲ့ရသည်။ <br><br>
                    ကုန်းဘောင်ခေတ် ဘကြီးတော်ဘုရားလက်ထက် ခရစ်နှစ် ၁၈၂၇ ခုနှစ်တွင် မဟာသကျမုနိ ဘုရားကြီးကို သွန်းလုပ်ခဲ့သည်။ သကျမုနိရုပ်ပွားတော်ကြီးသည် ရွှေစင်၊ ငွေစင်၊ ကြေးစင်၊ သံ၊ သလွဲများနှင့် ရောစပ်သွန်းလုပ်ထားကာ ၁၆၁၁၀ ပိဿာ အလေးချိန်ရှိသော ပဉ္စလောဟာရုပ်ပွားတော်ကြီးဖြစ်သည်။ ဘကြီးတော်သည် ရုပ်ပွားတော်ကြီး သီတင်းသုံးဖို့ရာ အုတ်ပြသာဒ်ကြီးကို ယခင်လေးထပ်ကျောင်းကြီး နေရာဟောင်းမှာပင် တည်ဆောက် လှူဒါန်းခဲ့သည်။ လေးထပ်ကျောင်းကြီးဟု အမည်တွင်သည်။ ရုပ်ပွားတော်ကြီး၏ သက်တမ်းသည် နှစ်ပေါင်း(၁၈၀)ကျော်ခဲ့ပြီဖြစ်သလို လေးထပ်ကျောင်းကြီး၏ သက်တမ်း သည်လည်း အလားတူ အနှစ်(၁၈၀)ကျော်နေပြီဖြစ်သည်။  <br><br>
                    သက္ကရာဇ် ၁၂၀၀ ပြည့် (ခရစ်နှစ်-၁၈၃၈ခု)တွင် ငလျင်ဒဏ်ကြောင့် ကျောင်းဆောင်ကြီး ယိုယွင်းပျက်စီးခဲ့ရသည့်အတွက် ပုဂံမင်းလက်ထက် ခရစ်နှစ် ၁၈၄၇ ခုနှစ်တွင် အမရပူရနေပြည်တော် တောင်သမန်ကန်အနီး ပုထိုးတော်ကြီး တောင်ဖက်ရှိ မဟာဝေယန်ဘုံသာပြာသာဒ်ကြီးသို့ ပြောင်းရွှေ့ ပူဇော်ခဲ့သည်။ သီပေါမင်းလက်ထက် ၁၈၅၅ ခုနှစ်ရောက်သောအခါ ခမည်းတော်မင်းတုန်းမင်း၏ အိမ်တော်ရာဟောင်းဖြစ်ခဲ့သော အခုလက်ရှိ ဆင်းတုတော်ကြီးသီတင်းစံပါယ်တော်မူရာနေရာသို့ ထပ်မံပြောင်းရွှေ့ပူဇော်ခဲ့သည်။ ငလျင်ဒဏ်ကြောင့် လဲပြိုခဲ့ရသော အင်းဝမြို့ဟောင်းမှ လေးထပ် ကျောင်းကြီးမှာ ယနေ့တိုင်ကျန်ရှိနေဆဲပင်ဖြစ်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/me_nu_brick_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/me_nu_brick_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/me_nu_brick_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/me_nu_brick_monastery/1.jpg'),
                        ],
                    title: `မယ်နုအုတ်ကျောင်း`,
                    status: 0,
                    content: `မယ်နုအုတ်ကျောင်းသည် မန္တလေးတိုင်းဒေသကြီး၊ အင်းဝမြို့ဟောင်းတွင် တည်ရှိသည်။ မယ်နုအုတ်ကျောင်းကို မဟာအောင်မြေဘုံစံ ကျောင်းတော်ကြီးဟုလည်းခေါ်သည်။ မြန်မာသက္ကရာဇ် ၁၁၈၉ ခုနှစ်တွင် ဘကြီးတော်မင်းတရားနှင့် နန်းမတော်မယ်နုတို့က ဆောက်လုပ်၍ ညောင်ကန်ဆရာတော် ဦးပိုးအား လှူဒါန်းခဲ့သည်။ ယင်းဆရာတော် ဦးပိုးသည် ၁၁၉၁ ခုနှစ်၊ သက်တော် ၅၁ နှစ်၊ ဝါတော် ၃၂ နှစ်ဝါတွင် ပျံလွန်တော်မူသည်။ ထို့နောက် ဆရာတော်ဦးပိုး၏တပည့် ဆရာတော်ဦးဗုဓ်အား တရားစစ်မေးပြီး ကျောင်းတိုက်အပ်နှံသည်။ မြန်မာသက္ကရာဇ် ၁၂၀၀ ခုနှစ်တွင် ငလျင်ဒဏ်ကြောင့် ပြိုပျက်ခဲ့ပြီး ၁၂၃၄ တွင် နန်းမတော်မယ်နု၏ သမီးတော် ဆင်ဖြူမရှင်က ထပ်မံပြင်ဆင်ခဲ့သည်။ မယ်နုအုတ်ကျောင်းသည် ကုန်းဘောင်ခေတ်မှ ထင်ရှားသော မြန်မာမှုဗိသုကာလက်ရာ စံပြကျောင်းတော်ကြီးတစ်ခုလည်းဖြစ်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/yadana_hsemee_pagoda/1.jpeg'),
                            require('@/assets/images/destination/mandalay/yadana_hsemee_pagoda/2.jpg'),
                        ],
                    title: `ရတနာဆီမီးစုဘုရား`,
                    status: 0,
                    content: `ရတနာဆီမီးဘုရားစုသည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့ အင်းဝနန်းတော်ရာ အနောက်ဖက် အပြင်စံရာကျေးရွာအနီးတွင် တည်ရှိသည့် ရှေးဟောင်းဘုရားစေတီများဖြစ်သည်။ ရတနာ ဆီမီးဘုရားစုတွင်စေတီခြောက်ဆူ၊ အုတ်ပြာဿာဒ်တစ်ဆူနှင့် ဂန္ဓကုဋိတိုက် (၃)တိုက်တည်ရှိပြီး လက်ရာမျိုးစုံကို လေ့လာနိုင်သည်။ ရတနာဆီမီးဘုရားစုအတွင်းတွင် အဆောက်အအုံအမှတ် (၃၇၂)မှ (၃၈၁)အထိ အမှတ်စဉ်အလိုက် ဗိသုကာလက်ရာ (၁၀)ခုကို တစ်နေရာတည်းတွင် တည်ရှိသည်။ ဗိသုကာ လက်ရာပုံစံများမှာ အမရပူရခေတ်လက်ရာ အုတ်ပြာသာဒ်၊ ရတနာပုံခေတ်လက်ရာ ဆင်းတုတော်နှင့် ကုန်းဘောင်ခေတ်ဦးလက်ရာများ ဖြစ်သည်။ ရတနာဆီမီးဘုရားစုတွင် လက်ပံပင်များ၊ ထန်းပင်များဝန်းရံကာ အစုလိုက်တည်ရှိနေပြီး ပြည်တွင်းဘုရားဖူးဧည့်သည်များ၊ နိုင်ငံတကာခရီးသွားဧည့်သည်များ လာရောက် လေ့လာခြင်း၊ မှတ်တမ်းရိုက်ကူးခြင်းများကို အများဆုံးပြုလုပ်ကြသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/hsin_gyone_fort/1.jpg'),
                            require('@/assets/images/destination/mandalay/hsin_gyone_fort/2.jpg'),
                            require('@/assets/images/destination/mandalay/hsin_gyone_fort/3.jpg'),
                        ],
                    title: `ဆင်ကျုံးခံတပ်`,
                    status: 0,
                    content: `ဆင်ကျုံးခံတပ်သည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့၊ ဆင်ကျုံးကျေးရွာအနီး၊ ဧရာဝတီမြစ်တောင်ဖက်တွင် တည်ရှိသည်။ သာယာဝတီမင်းလက်ထက် ဆင်းရိုင်းများကျော့ရာကျုံးကို ခံတပ်အဖြစ် ပြုပြင်တည်ဆောက်ခဲ့ပြီး ဆင်ကျုံးခံတပ်ဟူ၍ခေါ်ကြသည်။ ဆင်ကျုံးခံတပ်ကို မြန်မာသက္ကရာဇ် ၁၂၃၆ ခုနှစ်၊ မင်းတုန်းမင်းလက်ထက်တွင် အိမ်ရှေ့စံကနောင်မင်း၊ ကင်းဝန်မင်းကြီး ဦးကောင်း၊ ယောမင်းကြီး ဦးဘိုးလှိုင်တို့၏ စီမံမှုဖြင့် အီတလီလူမျိုးပညာရှင် Commotto က ဦးဆောင်ကြီးကြပ်၍ တည်ဆောက်ခဲ့သည်။ ဧရာဝတီမြစ်ကြောင်းမှ ဆန်တက်လာမည့် နယ်ချဲ့တို့အား ခုခံတိုက်ခိုက်ရန် ရတနာပုံနေပြည်တော်အနီး အင်းဝတွင် ဆင်ကျုံးခံတပ်၊ စစ်ကိုင်းတွင် အစေခံခံတပ်၊ အမရပူရတွင် သပြေတန်းခံတပ်ဟူ၍ သုံးပွင့်ဆိုင် တည်ဆောက်ခဲ့သော ခံစစ်စခန်းဖြစ်သည်။ <br><br>
                    ဆင်းကျုံးခံတပ်သည် စတုရန်းပုံဖြစ်ပြီး အုတ်တံတိုင်းသုံးထပ်ရှိသည်။ ခံတပ်ပတ်လည်တွင် ကျုံးရှိပြီး အုတ်ရိုးများဖြင့် တည်ဆောက်ထားသည်။ အပြင်တံတိုင်းမှာ တစ်မျက်နှာလျှင် ၃၅၅ ပေရှိပြီး အလယ်တံတိုင်းမှာ တစ်မျက်နှာလျှင် ၂၉၃ ပေရှိသည်။ တံတိုင်းနှစ်ခုကြားတွင် ၃၁ ပေကျယ်သော ကျုံးရှိပြီး ခံတပ်အတွင်းသို့ ဝင်ရောက်နိုင်ရန် အရှေ့ဖက်တွင် ကျုံးကိုဖြတ်၍ အလျား ၃၂ ပေ၊ အနံ ၂၀ ပေရှိသော တံတားကို ယက်မလျှိုကာဆောက်လုပ်ထားသည်။ ကျုံး၏အတွင်းဖက်တွင် တစ်မျက်နှာလျှင် ၂၁၃ ပေရှည်လျားသော အုတ်တံတိုင်းရှိပြီး အပြင်ဖက်မှ မြေကြီးများဖြည့်ကာ ကတုတ်သဖွယ် ပြုလုပ်ထားပါသည်။ ခံတပ်၏ မြောက်ဖက်အတွင်းဖက်တွင် သရဲပြေးပေါ်၌ ဆုံလည်အမြှောက်များ၊ စိန်ပြောင်းများ၊ သေနတ်များ ထားရာ စက်ဝိုင်းပုံသဏ္ဍာန် အုတ်စီအဝိုင်းပေါက်များ ပြုလုပ်ထားသည်။ အတွင်း၌ လက်နက်တိုက်နှင့် ခဲယမ်းတိုက်ပါရှိသည်။ ဆင်ကျုံးခံတပ်ကို ၁၉၅၇ ခုနှစ်မှစ၍ ရှေးဟောင်းသုတေသနနှင့် အမျိုးသားပြတိုက် ဦးစီးဌာနမှ တာဝန်ယူထိန်းသိမ်းစောင့်ရှောက်လျက်ရှိသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/law_ka_du_tha_man_aung/1.jpg'),
                        ],
                    title: `လောကဒုဿမာရ်အောင်စေတီ`,
                    status: 0,
                    content: `လောကဒုဿမာရ်အောင်စေတီသည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့ဟောင်း၊ ဗားကရာကျောင်းအနောက်ဖက်တွင် တည်ရှိသော ညောင်ရမ်းခေတ် ရှေး‌ဟောင်းစေတီ တစ်ဆူဖြစ်သည်။ ၄င်းစေတီတော်ကို ညောင်ရမ်းမင်းဆက် တနဂႅနွေမင်း၏ မိဖုရား စန္ဒာဒေဝီမှ အေဒီ ၁၇၂၇ ခုနှစ်တွင် တည်ထားကိုးကွယ်ခဲ့သည်။ စေတီတော်သည် ပန်းတင်ခုံမှစ၍ အထက်ကြာမှောက်ကြာလှန်အထိ ရှစ်ထောင့်ပုံစံဖြင့် တည်ထားပြီး ပန်းတင်ခုံ၏ ထောင့်ရှစ်ထောင့်၌ ခြသေႅ့ရုပ်ထု (၈)ခုပါရှိကာ စေတီတော်မှာ မူလလက်ရာအတိုင်း ကျန်ရှိသော စေတီတစ်ဆူဖြစ်သည်။ လောကဒုဿမာရ်အောင်စေတီအနီးတွင် မြင့်မိုရ်တောင်စေတီ၊ ကြောင်လိန်စေတီ၊ ဝကႅပါစေတီ စသည့် ညောင်ရမ်းခေတ် ဘုရားစေတီများကို တစ်စုတစ်ဝေးတည်း ဖူးမြှော်တွေ့မြင်နိုင်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/kyaung_lain_temple/1.jpg'),
                        ],
                    title: `ကြောင်လိန်စေတီ`,
                    status: 0,
                    content: `ကြောင်လိန်စေတီသည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့ဟောင်း၊ လောကဒုဿမာရ်အောင်စေတီ၏ အရှေ့ဖက်တွင်တည်ရှိပြီး ညောင်ရမ်းခေတ် ရှေး‌ဟောင်းစေတီတစ်ဆူ ဖြစ်သည်။ စေတီတော်အား ညောင်ရမ်းမင်းဆက် တနဂႅနွေမင်းမှ အေဒီ ၁၇၃၂ ခုနှစ်တွင် တည်ထားကိုးကွယ်ခဲ့ သည်ဟုသိရသည်။ စေတီတော်မှာ လေး‌ထောင့်ပုံအောက်ခံလှိုဏ်‌ပေါ်တွင် အထွတ်စေတီတည်ထားသည့် လက်ရာထူးခြားသော စေတီတစ်ဆူဖြစ်သည်။ အောက်ခံလှိုဏ်အတွင်း၌ အပေါ်သို့ လှည့်ပတ်၍ တက်နိုင်သော လှေကားပါရှိသည်။ အပြင်ဖက်မြောက်ဖက်မျက်နှာမှ အပေါ်သို့တက်နိုင်သည့် နတ်လမ်းလှေကား သုံးခုပါ ရှိသည်။ စေတီ၏အရှေ့ဖက်၊ တောင်ဖက်နှင့် အနောက်ဖက်တွင် ဘုံခုနှစ်ဆင့်ရှိသော အုတ်ပြဿဒ်ပါရှိသည်။ ပြဿဒ်၊ ဒုရင်များနှင့် ကြေးကွေးများမှာ မူလလက်ရာအတိုင်း ကျန်ရှိပါသည်။ ကြောင်လိန်စေတီအနီးတွင် မြင့်မိုရ်တောင်စေတီ၊ ဝကႅပါစေတီ၊ လောကဒုဿမာရ်အောင်စေတီ စသည့် ညောင်ရမ်းခေတ်စေတီများကို တစ်စုတစ်ဝေးတည်း ဖူးမြော်မြင်တွေ့နိုင်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/myint_moh_taung_temple/1.jpg'),
                            require('@/assets/images/destination/mandalay/myint_moh_taung_temple/2.jpg'),
                        ],
                    title: `မြင့်မိုရ်တောင်စေတီ`,
                    status: 0,
                    content: `မြင့်မိုရ်တောင်စေတီသည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့ဟောင်း၊ ဗားကရာကျောင်း၏ အနောက်ဖက်တွင်တည်ရှိပြီး ညောင်ရမ်းခေတ် ရှေး‌ဟောင်းစေတီတစ်ဆူ ဖြစ်သည်။ စေတီတော်သည် ညောင်ရမ်းမင်းဆက်၏ နောက်ဆုံးမင်းဆက်ဖြစ်သော မဟာဓမ္မရာဇာဓိပတိမင်း၏ ကောင်းမှုတော်ြဖစ်ပြီး ခမည်းတော် တနဂႅနွေမင်း နတ်ရွာစံ၍ သင်္ဂြိုင်သည့် သင်္ချိုင်းရာ၌ စေတီတည်ထားခဲ့ခြင်း ဖြစ်သည်။ မြင့်မိုရ်တောင်စေတီသည် အခြားစေတီများနှင့်မတူဘဲ ဗုဒ္ဓစာပေကျမ်းဂန်များ၌ ဖော်ပြပါရှိသော မြင့်မိုရ်တောင်ပုံစံအတိုင်း အဝန်းအဝိုင်းပုံစံဖြင့် တည်ထားခြင်းဖြစ်သည်။ အောက်ခြေ၌ အဝိုင်းပစ္စယံ ၇ ဆင့် ပါရှိပြီး ယင်းပစ္စယံ ၇ ဆင့်သည် တောင်စဉ် ၇ ထပ်ကို ရည်ရွယ်၍ ပြုလုပ်ထားသည်ဟု ယူဆရပါသည်။ စေတီတော်တွင် နတ်လမ်းလှေကားသုံးခုပါရှိပြီး လှေကားသုံးခုတွင် အလယ်လှေကားသည် စေတီ၏ အောက်ဆုံးပစ္စယံမှ အပေါ်ဆုံးစူဠာမဏိစေတီအထိ တက်ရောက်တိုင်ပြီး ကျန်လှေကားနှစ်ခုမှာ စေတီ၏ အတွင်းလှိုဏ်ထဲသို့ ဝင်ရောက်ပြီးမှ အပေါ်သို့တက်ရပါသည်။ မြင့်မိုရ်တောင်စေတီအနီးတွင် ဝကႅပါစေတီ၊ ကြောင်လိန်စေတီ၊ လောကဒုဿမာရ်အောင်စေတီ စသည့် ညောင်ရမ်းခေတ်စေတီများကို တစ်စုတစ်ဝေး တည်း ဖူးမြော်မြင်တွေ့နိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mandalay/bagaya_monastery/1.jpg'),
                            require('@/assets/images/destination/mandalay/bagaya_monastery/2.jpg'),
                            require('@/assets/images/destination/mandalay/bagaya_monastery/3.jpg'),
                            require('@/assets/images/destination/mandalay/bagaya_monastery/4.jpg'),
                            require('@/assets/images/destination/mandalay/bagaya_monastery/5.jpg'),
                            require('@/assets/images/destination/mandalay/bagaya_monastery/6.jpg'),
                        ],
                    title: `အင်းဝ ဗားကရာကျောင်းတော်ကြီး`,
                    status: 0,
                    content: `ဗားကရာကျောင်းတော်ကြီးသည် မန္တလေးတိုင်းဒေသကြီး၊ တံတားဦးမြို့နယ်၊ အင်းဝမြို့ဟောင်း စည်တိုပုံမြို့ရိုး၏ အပြင်ဖက် တတိယမြို့ရိုးအတွင်း တည်ရှိသည်။ ဗားကရာကျောင်းတော်ကြီးကို ၁၁၉၆ ခုနှစ် (၁၈၃၄) ဘကြီးတော် စစ်ကိုင်းမင်းလက်ထက်  တည်ဆောက်ခဲ့သည်ဟု မူလကရေးထိုးထားပြီး  ကျောင်းဆောက်လှူဒါန်းသူ အမည်မသိသော ကျောင်းအဖြစ်တည်ရှိသည်။ နောက်ပိုင်း သုတေသီများ၏ ရှာဖွေ ဖော်ထုတ်မှုအရ ပထမဗားကရာကျောင်း ဆရာတော်ကြီး ကိုယ်တိုင်ရေးသားပြုစုခဲ့သော ဓမ္မနီတိနိဿယကျမ်း ပေမူကို တွေ့ရှိရသည့်အတွက်  ဗားကရာကျောင်းကို ဘိုးတော်ဗဒုံမင်းလက်ထက် အမတ်ကြီး နေမျိုးကျော်ထင်က ၁၁၄၄ ခုနှစ် (၁၇၈၂)တွင်  တည်ဆောက်လှူဒါန်းခဲ့ကြောင်း တိတိကျကျသိရှိခဲ့ရသည်။ <br><br>
                    ဗားကရာကျောင်းတော်ကြီးကို သစ်သားကျွန်းတိုင်များဖြင့် တည်ဆောက်ထားပြီး ကျွန်းတိုင်ပေါင်း ၂၆၇ တိုင်ပါရှိသည်။ အကြီးဆုံးကျွန်းတိုင်၏ လုံးပတ်သည် ၉ ပေရှိသည်။  ဗားကရာကျောင်း အကျယ်အဝန်းမှာ အလျား ၁၈၈ ပေ၊ အနံ ၁၀၃ ပေရှိသည်။  ဗားကရာသစ်သားကျောင်းကြီးတွင် ခေတ်အဆက်ဆက်က အလွန်ရှားပါးသော ရှေးဟောင်းဗိသုကာလက်ရာများကို တွေ့မြင်နိုင်သည်။ ကျောင်းတော်ကြီး၏ ဘေးပတ်လည်တွင် အုတ်လှေကား ငါးစင်းတပ်ဆင်ထားသည်။ ပြာသာဒ်ဆောင်၌ ကိန္နရာရုပ်တုများ၊ ပွတ်လုံးများ၊ နတ်ရုပ်များဖြင့်  တန်ဆာဆင်ထားသည်။ အတွင်းဆောင်လက်ရန်းများ၌ ဒေါင်းရုပ်များ၊ ပွတ်လုံးများ၊ လက်ရန်းထိပ်ပိုင်းတွင် ခြင်္သေ့ကိုယ်၊ ဘီလူးခေါင်းပုံရုပ်တုများဖြင့် တန်ဆာဆင်ထားသည်။ ပညာရှင်များ၏ လေ့လာမှုအရ  ဗားကရာကျောင်းတော်ကြီးတွင် အလှဆင်ထားသော  ခြင်္သေ့ဘီလူးရုပ်သည် အင်းဝခေတ်(ညောင်ရမ်းခေတ်) လက်ရာ၊ နဂါးဖမ်းဂဠုန်ရုပ်သည် အမရပူရခေတ် (ကုန်းဘောင်ခေတ်) လက်ရာ၊ လူပျံရုပ်များသည်  ရတနာပုံ ခေတ်လက်ရာများ ဖြစ်သည်ဟုဆိုထားသည်။  ဗားကရာ ကျောင်း တော်ကြီးကို ခေတ်အဆက်ဆက် ပြုပြင်ထိန်းသိမ်းမှုများ  ပြုလုပ်ထားသည့်အတွက်  အဖိုးမဖြတ်နိုင်သော   ဗိသုကာ လက်ရာမျိုးစုံကို တွေ့မြင်နိုင်သည်။ မြန်မာနိုင်ငံတစ်ဝန်းလုံးရှိ သစ်သားကျောင်းတော်များတွင် အင်းဝမြို့ဟောင်းရှိ  ဗားကရာကျောင်းတော်ကြီး၏  ဗိသုကာလက်ရာများသည် ခေတ်အစောဆုံး  လက်ရာများ အဖြစ် မြင်တွေ့ရမည်ဖြစ်သည်။ 
                    `,
                },
            ];

            const nextPage = () => {
                pageNumber.value++;
            }

            const prevPage = () => {
                pageNumber.value--;
            }

            const pageCount = computed(() => {
                let l = places.length
                let s = size;
                return Math.ceil(l/s);
            })

            const paginatedData = computed(() => {
                let start = pageNumber.value * size;
                let end = start + size;

                return places.slice(start, end);
            })

            onMounted(() => {
                swiper.value = new Swiper('.place-swiper', {
                    speed: 600,
                    loop: true,
                    autoplay: {
                        delay: 5000,
                        disableOnInteraction: false
                    },
                    slidesPerView: 'auto',
                    pagination: {
                        el: '.swiper-pagination',
                        clickable: true,
                        type: 'bullets',
                    },
                    breakpoints: {
                        320: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        },

                        1200: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        }
                    }
                });
                
            });

            return { swiper, paginatedData, nextPage, prevPage, pageCount, pageNumber };
        },
    };
</script>