<template>
    <div class="destination">
        <div class="hero-section">
            <div class="banner">
                <img src="@/assets/images/destination/magway/banner.jpg" class="banner" alt="">
            </div>
            <div class="content">
                <div class="hero-header">
                    <img src="@/assets/images/destination/travel.gif" class="icon" alt="">
                
                    <h3>Places to Visit in</h3>
                    <h2>Magway</h2>
                    <div class="scroll-down">
                        <div class="container">
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <span class="text">Scroll down</span>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="places">
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
            <div class="row">
                <div class="place-card-wrapper" v-for="(card, i) in paginatedData" :key="i">
                    <div class="place-card" :class="{odd: i%2 !== 0}">
                        <div class="place-img ">
                            <div :class="`swiper place-swiper`" data-aos-delay="100">
                                <div class="swiper-wrapper">
                                    <div class="swiper-slide" v-for="(img, i) in card.images" :key="i">
                                        <img :src="img" class="float-start" alt="">
                                    </div>
                                </div>
                                <div class="swiper-pagination" id="swiper-paginate"></div>
                            </div>
                        </div>
                        <div class="place-content">
                            <h2>{{card.title}}  </h2>
                            <p v-html="card.content">
                            </p>
                        </div>
                    </div>
                </div>
            </div>
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
        </div>
    </div>
</template>

<script>
    import { ref, onMounted, computed, watch } from 'vue';
    export default {
        setup() {
            const pageNumber = ref(0);
            const size = 5;
            const swiper = ref(null);

            const places = [
                {
                    images : [
                            require('@/assets/images/destination/magway/mya_thalun/1.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/2.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/3.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/4.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/5.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/3.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/4.jpg'),
                            require('@/assets/images/destination/magway/mya_thalun/5.jpg'),
                        ],
                    title: `မြသလွန်ဘုရား`,
                    status: 0,
                    content: `မြသလွန်ဘုရားသည် မြန်မာနိုင်ငံအလယ်ပိုင်း မကွေးမြို့၏ အနောက်မြောက်ဖက်အစွန် ဧရာဝတီမြစ် ကမ်းဘေး နဂုတ္တမတောင်ကုန်းပေါ်တွင်တည်ရှိသည်။ မကွေးမြသလွန် မလွန်မြသပိတ်ဟု ဆိုရိုးရှိသည့်အတိုင်း မြန်မာနိုင်ငံတန်ခိုးကြီးဘုရားများတွင် မြသလွန်ဘုရားလည်း အပါအဝင်ဖြစ်သည်။ လုံးတော်ပြည့် ရွှေချထားသည့် ဘုရားတစ်ဆူဖြစ်ပြီး စုစုပေါင်းအချပ်ရေမှာ "ဒွေးအစ်အဌဇေယျသတိချပ်ရေရှိ လုံးပြည့် ရွှေရောင်ဖြိုး" ဟုဆိုစကားရှိသည်။ မြသလွန်ဘုရားတွင် ကဿပဘုရားရဲ့ ရွှေသလွန်တော်နဲ့ ဂေါတမ မြတ်စွာဘုရားရဲ့ မြသလွန်တော်တို့ကို ဌာပနာတည်ထားတယ်ဟု ဆိုပါသည်။ ဘုရားဖူးဧည့်သည်များသည် မြသလွန်ဘုရား၏ အံ့သြချီးမွမ်းဖွယ်ကောင်း၍ သပ္ပာယ်လှသော ဗိသုကာလက်ရာအား ရိုသေပူဇော်လေ့ ရှိကြသည်။ <br>
                    &nbsp;&nbsp; မကွေးမြို့ မြသလွန်ဘုရားပွဲတော်ကို နှစ်စဉ်နှစ်တိုင်း သီတင်းကျွတ်လဆန်း (၈)ရက်နေ့မှ သီတင်းကျွတ်လပြည့်ကျော် (၈)ရက်နေ့ထိ စည်ကားသိုက်မြိုက်စွာ ကျင်းပလျက်ရှိသည်။ ရှေးအခါက မကွေးမြသလွန်ဘုရားပွဲသည် အထက်အောက် ကုန်စည်ဖလှယ်ရာဈေးကြီးအဖြစ် အရောင်းအဝယ် စည်ကားခဲ့ သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                            require('@/assets/images/destination/magway/shwe_set_taw/1.jpg'),
                        ],
                    title: `ရွှေစက်တော်ဘုရား`,
                    status: 0,
                    content: `ရွှေစက်တော်ဘုရားသည် မင်းဘူးမြို့မှ အနောက်တောင်ဘက် (၂၆)မိုင်ကွာဝေးသော အနောက်ရိုးမ အရှေ့ဘက်ဆုံး တောင်စွယ်ပေါ်တွင် တည်ရှိသည်။ စက်တော်ရာစေတီကို ရွှေစက်တော် ဟူ၍လည်​ကောင်း၊ မန်းစက်တော်ရာ ဟူ၍လည်းကောင်း၊ မန်းရွှေစက်တော် ဟူ၍လည်းကောင်း ခေါ်ကြသည်။ ရွှေစက်တော် ဘုရားသည် မြတ်စွာဘုရား၏ ခြေတော်ရာများ တည်ရှိခြင်းကြောင့်လည်း ကျော်ကြားလှသည်။ ရဟန်းတော် နှစ်ပါးဖြစ်သည့် ရဟန္တာဆည်းဆာဗန်ဒနှင့် နာဂနာမန်ဒတို့အတွက် ခြေတော်ရာခွင့်ပြုပေးခဲ့ခြင်းဖြစ်ပြီး ခြေတော်ရာတစ်ဖက်ချင်းစီသည် တောင်ပေါ်နှင့် မြစ်ကမ်းပေါ်တွင် အသီးသီးထားရှိတော်မူစေခဲ့သည်။ စက်တော်ရာသည် အောက်စက်တော်ရာနှင့် အထက်စက်တော်ရာဟူ၍ နှစ်ဌာနရှိသည်။ တောင်ပေါ်တွင် ရှိသော ဗုဒ္ဓမြတ်စွာဘုရားရှင်၏ ခြေတော်ရာတစ်ဆူကို အထက်စက်တော်ရာဟုခေါ်ကြ၍ တောင်အောက် မန်းချောင်းဘေး၌ရှိသော ခြေတော်ရာတစ်ဆူကို အောက်စက်တော်ရာဟု ခေါ်ကြသည်။ ရွှေစက်တော် ဘုရားမှာ သစ်တောဝန်းရံလျက်ရှိပြီး ယဉ်ကျေးမှုအမွေအနှစ်နှင့် သဘာဝယှဉ်တွဲ တည်ရှိနေသော နေရာတစ်ခု ဖြစ်သည်။ <br>
                    &nbsp; &nbsp; ရွှေစက်တော်ဘုရားပွဲသည် အထက်မြန်မာပြည်လူမျိုးတို့၏ အထင်ကရ ပွဲတော်တစ်ခု ဖြစ်သည်။ ဘုရားပွဲတော်သည် ဖေဖော်ဝါရီလအလယ်မှ ဧပြီလအလယ်အထိဖြစ်ပြီး နိုင်ငံတကာခရီးသွားဧည့်သည်များနှင့် ဒေသခံဘုရားဖူးများဖြင့် စည်ကားဆုံးအချိန်ဖြစ်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/sandal_wook/1.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/2.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/3.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/2.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/3.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/3.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/2.jpg'),
                            require('@/assets/images/destination/magway/sandal_wook/3.jpg'),
                        ],
                    title: `စန္ဒကူးကျောင်းတော်ရာစေတီ`,
                    status: 0,
                    content: `စန္ဒကူးကျောင်းတော်ရာစေတီသည် မ‌ကွေးတိုင်းဒေသကြီး၊ ပွင့်ဖြူမြို့၊ ကျောင်းတော်ရာ မြို့သစ်တွင် တည်ရှိသည်။ မြတ်စွာဘုရားသည် ရဟန္တာပေါင်း (၅၀၀)နှင့်အတူ တရားဟောကြားရန် ဘုန်းကြီးကျောင်းသို့ ကြွချီလာခဲ့သည်။ မြတ်စွာဘုရားသက်တော်ထင်ရှားရှိနေစဉ် သက္ကရာဇ် (၁၆၀၄)ခုနှစ်တွင် အလောင်းစည်သူ မင်းတရားသည် တိုင်းခန်းလှည့်လည်ချိန် ၎င်းဘုန်းကြီးကျောင်းနေရာ၌ ယခုလက်ရှိ ကျောင်းတော်ရာ ဘုရားအား တည်ထားကိုးကွယ်ခဲ့သည်။ စန္ဒကူးကျောင်းတော်ရာဘုရားသည် အနီးအဝေး၊ အပေါ်အောက် ရှုထောင့်မျိုးစုံမှ ကြည့်ရှု၍ ခမ်းနားကြီးကျယ်လှသည်။ ကျောင်းတော်ရာစေတီ၏ ဉာဏ်တော်အမြင့်မှာ (၉၂)တောင်ထွာရှိပြီး ထီးတော်သုံးဆင့်ရှိရာ အထက်ဆုံးထီးတော်အဆင့်မှာ ငွေသားအစစ်ဖြစ်သည်။ ‌	စန္ဒကူးကျောင်းတော်ရာသည် ဘုရားရှင်သီတင်းသုံးရာ နေရာထူးဖြစ်ခြင်း၊ ဝါဆိုလပြည့်နေ့မှ သီတင်းကျွတ်လပြည့်နေ့အထိ ငါးကြီးများ လာရောက်ခိုလှုံလေ့ရှိခြင်း၊ လုံးပတ်ကြီးမားသော စန္ဒကူးနံ့သာတိုင် ကြီးများဖြင့် တည်ဆောက်ထားသည့် ကျောင်းတော်ရာအဖြစ် ကျော်ကြားခြင်းတို့ကြောင့် ပွင့်လင်း ရာသီချိန်များတွင် ဘုရားဖူးဧည့်သည်အများအပြား လာရောက်လေ့ရှိကြောင်းသိရသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                            require('@/assets/images/destination/magway/satkain_tae/1.jpg'),
                        ],
                    title: `ရှင်ပင်စက္ကိန်းတဲ စေတီတော် (ခ) စက္ကတဲစေတီတော်  `,
                    status: 0,
                    content: `စက္ကတဲစေတီတော်သည် မင်းဘူးမြို့၊ စက္ကတဲတောင်ထိပ်တွင် တည်ရှိသည့် စေတီတော်တစ်ဆူ ဖြစ်သည်။ မဟာသက္ကရာဇ် ၁၂၃ ခုနှစ်တွင် စူဠပုဏ်၊ မဟာပုဏ် ညီနောင်တို့က ပင့်လျှောက်သဖြင့် မြတ်စွာဘုရားသည် သုနာပရန္တတိုင်း၊ ဝါဏိဇ္ဇဂါမရွာသို့ ကြွခဲ့သည်။ ထို့နောက် မြတ်စွာဘုရားသည် စန္ဒကူးကျောင်းတော်တွင် သီတင်းသုံးတော်မူပြီးနောက် ပြန်ကြွချိန်ရောက်လာသည်။ ထို့နောက် မြတ်စွာ ဘုရားသည် မင်းဘူးမြို့တောင်ဘက် စက္ကိန်းတဲတောင်ထိပ်သို့ ရောက်လေသည်။ ထိုတောင်ထိပ်တွင် သိကြားမင်းသည် ဘုရားရှင်အား ရတနာမြသလွန်ကို လှူဒါန်းခဲ့ပြီး ထိုနေရာတွင် မြတ်စွာဘုရားသည် ယာယီသီတင်းသုံးတော်မူသည်။ ထိုသီတင်းသုံးရာနေရာတွင် စေတီတည်ထားကိုးကွယ်ခဲ့ပြီး ရှင်ပင်စက္ကိန်းတဲ စေတီတော်ဟု ခေါ်ဆိုခဲ့ကြသည်။ နောင်အခါ စက္ကတဲစေတီတော်ဟု ခေါ်တွင်လာခဲ့ကြသည်။ စေတီတော်သည် ဉာဏ်တော်အမြင့် (၄၈)ပေ၊ လုံးပတ် (၄၉)ပေရှိသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                            require('@/assets/images/destination/magway/malun_mya_tapaik/1.jpg'),
                        ],
                    title: `မလွန်မြသပိတ်စေတီတော် `,
                    status: 0,
                    content: `မလွန်မြသပိတ်စေတီသည် မကွေးတိုင်းဒေသကြီး၊ အထက်မင်းလှမြို့နယ်၊ မလွန်မြို့တွင် တည်ရှိသည်။  <br>

                        သက္ကရာဇ် ၁ဝ၁ ခုနှစ်တွင် ဒွတ္တပေါင်မင်းကြီးသည် ဗိုလ်ခြေများစွာနှင့် မြသပိတ်တော်ကို ဝဇီရာပြည် မှပင့်ဆောင်၍ သရေခေတ္တရာမြို့ပြင်၌ မြစည်းခုံဘွဲ့အမည်ဖြင့် မြသပိတ်တော်ကို ဌာပနာပြီး စေတီတည်ခဲ့သည်။ သရေခေတ္တရာ ပြည်ပျက်သော် မြသပိတ်တော်သည် ပေါက္ကံပြည်သို့လည်းကောင်း၊ ပုဂံပြည်ပျက်သော် မြသပိတ်တော်သည် အင်းဝသို့လည်းကောင်း ရောက်ရှိခဲ့သည်။ သက္ကရာဇ် ၇၅၆ ခုနှစ်တွင် ဟံသာဝတီဘုရင် မင်းရာဇာသည် အင်းဝကို တိုက်ခိုက်သိမ်းယူပြီး အင်းဝမှ ဘုရားရုပ်ပွားတစ်ဆူနှင့် မြသပိတ်တော်ကို ဧရာဝတီမြစ်ကြောင်းအတိုင်း ဖောင်နှင့်ပင့်ဆောင်ခဲ့ရာ မလွန်မြို့သို့ ရောက်သောအခါ ဖောင်သည် မလွန်ဝဲ(ယခုရွှေလဝန်းဝဲ)၌ ရပ်တန့်နေခဲ့သည်။ ဖောင်တော်ကို လှေတော်သားတို့ဖြင့် စုံဆွဲ လှော်ခတ်သော်လည်း အချည်းနှီးသာဖြစ်ခဲ့သည်။ ထိုအခါ ရဟန်းရှင်လူ ပညာရှင်အပေါင်းတို့က စိစစ်တွက်ချက်ကြပြီး မြတ်စွာဘုရား၏ ဗျာဒိတ်အရ ဤနေရာ၌ မြသပိတ်တော်အပူဇော်ခံဖို့ ထင်ရိပ်ရှိသည်ဟု ဘုရင်အားလျှောက်တင်ကြရာ ဟံသာဝတီဘုရင်သည် လက်လျှော့၍ မလွန်မြို့ အောင်သီရိကုန်းတော်ပေါ်၌ တည်ထားသော ရတနာစက်ဘုရားအတွင်း ဌာပနာ၍ လှူဒါန်းခဲ့သည်။ မြသပိတ်တော်သည် မလွန်မြို့ကို ကျော်လွန်နိုင်ခြင်းမရှိ၍ မလွန်ဟုလည်းကောင်း၊ နောင်အခါ ရတနာစက်ဘုရားသည် မြသပိတ် ဘုရားဟု လည်းကောင်း ထင်ရှားခဲ့သည်။ <br>
                        &nbsp; &nbsp; သက္ကရာဇ် ၁၂၂ဝ ခုနှစ် ဝါခေါင်လတွင် မြေငလျင်လှုပ်၍ မြသပိတ်စေတီတော် ပြိုပျက်ခဲ့ရာ သက္ကရာဇ် ၁၂၃၅ ခုနှစ်တွင် ဂိုဏ်းအုပ် နဂါးရုံကျောင်းဆရာတော်နှင့် စင်္ကြာဆရာတော်တို့ ကြပ်မတ်၍ မူလစေတီကို ဓာတ်တော်ဆူရေ တစ်ထောင်ကျော်ဖြင့် ဌာပနာပြီးစေတီကို ထပ်မံတည်ထားခဲ့သည်။ <br>
                        &nbsp; &nbsp;မြသပိတ်စေတီတော်ကြီးအား နာယက ဆရာတော်များနှင့် ဂေါပကအဖွဲ့မှ စနစ်တကျ ပြုပြင်ထိန်း သိမ်းစောင့်ရှောက်ခဲ့ပြီး နှစ်စဉ် တန်ဆောင်မုန်းလဆုတ် ၁၃ ရက်နေ့မှ နတ်တော်လဆန်း ၇ ရက်နေ့ထိ ဗုဒ္ဓပူဇနိယပွဲတော် ကျင်းပလေ့ရှိသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/thiho_shin/1.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/2.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/1.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/2.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/2.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/1.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/2.jpg'),
                            require('@/assets/images/destination/magway/thiho_shin/2.jpg'),
                        ],
                    title: `သီဟိုဠ်ရှင်ဘုရား`,
                    status: 0,
                    content: `သီဟိုဠ်ရှင်ဘုရားသည် မကွေးတိုင်းဒေသကြီး၊ ပခုက္ကူမြို့၊ အမှတ်(၁၄)ရပ်ကွက်တွင် တည်ရှိသည်။ သက္ကရာဇ် ၄၇၇ ခုနှစ်တွင် သီဟိုဠ်ရှင်ဆင်းတုတော်မြတ်ကို သီဟိုဠ်ဘုရင်သည် အလောင်းစည်သူမင်းကြီးအား မလ္လာယုကျွန်းအနီး၌ ဆက်သခဲ့လေသည်။ ယင်းဆုတော်၌ မဟာဗောဓိ၊ စန္ဒကူး၊ သရက္ခန်၊ သပြေ၊ ထင်းရှူး၊ ကသစ်၊ ကုက္ကို၊ သခွတ်၊ ထိန်၊ နံ့သာမျိုးဟူ၍ သစ်ပေါင်း(၁၀)မျိုး ပါဝင်ပြီး မွေတော် ဓါတ်တော်များ ဌာပနာလျက် ကိုးကွယ်ထားသည်။ သီဟိုဠ်ရှင်ဆင်းတုတော်၏ ဉာဏ်တော်မှာ သံတောင် (၃)တောင် (၂)မိုက် ဖြစ်သည်။ သီဟိုဠ်ရှင်မြတ်စွာဘုရား လှိုဏ်ဂူဂန္ဓကုဋီစေတီတော်ကြီးကို အလောင်းစည်သူ မင်းကြီးသည် သက္ကရာဇ် ၄၇၉ ခုနှစ်တွင် တည်ထားကိုးကွယ်သည်။ <br>
                    &nbsp;&nbsp; သက္ကရာဇ် ၁၁၇၈ ခုနှစ်တွင် ဂန္ဓကုဋီစေတီတော်ကို မြင်သာရွာအုပ်ကြီးက မွမ်းမံပြုပြင်၍ ထီးတော်အသစ် တင်လှူခဲ့ပြီး သီဟိုဠ်ရှင်ဆင်းတုတော်နှင့် ပမာဏတူ ရုပ်ပွားတော်နှစ်ဆူထုလုပ်ကာ သီဟိုဠ်ရှင်ဆင်းတုတော်အား လက်ဝဲလက်ယာ ရံထားပူဇော်ခဲ့သည်။ ၁၂၈၄ ခုနှစ်တွင် ကျောင်းကုန်းမြို့နယ်၊ မိုးပြာရွာ ဒေါ်လေးကြီးမိသားစုက ဂန္ဓကုဋီစေတီတော်ကို ထပ်မံပြုပြင်မွမ်းမံခဲ့သည်။ ဂန္ဓကုဋီစေတီတော်သည် ဖိနပ်တော် အလျားအနံ (၅၅)တောင်ရှိပြီး ဉာဏ်တော်မှာ ထီးတော်အထိ (၇၄)တောင်မြင့်သည်။ ၁၃၃၇ ခုနှစ်တွင် ငလျင်ဘေးဒဏ်ကြောင့် စိန်ဖူးတော် မြေခပျက်စီးသဖြင့် ၁၃၄၁ ခုနှစ်တွင် ငှက်မြက်နားနှင့် စိန်ဖူးတော်တို့ကို အသစ်တဖန် တင်လှူခဲ့သည်။ ရှေးအခါက သီဟိုဠ်ရှင်ဆင်းတုတော်မြတ်ကို ပူဇော်ထား ရှိရာတွင် အနုပညာလက်ရာမြောက်သော တံကဲတော်ပလ္လင်တစ်ခုရှိခဲ့ပြီး ၁၉၅၅ ခုနှစ်ဝန်းကျင်တွင် မီးသင့်ခဲ့သဖြင့် ကျွန်းသားတန်ဆောင်းအပါအဝင် တံတော်ကဲပလ္လင်ပါ ဆုံးရှုံးခဲ့ရသည်။ မူလတံတော်ကဲ၏ ပုံတော်ကို အာရုံခံတန်ဆောင်းအတွင်း၌ ပြသထားရှိသည်။ <br>
                    &nbsp;&nbsp;သီဟိုဠ်ရှင်ဘုရားပွဲတော်ကို မေလကုန် သို့မဟုတ် ဇွန်လအစတွင် ကျင်းပလေ့ရှိပြီး ပွဲတော်သည် နယုန်လဆန်း (၈)ရက်နေ့မှ လဆုတ် (၂)ရက်နေ့အထိ ကြာမြင့်သည်။ သီဟိုဠ်ရှင်ဘုရားပွဲတော်သည် ဧရာဝတီမြစ်အနောက်ဘက် မြို့များအတွက် အလွန်အရေးပါသည့် ပွဲတော်ဖြစ်ပြီး ဒေသထွက်ကုန်များကို ရောင်းချကြပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/tarakhan/1.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/2.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/1.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/2.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/2.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/1.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/2.jpg'),
                            require('@/assets/images/destination/magway/tarakhan/2.jpg'),
                        ],
                    title: `ရွှေတန့်တစ် သရက္ခန်ဘုရား`,
                    status: 0,
                    content: `ရွှေတန့်တစ် သရက္ခန်ဘုရားသည် မကွေးတိုင်းဒေသကြီး၊ ပခုက္ကူမြို့နယ်၊ ရွှေတန့်တစ်ကျေးရွာတွင် တည်ရှိသည်။ ဘုရားရောက်လျှင် မုဒ်ဝတွင် အရမ်းကြီးတဲ့ ခြင်္သေရုပ်ကြီးနှစ်ရုပ်ကို တွေ့ရသလို မင်းသုံးပါး တည်ထားကိုးကွယ်ခဲ့သည့် ရွှေတန့်တစ်စေတီကို ကြည်ညိုဖွယ်ဖူးတွေ့ရသည်။ ဘုရားဝန်းထဲတွင် သာသနိက အဆောက်အဦတွေနဲ့ တန်ဆောင်းတွေမှန်သမျှဟာ အရောင်အဆင်းတောက်ပပြီး ဆွဲဆောင်မူရှိလှပါသည်။ ရွှေတန့်တစ် သရက္ခန်ရုပ်ပွားတော်မြတ်ကို သီးခြားဂန္ဓကုဋီတိုက်တွင် သီတင်းသုံးစံပယ်တော်မူပါသည်။ ဘုရား သမိုင်းကြောင်းအရ သိကြားမင်းကိုယ်တိုင် အလောင်းစည်သူမင်းကြီးကို ဆပ်ကပ်လှူဒါန်းခဲ့တဲ့ ရုပ်ပွားတော်မြတ်ဖြစ်ကြောင်း သိရသည်။ ဆုတောင်းပြည့် ရုပ်ပွားတော်မြတ်ဖြစ်တာမို့ ခေါင်းပေါ်တင်ပြီး ဆုတောင်းလျှင် ဆုတောင်းပြည့်တယ်လို့ ဆိုပါသည်။ သရက္ခန်ဘုရားဖူးမြှော်ရင်း ဂန္ဓကုဋီတိုက်ထဲက တံကဲတော်နဲ့ ရှေးဟောင်းသစ်မွှေးသေတ္တာတို့ကိုလည်း လေ့လာလို့ရပါသည်။ 
                    
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/1.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/2.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/3.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/4.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/5.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/3.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/4.jpg'),
                            require('@/assets/images/destination/magway/salay_yoke_sone_kyaung/5.jpg'),
                        ],
                    title: `စလေပန်းပုရုပ်စုံကျောင်း `,
                    status: 0,
                    content: `စလေပန်းပုရုပ်စုံကျောင်းသည် မကွေးတိုင်းဒေသကြီး၊ စလေမြို့တွင် တည်ရှိသော ရှေးဟောင်း သမိုင်းဝင် ဘုန်းတော်ကြီးကျောင်းတစ်ခုဖြစ်သည်။ ကုန်းဘောင်ခေတ် စာဆိုတော် ဦးပုည၏ မွေးရပ်မြေဇာတိ ဟုလူသိများပြီး သမိုင်းမှတ်တမ်း အထောက်အထားများအရ ဒုတိယပုဂံဟု တင်စားခေါ်ဝေါ်ကြသည့် စလေမြို့သို့ ပြည်တွင်းပြည်ပမှ ခရီးသွားဧည့်သည်အများအပြား လာရောက်လျက်ရှိပြီး စလေမြို့၏ အထင်ကရ နေရာတစ်ခုဖြစ်သော ပန်းပုရုပ်စုံကျောင်းသို့ သွားရောက်လေ့လာ ကြည့်ရှုကြပါသည်။  <br><br>
                    &nbsp;&nbsp; 
                    စလေပန်းပုရုပ်စုံကျောင်းတော်ကြီးကို စလေမြို့နေ ဦးဘိုးကြည်နှင့် ဇနီး ဒေါ်ရွှေသက်တို့က ခရစ်နှစ် ၁၈၈၂-ခု၊ မြန်မာနှစ် ၁၂၄၄-ခုတွင် စတင်တည်ဆောက်ခဲ့ကာ ခရစ်နှစ် ၁၈၉၂-ခု၊ မြန်မာနှစ် ၁၂၅၄-ခုတွင် ပြီးစီးလှူဒါန်းခဲ့ပြီး ကျောင်းတော်ကြီးမှာ အလျား(၁၅၀)ပေ၊ အနံ(၈၉)ပေရှိကာ သစ်သားတိုင်လုံးပေါင်း(၁၅၄) လုံးရှိသည်။  <br><br>
                    &nbsp;&nbsp;ကျောင်းတော်ကြီး၏ ပန်းပုရုပ်စုံပေါင်း(၄၅)ရုပ်နှင့် အဆောင်ပေါင်း(၆)ဆောင်ကျန်ရှိနေပြီး ၁၉၉၅ ခုနှစ်တွင် စလေဒေသအနီးတစ်ဝိုက်မှ တွေ့ရှိရသော ရှေးဟောင်းပစ္စည်းများ ခင်းကျင်းပြသရန်အတွက် ရှေးဟောင်းသုတေသနပြတိုက်အဖြစ် စတင်ဖွင့်လှစ်ပြသခဲ့သည်။ ယခုလက်ရှိအချိန်တွင်လည်း စလေပန်းပု ရုပ်စုံကျောင်းတော်ကြီးကို ရှေးဟောင်းသုတေသနနှင့် အမျိုးသားပြတိုက်ဦးစီးဌာနမှ ထိန်းသိမ်းကာကွယ် စောင့်ရှောက်လျက်ရှိသည်။ <br><br>
                    &nbsp;&nbsp;
                    ရုပ်စုံကျောင်းသည် မီတာ(၃၀) အရှည်ရှိပြီး (၁၂၄၀)မီတာ အကျယ်အဝန်းရှိကာ ၎င်း၏ရှုပ်ထွေး၍ သေသပ်လှပသော လက်မှုနှင့် ပန်းပုလက်ရာများအား ကြည့်ရှုလေ့လာရန် ခရီးသွားဧည့်သည်များကို ဆွဲဆောင် နိုင်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/beikthano/1.jpg'),
                            require('@/assets/images/destination/magway/beikthano/2.jpg'),
                            require('@/assets/images/destination/magway/beikthano/3.jpg'),
                            require('@/assets/images/destination/magway/beikthano/4.jpg'),
                            require('@/assets/images/destination/magway/beikthano/5.jpg'),
                            require('@/assets/images/destination/magway/beikthano/6.jpg'),
                            require('@/assets/images/destination/magway/beikthano/7.jpg'),
                            require('@/assets/images/destination/magway/beikthano/8.jpg'),
                        ],
                        title: `ဗိဿနိုးမြို့ဟောင်း `,
                    status: 0,
                    content: `ဗိဿနိုးမြို့ဟောင်းသည် မကွေးတိုင်းဒေသကြီး၊ တောင်တွင်းကြီးမြို့ အနောက်ဖက် (၁၂)မိုင်ခန့်အကွာ ကုက္ကိုခွရွာမြောက်ဖက်တွင် တည်ရှိပါသည်။ ၂၀၁၄ ခုနှစ်တွင် ကမ္ဘာ့အမွေအနှစ်စာရင်းဝင်ခဲ့ပြီး ပျူမြို့ဟောင်း (၃)ခုအနက် တစ်ခုအပါအဝင်ဖြစ်သည်။ ဗိဿနိုးမြို့ဟောင်းသည် ပုံသဏ္ဍာန်အားဖြင့် လေးထောင့်မကျတကျ ဖြစ်ပြီး ဧရိယာ(၃.၃)စတုရန်းမိုင်ကျယ်ဝန်းပါသည်။ မြို့ရိုး(၃)ဖက်သာတွေ့ရှိရ၍ အနောက်ဖက် မြို့ရိုးကိုမူ မတွေ့ရှိရပေ။ ယခုအခါ ဗိဿနိုးမြို့ဟောင်းနေရာ၊ နန်းတော်ရာနေရာ၊ အုတ်ဖြင့်တည်ဆောက်ထားသော ဘုန်းကြီးကျောင်း(၂)ကျောင်း၊ ဗုဒ္ဓရုပ်ပွားတော်များနှင့် ဘာသာရေးအဆောက်အဦများကို လေ့လာကြည့်ရှု နိုင်ပါသည်။ အဆောက်အဦအားလုံးသည် ရှေးဟောင်းပျူလက်ရာမပျက် ကျန်ရှိနေပါသေးသည်။ ဗိဿနိုး မြို့ဟောင်းသည် လွန်ခဲ့သောနှစ်ပေါင်း(၂၀၀၀)ကျော်က တည်ရှိခဲ့သော ပျူမြို့တော်ကြီးဖြစ်ပြီး ယဥ်ကျေးမှု ပြတိုက်နှင့် ရှေးဟောင်းနန်းတော်ရာများကို လေ့လာနိုင်ပါသည်။ လမ်းညွှန်ဆိုင်းဘုတ်များ၊ မြေပုံများနှင့်တကွ ဖော်ပြထားခြင်းကြောင့် လေ့လာကြည့်ရှုသူများအတွက် အဆင်ပြေပါသည်။  <br><br>
                    &nbsp;&nbsp; 
                    ထူးခြားချက်အနေဖြင့် ဗိဿနိုးမြို့ဟောင်းထဲက ပေပင်များသည် အသီးမသီး၊ မကြီးထွားပဲ နှစ်ထောင် ချီသက်တမ်းရှိနေဆဲပင်ဖြစ်သည်။ အပင်တွေရဲ့အမြင့်သည် လူတစ်ရပ်လောက်ရှိကာ ပန်ထွာဘုရင်မ၏ ဆုတောင်းတစ်ခုဖြစ်သည့် “ငါလာမှကြီး၊ ငါလာမှာသီး” ဆိုသည့် ဆုတောင်းအတိုင်း မကြီးမထွား အသီးမသီး တာဟု အဆိုရှိခဲ့တာဖြစ်သည်။ ဗိဿနိုးမြို့ဟောင်း ဥယျာဥ်ထဲတွင် အင်ကြင်းပင်များ မရှိသော်လည်း အင်ကြင်းပွင့်ရဲ့ ရနံ့တို့ကိုလည်း အံအားသင့်ဖွယ် မြင်တွေ့ခံစားရမှာဖြစ်သည်။ <br><br>
                    &nbsp;&nbsp; ဗိဿနိုးမြို့ဟောင်းသည် ပျူလူမျိုးတို့၏ ယဥ်ကျေးမှု၊ စီးပွားရေး၊ ဘာသာရေးတို့ကို ဖော်ပြရာ သမိုင်းစာအုပ်ကြီးဟု ခေါ်ဆိုရပါသည်။ ဗိဿနိုးမြို့ဟောင်းအတွင်းရှိ ရွှေရောင်တော်စေတီသည်လည်း အလွန် ထင်ရှားပြီး ပျူခေတ်ကသချိုင်း၊ နန်းတော်ဆောင်၊ ကန်တော်ကြီး၊ နတ်ကွန်း၊ နတ်နန်းတို့အား တူးဖော်ထား သည်များကို လေ့လာနိုင်ကြောင်း ဖော်ြပအပ်ပါသည်။ 
                    
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/min_hla/1.jpg'),
                            require('@/assets/images/destination/magway/min_hla/2.jpg'),
                            require('@/assets/images/destination/magway/min_hla/3.jpg'),
                            require('@/assets/images/destination/magway/min_hla/1.jpg'),
                            require('@/assets/images/destination/magway/min_hla/2.jpg'),
                            require('@/assets/images/destination/magway/min_hla/3.jpg'),
                            require('@/assets/images/destination/magway/min_hla/1.jpg'),
                            require('@/assets/images/destination/magway/min_hla/2.jpg'),
                        ],
                    title: `မင်းလှခံတပ်`,
                    status: 0,
                    content: `&nbsp; &nbsp; မင်းလှခံတပ်သည် မင်းလှမြို့၊ ဧရာဝတီမြစ်ကမ်းထိပ်တွင် တည်ရှိပြီး လေးထောင့်စတုရန်းသဏ္ဍာန် ဆင်ဆင်ရှိသည်။ မင်းလှခံတပ်မှာ မြေကြီးပေါ်တွင် တည်ဆောက်ထားသော ခံတပ်ဖြစ်ပြီး မြစ်တစ်ဖက်ကမ်း တွင်ရှိသော ဂွေးချောင်းခံတပ်မှာ မြေတွင်းခံတပ် ဖြစ်သည်။ ဤခံတပ် (၂)ခုစလုံးကို သက္ကရာဇ် (၁၂၂၂-၂၃) ခုနှစ်တွင် စတင်တည်၍ (၁၂၂၅)ခုနှစ်တွင် ပြီးစီးခဲ့သည်။ ထိုသို့တည်ဆောက်ရာ၌ ပြင်သစ် အင်ဂျင်နီယာ တစ်ဦးနှင့် အီတာလျံ အင်ဂျင်နီယာတစ်ဦးတို့က မြန်မာစစ်ဘက်အင်ဂျင်နီယာများနှင့် ပူးပေါင်းတည်ဆောက် ကြလေသည်။ မင်လှခံတပ် တည်ဆောက်ရာ၌ လိုသောအုတ်များကို မင်းလှမြို့တောင်ဘက် အင်းဖျားဆိုသော နေရာနှင့် မင်းလှမြို့ အနောက်တောင်ဘက်ကပ်၍ တည်ရှိသော လက်လန်ဆိုသော ရွာကလေးအနီးရှိ နေရာ များတွင် အုတ်ဖုတ်လုပ်ရာ ယခုတိုင် အင်းကြီးသဖွယ်ဖြစ်နေပြီးလျှင် ရှေးအုတ်ချပ်အချို့ကို တွေ့ရသေးသည်။ အင်္ဂတေခင်းရန် သဲကို မင်းလှအထက်ရှိ မြင်းကျတောင်ကမ်းပါးမှ သယ်ယူကြပြီး မင်းလှခံတပ် ဆောက်ရာ၌ ဖော်စပ်သော အင်္ဂတေတွင် ထုံး၊ သဲ၊ ရေ၊ ထန်းလျက်၊ အုံတုံ၊ ကျွဲကော်များရောစပ်၍ မောင်းစင်တွင် ထည့်ထောင်းရာ စေးချွဲမှယူပြီးလျှင် နံရံတွင်ပစ်ကြည့်ကာ ပစ်၍ကွာမကျဘဲကပ်နေမှ အင်္ဂတေအဖြစ် အသုံးပြု ကြောင်းဆိုလေသည်။ <br><br>
                    &nbsp; &nbsp; မင်းလှခံတပ်၏ အလျားမှာ အပြင်မှ (၁၇၃)ပေ (၇)လက်မ၊ အပြင်အနံမှာ (၁၃၁)ပေ (၄)လက်မဖြစ်ပြီး ခံတပ်၏ အတွင်းအလျားမှာ (၁ဝ၈)ပေ (၈)လက်မ၊ အတွင်းအနံမှာ (၈၈)ပေ (၄)လက်မဖြစ်သည်။ ခံတပ် အတွင်း တောင်ဘက်နှင့် မြောက်ဘက်နံရံများမှ ခံတပ်အပေါ်စင်္ကြံသို့တက်သော အုတ်လှေကား နှစ်စင်း ရှိသည်။ အပေါ်စင်္ကြံလမ်းအကျယ်မှာ (၂၁)ပေ (၆)လက်မဖြစ်ပြီး စင်္ကြံလမ်းမှ အပြင်အုတ်ရိုး၏ အမြင့်မှာ (၄)ပေ (၅)လက်မဖြစ်သည်။ မြောက်ဘက်မျက်နှာတွင် ထူးထူးခြားခြား ပထမနံရံအုတ်ရိုးကို အပြင်မှ အတန်ခွာ၍ အုတ်ရိုးတစ်ထပ်ထပ်ပြီး ကာရံထားသည်။ ခံတပ်မြောက်ဘက်မျက်နှာ အုတ်ရိုး(၂)ထပ်စလုံး၏ နံရံထုမှာ (၁၇)ပေ (၃)လက်မနှင့် အုတ်ရိုး(၂)ခုကြားရှိ မြေဖို့ထားသည့် မြေသားထုမှာ (၉)ပေ (၁ဝ)လက်မရှိပြီး အရှေ့ဘက်မျက်နှာနံရံမှာ အတော်ပင်ပြိုကျပျက်စီးနေ၍ လူသွားစင်္ကြံမျှသာ ကျန်ရှိတော့သည်။ ခံတပ် အပေါ်ထပ်စင်္ကြံမှ စင်္ကြံအုတ်ရိုးပေါ်သို့တက်ရာ လှေကားကလေးများ ထောင့်တိုင်းတွင်ရှိသည်။ ထိုအုတ်ရိုး ပေါ်တွင် ကင်းစောင့်စစ်သား၏နေရာနှင့် အလံတိုင်ရှိသည်။ ခံတပ်ပြီးစီးသည်နှင့် ကနောင်မင်းသားနှင့် ပြင်သစ် စစ်ဘက်အရာရှိတို့ ကြီးကြပ်သင်ကြားပေးသည့် တပ်မတော်မှ တပ်ခွဲအချို့သည် နယ်ခြားကင်းတပ်ခွဲများအဖြစ် ခံတပ်သို့ရောက်ရှိ တာဝန်ယူခဲ့လေသည်။ မင်းလှခံတပ်တွင် အဝေးပစ်အမြောက်မြားထားရှိသည်။ ခံတပ် (၂)ခုစလုံးကို တည်ဆောက်သည့်အတွက် ဒေါင်းဒင်္ဂါးကျပ်ပြားရေ ငွေတော်(၇)သိန်းကျော် ကုန်ကျသည်ဟု ဆိုသည်။ <br><br>
                    &nbsp; &nbsp;
                    ၁၈၈၅ ခုနှစ်၊ နိုဝင်ဘာလ (၁၄)ရက်နေ့တွင် မြစ်ဝတစ်လျှောက် စစ်ချီလာသည့် ဗိုလ်ချုပ်ပရင် ဒါဂတ်ကွပ်ကဲသည့် အင်္ဂလိပ်စစ်တပ်ကို မင်းလှခံတပ်မှနေ၍  ရွပ်ရွပ်ချွံချွံ ခုခံတိုက်ခိုက်ကြသည်ဖြစ်ရာ နယ်ချဲ့ အင်္ဂလိပ်စစ်ဗိုလ်များပါ ကျဆုံးခဲ့ကြရသဖြင့် ယခုတိုင် ယင်းစစ်သည်တို့၏ သင်္ချိုင်းများရှိနေသေးသည်။ မင်းလှ ခံတပ်ကြီးသည် မြန်မာ့သမိုင်းမှတ်တမ်းဝင် ခံတပ်ကြီးအဖြစ် ယနေ့တိုင် ထင်ရှားလျက်ရှိသည်ဖြစ်ရာ မြန်မာ သွေးချင်းများ၏ ဇာတိသွေး ဇာတိမာန်ကိုဖွင့်ဆိုခဲ့ရာ အထင်ကရမှတ်တိုင်တစ်ခုလည်း ဖြစ်ပေသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/magway/gway_chaung_fortress/1.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/2.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/1.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/2.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/1.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/2.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/1.jpg'),
                            require('@/assets/images/destination/magway/gway_chaung_fortress/2.jpg'),
                        ],
                    title: `‌ဂွေးချောင်းခံတပ် `,
                    status: 0,
                    content: `ဂွေးချောင်းခံတပ်သည် မင်းလှခံတပ်နှင့်အတူ တစ်ပြိုင်တည်း၊ တစ်ချိန်တည်း တည်ဆောက်ခဲ့သော မြန်မာတို့၏ ခံတပ်တစ်ခုဖြစ်သည်။ ကွေ့ချောင်းခံတပ် (သို့) ဂွေးချောင်းခံတပ်သည် မကွေးမြို့မှ ၁၂ မိုင်ခန့် အကွာ ဧရာ၀တီမြစ်၏ အရှေ့ဖက်ကမ်းတွင်တည်ရှိပြီး ဧရာ၀တီမြစ် အနောက်ဖက်ကမ်းရှိ မင်းလှခံတပ်၏ အရှေ့တောင်ဖက် ဓားလွယ်ခုတ် အနေအထားတွင်တည်ရှိသည်။ ခံတပ်ကို မင်းတုန်းမင်း၏ ညီတော် ကနောင်မင်းသား၏ ကြီးကြပ်စီစဉ်မှုဖြင့် ပြင်သစ်နှင့် အီတာလျံလူမျိုးများဖြစ်ကြသည့် ကိုမိုဟိုပယ်ရီနှင့် မိုလီနာရီတို့နှင့်အတူ မြန်မာအင်ဂျင်နီယာများပူးပေါင်း၍ ခရစ်နှစ် ၁၈၆၀ ပြည့်နှစ်တွင် စတင်တည်ဆောက်ခဲ့ပြီး ခရစ်နှစ် ၁၈၆၃ ခုနှစ်တွင် ပြီးစီးခဲ့သည်။ <br><br>
                    &nbsp;&nbsp; ဂွေးချောင်းခံတပ်သည် အလျား(၂၇၅)ပေ၊ အနံ(၁၅၅)ပေရှိ၍ အမြင့်(၁၂)ပေ၊ ထု(၄)ပေရှိသော အုတ်တံတိုင်းဖြင့် ကာရံတည်ဆောက်ထားသည်။ တံတိုင်း၏အရှေ့ဖက် အနောက်ဖက် မြောက်ဖက်တို့တွင် အတွင်းမှနေ၍ ရန်သူအားတိုက်ခိုက်နိုင်ရန်အတွက် သေနတ်ပစ်ပေါက်များစီမံထားရှိပြီး စုစုပေါင်း အပေါက် အရေအတွက် (၁၅၄)ခုရှိသည်။ အနောက်ဖက် တံခါးတံတိုင်း၏ အတွင်းပိုင်းတွင် စစ်သည်တော်များနေထိုင်ရန် အဆောင်တန်းလျား(၂)ခုနှင့် အရာရှိဆောင်(၁)ခု ပြုလုပ်ထားပြီး အခန်း(၁၃)ခန်းပါရှိသည်။ အဆောင် တန်းလျားများ၏ အရှေ့ဖက်တွင် အကျယ်(၁၄)ပေ အလျား(၁၆၉)ပေရှိ ဥမင်တစ်ခုပြုလုပ်ထားပြီး စစ်တိုက်ရာတွင် အသုံးပြုသော ဆင်များထားရှိသည့်အတွက် ဆင်ကျုံးဟုခေါ်ကြသည်။ ဆင်ကျုံးအတွင်းနံရံ၏ အနောက်ဘက်ခြမ်းတွင် လက်နက်များထားရှိရန် လက်နက်တိုက်တစ်ခုနှင့် အရာရှိဆောင်၏ နောက်ဖက် နံရံတွင် လက်နက်တိုက်တစ်ခု စီမံပြုလုပ်ထားသည်။ ခံတပ်တည်ဆောက်ထားပုံမှာ အဆင့်(၃)ဆင့်ရှိ၍ ပထမအဆင့်သာလျှင် မြေပေါ်တွင်ပေါ်လွင်တည်ရှိပြီး ကျန်(၂)ဆင့်မှာ မြေကြီးအောက်တွင် ဖြစ်သည်။ မြေအောက်ခံတပ်၏ အလယ်တွင် ရေသိုလှောင်ထားရှိရန် အလျား(၇၂)ပေ အနံ(၁၇)ပေ အနက်(၈၅)ပေရှိသည့် မြေအောက်ရေကန်တစ်ခုကိုလည်း စနစ်ကျစွာ တည်ဆောက်ထားသည်။ ဂွေးချောင်းခံတပ်ကို (၁၉၅၇)ခုနှစ်မှ ယနေ့အချိန်ထိ ရှေးဟောင်းသုသေသန အမျိုးသားစာကြည့်တိုက်နှင့် စာကြည့်တိုက်ဦးစီးဌာနက ပြုပြင် ထိန်းသိမ်းစောင့်ရှောက်လျက်ရှိသည်။
                    `,
                },
            ];

            const nextPage = () => {
                pageNumber.value++;
            }

            const prevPage = () => {
                pageNumber.value--;
            }

            const pageCount = computed(() => {
                let l = places.length
                let s = size;
                return Math.ceil(l/s);
            })

            const paginatedData = computed(() => {
                let start = pageNumber.value * size;
                let end = start + size;

                return places.slice(start, end);
            })

            onMounted(() => {
                swiper.value = new Swiper('.place-swiper', {
                    speed: 600,
                    loop: true,
                    autoplay: {
                        delay: 5000,
                        disableOnInteraction: false
                    },
                    slidesPerView: 'auto',
                    pagination: {
                        el: '.swiper-pagination',
                        clickable: true,
                        type: 'bullets',
                    },
                    breakpoints: {
                        320: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        },

                        1200: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        }
                    }
                });
                
            });

            return { swiper, paginatedData, nextPage, prevPage, pageCount, pageNumber };
        },
    };
</script>