<template>
    <div class="destination">
        <div class="hero-section">
            <div class="banner">
                <img src="@/assets/images/destination/mawlamyine/banner.jpg" class="banner" alt="">
            </div>
            <div class="content">
                <div class="hero-header">
                    <img src="@/assets/images/destination/travel.gif" class="icon" alt="">
                
                    <h3>Places to Visit in</h3>
                    <h2>MawLaMyine</h2>
                    <div class="scroll-down">
                        <div class="container">
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <div class="chevron"></div>
                            <span class="text">Scroll down</span>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="places">
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
            <div class="row">
                <div class="place-card-wrapper" v-for="(card, i) in paginatedData" :key="i">
                    <div class="place-card" :class="{odd: i%2 !== 0}">
                        <div class="place-img ">
                            <div :class="`swiper place-swiper`" data-aos-delay="100">
                                <div class="swiper-wrapper">
                                    <div class="swiper-slide" v-for="(img, i) in card.images" :key="i">
                                        <img :src="img" class="float-start" alt="">
                                    </div>
                                </div>
                                <div class="swiper-pagination" id="swiper-paginate"></div>
                            </div>
                        </div>
                        <div class="place-content">
                            <h2>{{card.title}}  </h2>
                            <p v-html="card.content">
                            </p>
                        </div>
                    </div>
                </div>
            </div>
            <div class="paginate">
                <div class="btn-group">
                    <button @click="prevPage" :disabled="pageNumber == 0" class=" btn-sm btn-primary" :class="{disable: pageNumber == 0}">Prev</button>
                    <button @click="nextPage" :disabled="pageNumber >= pageCount-1" class=" btn-sm btn-primary" :class="{disable: pageNumber >= pageCount-1}">Next</button>
                </div>

                <div class="paginateNum">
                    <span v-for="(n,i) in pageCount" :key="i" :class="{active: i == pageNumber}">{{n}}</span>
                </div>
                <div>&nbsp;</div>
            </div>
        </div>
    </div>
</template>

<script>
    import { ref, onMounted, computed, watch } from 'vue';
    export default {
        setup() {
            const pageNumber = ref(0);
            const size = 5;
            const swiper = ref(null);

            const places = [
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/mon_state/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/mon_state/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/mon_state/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/mon_state/4.jpg'),
                        ],
                    title: `မွန်ပြည်နယ် `,
                    status: 0,
                    content: `မွန်ပြည်နယ်သည် မြန်မာနိုင်ငံတောင်ဘက်ပိုင်းတွင် တည်ရှိပြီး သဘာဝအလှအပများ၊ ဘုရားစေတီပုထိုး များ၊ ယဉ်ကျေးမှုအမွေအနှစ်များ၊ ဒေသခံများ၏ ရိုးရာဓလေ့ ဖော်ရွေပျူငှာမှုများနှင့် ပြည့်နှက်နေသည့် ပြည်နယ် တစ်ခုဖြစ်သည်။ မွန်ပြည်နယ်သည် ပင်လယ်နှင့် နီးကပ်စွာတည်ရှိ၍ အပူပိုင်းရာသီဥတုရှိပါသည်။ မော်လမြိုင်မြို့ သည် မွန်ပြည်နယ်၏ မြို့တော်ဖြစ်ပြီး ပြည်နယ်ရုံးများစိုက်ရာမြို့ဖြစ်သည်။ ဧရိယာ (၈၄.၄၈) စတုရန်းမိုင် ကျယ်၀န်းပြီး ရပ်ကွက်(၂၈)ရပ်ကွက်၊ ကျေးရွာအုပ်စု(၁၃)စု၊ ကျေးရွာပေါင်း(၃၂)ရွာဖြင့် ဖွဲ့စည်းထားပါသည်။ မော်လမြိုင်မြို့သို့ မော်တော်ကား၊ မီးရထား၊ လေယာဉ်တို့ဖြင့် လွယ်ကူစွာ လာရောက်နိုင်ပါသည်။ မော်လမြိုင်မြို့မှ အခြားမြို့များသို့ တိုက်ရိုက်သွားရောက်နိုင်သဖြင့် မော်လမြိုင်မြို့သည် ခရီးလမ်းဆုံမြို့လည်းဖြစ်သည်။ မော်လမြိုင်မြို့တွင် ထင်ရှားကျော်ကြားသော ဘုရားစေတီများမှာ ကျိုက်သလ္လံစေတီ၊ ကျိုက်သုတ်စေတီ၊ မဟာမြတ်မုနိဘုရား၊ ရွှေဗျိုင်းဖြူစေတီ၊ တောင်ဝိုင်းဘုရားစသည့်တို့အပြင် တောင်ရိုးတန်းတစ်လျှောက် ဘုရားစေတီများစွာကို ဖူးတွေ့နိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaiktiyo/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaiktiyo/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaiktiyo/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaiktiyo/2.jpg'),
                        ],
                    title: `ဆံတော်ရှင်ကျိုက်ထီးရိုးစေတီတော်`,
                    status: 0,
                    content: `ဆံတော်ရှင်ကျိုက်ထီးရိုး‌‌စေတီ‌တော်သည် မွန်ပြည်နယ်၊ ကျိုက်ထိုမြို့အနီး ပေါင်းလောင်းတောင်ပေါ်တွင် တည်ရှိပြီး မြန်မာနိုင်ငံတွင် တန်ခိုးကြီးသော စေတီတစ်ဆူဖြစ်သည်။ ကျိုက်ထီးရိုးစေတီတော်သည် ပင်လယ်ရေ မျက်နှာပြင်အထက် (၃၆၁၅)ပေအမြင့်မှာရှိပြီး ကျိုက်ထီးရိုးတောင်ပေါ်သို့ တောင်တက်ကား၊ ကေဘယ်ကားတို့နဲ့ သွားရောက်နိုင်သလို တောင်တက်တောလမ်းအတိုင်း ခြေလျင်ဖြင့်လည်း သွားရောက်နိုင်သည်။   <br>
                    &nbsp; &nbsp; ကျိုက်ထီးရိုးစေတီတော်ကို မွန်ဘာသာဖြင့် "ကျိုက်ဣသီယို" ဟုခေါ်ကြပြီး ကျိုက်(ဘုရား)၊ ဣသိ(ရသေ့)၊ ယို(ရွက်သည်)၊ အဓိပ္ပါယ်မှာ ရသေ့ရွက်ဘုရားဟု အဓိပ္ပါယ်ရသည်။ ကာလရွေ့လျားလာသော် မွန်သံမှ မြန်မာသံ ပြောင်းလဲလာပြီး ကျိုက်ထီးရိုးဟု ခေါ်တွင်လာခဲ့ကြသည်။  <br>
                    &nbsp; &nbsp; ကျိုက်ထီးရိုးစေတီကို အစွဲပြု၍ စေတီတော်တည်ရှိရာတောင်ကို ကျိုက်ထီးရိုးတောင်ဟုလည်း ခေါ်ကြသည်။ တိဿရသေ့နှင့် သိကြားမင်းတည်ခဲ့သော ဆံတော်ရှင်ကျိုက်ထီးရိုးစေတီ တည်ခဲ့သည်မှာ နှစ်ပေါင်း (၂၅၀၀)ကျော်ကြာမြင့်ခဲ့ပြီဟု စစ်ကဲတော်မင်းမောင် ရွှေနော်ရေး မွန်ရာဇဝင်အရသိရသည်။ ကျိုက်ထီးရိုး စေတီတော် တည်နေပုံမှာ အံ့အားသင့်ဖွယ်ကောင်းလှပြီး ကြီးမားမတ်စောက်သော ကျောက်ဆောင်တစ်ခု၏ အစွန်းတွင် လုံးပတ်ပေ(၅၀)ခန့်ရှိသော ဦးခေါင်းပုံသဏ္ဍာန် ကျောက်လုံးကြီးတစ်ခုက ပြုတ်လုတည်းကာ တင်၍နေသည်။ ထိုကျောက်လုံးပေါ်တွင် စေတီတစ်ဆူ တည်ထားသည်။ စေတီတော်တည်ရှိရာ ကျောက်ဆောင်နှင့် ရင်ပြင်တော်ကို ချောက်တစ်ခုခြားနေသောကြောင့် သံတံတားငယ်ဖြင့် ဆက်သွယ်ထားသည်။    <br>
                    &nbsp; &nbsp; ကျိုက်ထီးရိုးဘုရားပွဲတော်ကို ကျင်းပချိန်မှာ နှစ်စဉ် တပို့တွဲလမှ တန်ခူးလအထိဖြစ်သည်။ ပွဲတော်အချိန်၌ မြန်မာနိုင်ငံအရပ်ရပ်မှ ထောင်သောင်းမကသော ဘုရားဖူးများ လာရောက်ကြသည်။ ယနေ့ခေတ်တွင် နိုင်ငံတကာမှ ကမ္ဘာလှည့်ခရီးသည်များပါ လာရောက်ကြသဖြင့် ယခင်ကထက် များစွာစည်ကားလေသည်။  <br>
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaikkalonpon/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikkalonpon/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikkalonpon/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikkalonpon/2.jpg'),
                        ],
                    title: `ကျိုက္ကလွန်ပွန်းစေတီ`,
                    status: 0,
                    content: `ကျိုက်ထိုမြို့နယ်၊ စစ်တောင်းစံပြကျေးရွာတွင် တည်ရှိသော ကျိုက္ကလွန်ပွန်းဆံတော်ရှင်သည် မဟာ သက္ကရာဇ် (၁၀၇)ခုနှစ် ဘီစီ(၅၈၅)ခုနှစ်တွင် ဗုဒ္ဓဘုရားရှင် လေးဝါမြောက်သည့် အခါသမယ ရာဇဂြိုဟ်၌ ဝါဆိုတော်မူစဉ် အရှင်အနုရုဒ္ဓါအမှူးရှိသော ရဟန္တာအရှင်(၆)ပါးတို့၏ လျှောက်ထား တောင်းပန်ချက်အရ ဆံတော်(၆)ဆူ ပေးသနားတော်မူသည်။ <br>
                    &nbsp;&nbsp; ထိုအရှင်မြတ်တို့သည် ဆံတော်တစ်ဆူကို သိကြားမင်းအကူအညီဖြင့် စစ်တောင်းမြို့၊ ကျိုက္ကလွန်ပွန်း စေတီတော်၌ ပထမဆုံးဌာပနာတည်ထားတော်မူသည်။ ထို့နောက် မဟာသက္ကရာဇ် (၁၁၁)ခုနှစ်တွင် သဒင်သိရီရသေ့အား စစ်တောင်းမြို့ ဇေယျပဗ္ဗတတောင်ကုန်း၌ မြတ်စွာဘုရားရှင်နှင့် ရဟန္တာငါးရာတို့ စျာန်သမာပတ် ဝင်စားတော်မူစဉ်အချိန် ဆံတော်တစ်ဆူကို မြတ်စွာဘုရားမှ ပေးသနားတော်မူရာ  ကျိုက္ကလွန်ပွန်းစေတီတော်မြတ်ကို လေးထောင့်ပုံသဏ္ဍာန်တိုက် စေတီအသွင်တည်၍ မြတ်ဗုဒ္ဓ၏ ဆံတော်ဓါတ်နောက်တစ်ဆူကို ထည့်သွင်းကာဌာပနာတည်ထားတော်မူသည်။ <br>
                    &nbsp;&nbsp; ထို့နောက် မဟာသက္ကရာဇ် (၁၄၈)ခုနှစ် (ခရစ်နှစ် ၅၄၄ ခု) ဗုဒ္ဓမြတ်စွာပရိနိဗ္ဗာန်စံပြီးနောက် သွားတော်(၃၃)ဆူကို အရှင်ဂဝံပတိမထေရ်သည် ဘုရားရှင်ဗျာဓိတ်တော်ရသုဝဏ္ဏဘူမိသို့ ပင့်ဆောင်တော်မူကာ မဟာသီရိမာသောကမင်းအား ပေးအပ်တော်မူလေသည်။ ထိုသွားတော် (၃၃)ဆူတို့အား သုဝဏ္ဏဘူမိ မြို့ဦး၌ စေတီ(၃၃)ဆူ တည်ထားကိုးကွယ်တော်မူခဲ့လေသည်။ ဗုဒ္ဓဘုရားရှင် ပရိနိဗ္ဗာန်စံတော်မူ၍ နှစ်ပေါင်း(၂၃၅)နှစ် ကြာသောအခါ တတိယသင်္ဂါယနာတင်လှူပြီး ဘီစီ(၃၀၉)ခုနှစ်တွင် ခေတ်ပြိုင်သုဝဏ္ဏဘူမိ ဘုရင်မင်းမြတ် စူဠသီရိမာကိုယ်တိုင် ဌာပနာတော်မူခဲ့သော ဘုရားရှင်၏ သွားတော်ဓါတ်တစ်ဆူကို ဤကျိုက္ကလွန်ပွန်းဆံတော်ရှင် စေတီတော်ကြီး၌ တည်ထားကိုးကွယ်တော်မူခဲ့လေသည်။ ဤသို့ ဆံတော်နှစ်ဆူ၊ သွားတော်မြတ်တစ်ဆူ ကိန်းဝပ်တော်မူသော မြတ်ဗုဒ္ဓဘုရားရှင်နှင့်တကွ ရဟန္တာငါးရာ စျာန်သမာပတ် ဝင်စားတော်မူခဲ့သည့် ကျိုက္ကလွန်ပွန်း ဆံတော်ရှင်စေတီတော်အား ကျိူက်ထိုမြို့တွင် ဖူးမြှော်နိုင်ပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaikpawlaw/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikpawlaw/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikpawlaw/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikpawlaw/2.jpg'),
                        ],
                    title: `ကျိုက်ပေါလောမှဲ့ရှင်ရုပ်ပွားတော်  `,
                    status: 0,
                    content: `ကျိုက်ပေါလောမှဲ့ရှင်ရုပ်ပွားတော်သည် မွန်ပြည်နယ်၊ ကျိုက်ထိုမြို့တွင် တည်ရှိပြီး ကျိုက်ပေါလောဘုရား၊ ရုပ်ရှင်တော်ဘုရား၊ မှဲ့ရှင်တော်ဘုရား ဟူ၍လည်းခေါ်ကြသည်။ (၄)ဘီစီခန့်တွင် အာသောကမင်း၏ သားတော် အရှင်မဟိန္ဒက သီရိလင်္ကာသို့ ဗုဒ္ဓဘာသာကို စတင်ယူဆောင်လာသည်။ ထိုအချိန်တွင် သီရိလင်္ကာကို အုပ်ချုပ်သောမင်းမှာ ဒေဝါနံပိယတိဿမင်း ဖြစ်သည်။ တိဿမင်း၏အကြံအရ အရှင်မဟိန္ဒ၏ ကြီးကြပ်မှုဖြင့် ပန်းပုဆရာတို့က ကရမ္မက်သား ဗုဒ္ဓဆင်းတုလေးဆူ ထုလုပ်ပူဇော်သည်။ အဆိုပါ ဆင်းတုလေးဆူကို အရှင်မဟိန္ဒ၏ လမ်းညွှန်ချက်အရ သာသနာပြန့်ပွားရန်အလို့ငှာ သမုဒ္ဒရာအတွင်းသို့ မျှောစေသည်။ ကျွန်းတုံးဖြင့်မျှောသော တစ်ဆူမှာ ပုသိမ်မြို့အနီးသို့ ရောက်ရှိသည်ဟု ဆိုကြသည်။ သင်္ကန်းတုံးဖြင့်မျှောသော တစ်ဆူမှာ ကျိုက္ခမီမြို့သို့ ကပ်ရာ ကျိုက္ခမီဘုရားဟူ၍ တည်ထားပူဇော်ကြသည်။ ပိန္နဲတုံးဖြင့်မျှောသော တစ်ဆူမှာ ထားဝယ်ဆိပ်ကမ်းသို့ ကပ်ရာ ရှင်မုတ္ထီးဘုရားဟု အမည်တွင်သည်။ ကျောက်ဘီးဖြင့်မျှောသော ကျန်တစ်ဆူမှာ ကျိုက်ထိုမြို့တောင်ဘက် ဆီးကုန်းချောင်း၌ ကပ်ရာ ကျိုက်ပေါလောဘုရား ဖြစ်လာသည်။ <br>
                    &nbsp;&nbsp;ကျိုက်ပေါလော မှဲ့ရှင်တော်ဘုရားသည် အခြားရုပ်ပွားတော်များကဲ့သို့ ဥာဏ်တော်မြင့်ခြင်း၊ ကိုယ်လုံးတော် ကြီးခြင်းမရှိဘဲ ဥာဏ်တော် (၃)ပေ (၆)လက်မ၊ ဒူးတော်နှစ်ဖက် အကျယ် (၂)ပေ (၆)လက်မ၊ ပလ္လင်တော်အမြင့် (၄)ပေ (၇)လက်မရှိသည့် ရုပ်ပွားတော်ဖြစ်သည်။ လက်တော်နှစ်ဖက်ယှဉ်လျက် စျာနမုဒြာဖြင့် ထိုင်တော်မူကာ ဘုရားဖူးများကို မျက်လုံးတော်ဖွင့်၍ကြည့်နေပုံမှာ အလွန်အသက်ဝင်ပြီး သတ္တဝါတို့ကို ရင်ဝယ်သားကဲ့သို့ ကြင်နာသနားဟန် ပေါ်နေပါသည်။ သင်္ကန်းတော်တွင် အတွန့်အလိပ်များဖြစ်နေပုံမှာ အလွန်ပေါ်လွင်ပြီး မြတ်စွာဘုရားဝတ်ရုံထားသော တကယ့်သင်္ကန်းနှင့် တူနေပါသည်။ ဦးကင်းတော်မှစ၍ တစ်ကိုယ်လုံး ရွှေပိန်းချ ထားသော်လည်း မူလပုံတော်အနေအထား မပျက်ယွင်းသဖြင့် သက်တော်ထင်ရှား မြတ်စွာဘုရားကို ဖူးရသလို ခံစားမိစေပါသည်။ <br>
                    &nbsp;&nbsp; မှဲ့ရှင်တော်ဘုရားဟု ကျော်ကြားခြင်းမှာ ဂန္ဓကုဋီတိုက် တည်ပြီးသောအခါ ဆင်းတုတော်အား အမွှေးနံ့သာများဖြင့် ဆေးကြောကြသည်။ ထိုအခါ ညာဘက်နားထင်၌ မှဲ့တစ်လုံးကို တွေ့ရသည်။ အစွန်းကွက်ဟု ယူဆကာ အထပ်ထပ်ပွတ်ဆေးသော်လည်း မပျောက်ပျက်ဘဲ ရှိနေသည်။ နောက်တနေ့တွင် ရွှေဆိုင်း ရွှေသင်္ကန်း များကပ်လှူရာ အမည်းစက်ပျောက်အောင် အထပ်ထပ်ကပ်ကြသော်လည်း တစ်နာရီခန့်အကြာတွင် ပေါ်မြဲ ပြန်ပေါ်နေကြောင်း တွေ့ရသည်။ ဤအဖြစ်အပျက်ကို အစွဲပြုကာ မှဲ့ရှင်တော်ဘုရားဟု အမည်တွင်လာသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/gawdama_buddha_statue/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gawdama_buddha_statue/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gawdama_buddha_statue/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gawdama_buddha_statue/1.jpg'),
                        ],
                    title: `ထိုင်တော်မူ ဂေါတမ ဗုဒ္ဓရုပ်ပွားတော်ဘုရားကြီး `,
                    status: 0,
                    content: `ထိုင်တော်မူ ဂေါတမ ဗုဒ္ဓရုပ်ပွားတော်ဘုရားကြီးသည် မွန်ပြည်နယ်၊ ကျိုက်ထိုမြို့တွင်ရှိသော ဘုရားသုံးဆူ တောင်ပေါ်၌ တည်ထားသည်။ ဉာဏ်တော်အမြင့်မှာ    (၂၅၅)ပေ (၆)လက်မရှိ၍ မြန်မာနိုင်ငံတွင် အကြီးဆုံးနှင့် ကမ္ဘာတွင် ဒုတိယမြောက်အကြီးဆုံး ထိုင်တော်မူရုပ်ပွားတော်ဖြစ်သည်။  <br>

                        &nbsp; &nbsp;ဤဘုရားကြီးတွင် အထပ်ပေါင်း(၁၇)ထပ်ရှိပြီး အလွှာပေါင်း(၁၈)လွှာပါရှိသည်။ နောက်ဆုံးပွင့်တော်မူခဲ့ သော ဂေါတမဗုဒ္ဓမြတ်စွာဘုရားကို အစွဲပြုပြီး ဂေါတမဗုဒ္ဓရုပ်ပွားတော် ဘုရားကြီးဟူ၍ ဆရာတော် ဦးတေဇဝန္တ ကိုယ်တိုင် အမည်ပေးခဲ့သည်။ ဘုရားကြီးတည်ထားမှုအတွက် ကျိုက်ထိုမြို့၊ တောင်သူစုရပ်ကွက်တွင် နေထိုင်သည့် မြန်မာရွှေပြည်ဟိန်းကုမ္ပဏီ ရွှေသတ္တုတူးဖော်ရေး လုပ်ငန်းပိုင်ရှင် ဦးတင်ဝင်း၊ ဒေါ်အုံးမြင့်တို့ မိသားစုက ကျပ်သိန်းသုံးထောင်ကို မတည်လှူဒါန်းခဲ့သည်။  <br>
                        &nbsp; &nbsp; ထိုင်တော်မူ ဂေါတမဗုဒ္ဓရုပ်ပွားတော်ဘုရားကြီး တည်ရန်အတွက် ၂၀၁၄ ခုနှစ်တွင် စတင်မြေရှင်း ပန္နက်ရိုက်ခဲ့ပြီး ၂၀၁၆ ခုနှစ်တွင် သီတဂူဆရာတော်ဘုရားကြီးက အုတ်မြစ်ချခဲ့ခြင်းဖြစ်သည်။ ဘုရားကြီး၏ ကိုယ်တွင်း၌ အထပ်များစွာပါဝင်မည်ဖြစ်ပြီး ပထမထပ်တွင် ဌာပနာထားကာ ဌာပနာကိုလည်း အလှူရှင်များ ကြည့်မြင်နိုင်အောင် စီမံထားမည်ဖြစ်သည်။ ဉာဏ်တော်အမြင့် (၂၅၅)ပေ (၆)လက်မထားခြင်းမှာ ရောက်ရှိ နေသည့် သာသနာတော်နှစ်ကို သိမြင်နိုင်အောင်ဖြစ်ကြောင်း ဘုရား၏အမည်ကိုလည်း မြတ်စွာဘုရား၏ အမည်ရင်း ဂေါတမဗုဒ္ဓဟု အမည်ပေးထားသည့်အတွက် ဘုရားဖူးသူများနှင့် ဆုတောင်းသူများအတွက်လည်း သက်တော်ထင်ရှားဘုရားရှင်ကို ရည်စူးပူဇော်နိုင်အောင် အမည်ပေးခဲ့ခြင်းဖြစ်ကြောင်း ဆရာတော်က ဆက်လက် မိန့်ကြားခဲ့သည်။  
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaik_htee_saung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_htee_saung/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_htee_saung/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_htee_saung/2.jpg'),
                        ],
                    title: `ကျိုက်ထီးဆောင်းစေတီတော်`,
                    status: 0,
                    content: `ကျိုက်ထီးဆောင်းစေတီတော် (ကျိုက်ကလွတ်ဒက်စေတီတော်) သည် မွန်ပြည်နယ်၊ ဘီးလင်းမြို့နယ်၊ ဇုတ်သုတ်ရွာတွင် တည်ရှိသည့် စေတီတော်တစ်ဆူ ဖြစ်သည်။ သာသနာနှစ် (၁၁၁)ခုနှစ်တွင် မြတ်စွာဘုရားသည် သုဝဏ္ဏဘုမ္မိသို့ ဒေသစာရီ ကြွတော်မူသည်။ ထိုအခါ ကော့ကလွတ်တကောနတ်ဘီလူးကျွန်းမှ ဘီလူးညီနောင် တို့သည် မြတ်စွာဘုရားကို ဖူးမြင်၍ ဆံတော်တစ်ဆူ ရကြသည်။ ထို့နောက် နေရပ်တွင် ဂဝံအုတ်ကျောက်တို့ဖြင့် (၁၁၃)ခုနှစ်တွင် စေတီတော်တစ်ဆူ တည်ခဲ့သည်။ မြတ်စွာဘုရားရုပ်တု၊ ဘီလူးညီနောင်ရုပ်တု၊ ရွှေငွေများအပြင်၊ နတ်သမီးဆံပင်တို့ကိုဖြတ်၍ ကျစ်ခွေကာ ပူဇော်ဌာပနာခဲ့သည်။ <br>
                    &nbsp;&nbsp; စေတီတော်၏ အတိုင်းအတာများမှာ ဖိနပ်တော် အတောင်(၄၀)၊ ဖိနပ်ခုံ (၂၃)တောင်၊ ဒုတိယဖိနပ်တော် (၃၆)တောင်၊ ရှစ်မြှောင့် (၁၈)တောင်၊ ဉာဏ်တော် အတောင်(၆၀) စေတီတော်ပတ်လည်တွင်ရှိသည့် ကျောက်ပြင် ပျက်သည် နှစ်တောင်တစ်မိုက် ရှိသည်။ ထီးရိုး နှစ်တောင့်ထွာရှိသည့် ကျောက်ထီး (၁၂)စင်းကို လှူဒါန်းထားသည်။ ဂဝံကျောက်များသည် လူ(၂၀)မှ လူ (၈၀)အထိ မချီရသော ကျောက်တုံးကြီးများ ပါဝင်သည်။  <br>
                    &nbsp;&nbsp;စေတီတော်၏ ဘွဲ့တော်မှာ “ကျိုက်ကလွတ်ဒက်” ဖြစ်ပြီး အဓိပ္ပာယ်မှာ “နတ်တည်သော ဘုရား” ဖြစ်သည်။ နတ်ဘီလူးညီနောင်၏ သမီးတော်များမှ ဆံပင်များကို ကြိုးကဲ့သို့ကျစ်ကာ လှပသေသပ်စွာ ဌာပနာပြု ပူဇော်ထားခြင်းကြောင့်လည်း “ကျိုက်ဇုတ်သွတ်” ဟုလည်းခေါ်သည်။  <br>
                    &nbsp;&nbsp; မြတ်စွာဘုရှင်း၏ ဗျာဒိတ်တော်အတိုင်း သာသနာ (၂၅၀၀)မပြည့်မှီအချိန်တွင် လူတို့၏ အကုသိုလ်စရိုက် အတိုင်း စေတီတော်မြတ်ကြီး ထီးတော်မှာ စောင်းနေသည်။ ဗြိတိသျှအင်္ဂလိပ်လက်ထက်ကပင် ထီးဆောင်း ဘုရားဟုခေါ်ဆိုခဲ့ပြီး ဘယ်အရပ်ကကြည့်ကြည့် စောင်းနေသောပုံစံအတိုင်း ထီးတော်မှာ ပတ်လည်စောင်းလျက် ရှိခြင်းမှာလည်း ထူးခြားမှုတစ်ရပ်ဖြစ်ခဲ့သည်။ <br>
                    &nbsp;&nbsp;ကျိုက်ထီးဆောင်းဆရာတော်မှ (၁၃၃၃)ခုနှစ် ထီးတော်အသစ်တင်လှူသည့် အချိန်မှစပြီး စောင်းနေသော ထီး တည့်မတ်တော်မူခဲ့ပြီး ကျိုက်ထီးဆောင်း ဘွဲ့တော်နှင့်အညီ အေးချမ်းသော ကုသိုလ်ချမ်းသာမှုများ ရရှိစေခဲ့ ပါသည်။  
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/shwe_sar_yan/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/shwe_sar_yan/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/shwe_sar_yan/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/shwe_sar_yan/2.jpg'),
                        ],
                    title: `ရွှေစာရံဘုရား (သထုံ)`,
                    status: 0,
                    content: `လေးဆူဓာတ်စံ ရွှေစာရံဟုခေါ်ဝေါ်ကြသော ရွှေစာရံစေတီသည် မွန်ပြည်နယ်၊ သထုံမြို့၏ အနောက် တောင်ဘက်တွင် တည်ရှိသည်။ မြတ်စွာဘုရားရှင်သည် မဟာသက္ကရာဇ် ၁၀၅ ခု၊ ရှစ်ဝါမြောက်အခါ၌ ဂဝမ္ပတိမထေရ်ကို အကြောင်းပြု၍ သုဝဏ္ဏဘုမ္မိသို့ ကြွတော်မူလေသည်။ <br>
                    &nbsp;&nbsp; ဘုရားရှင်အား သထုံမင်းကြီး၊ မိဖုရားနှင့်တိုင်းသူပြည်သားများမှ ရတနာများဖြင့် ပူဇော်ကြသည့်အပြင် သီတင်းသုဉ်းရန် ကျောင်းဆောင်ကိုလည်း မြတ်စွာဘုရား ဥဒေါင်းမင်း၊ ဆင်မင်း၊ ရသေ့ဘဝတို့တွင် ပျော်မွေ့ခဲ့ဖူးသည့် မောရပဗ္ဗကုန်း၌ ဆောက်လုပ်လှုဒါန်းကြလေသည်။  <br>
                    &nbsp;&nbsp;မြတ်စွာဘုရားရှင် မဇ္ဇျိမအရပ်သို့ ပြန်ကြွတော်မူသည့်အခါ မင်းကြီးသည် နောင်အစဉ် ကိုးကွယ်ရာကို ပေးသနားတော်မူပါရန် တောင်းဆိုသောကြောင့် ဘုရားရှင်မှ သွားတော်လေးဆူကို ပေးသနားတော်မူပါသည်။ (သထုံမင်းကြီး၏အမည်မှာ သူရိယစန္ဒမဟာဒွသဘောင်ဟူ၍၎င်း၊ အခြားသမိုင်းတို့တွင် တိဿဓမ္မသီဟရာဇာဟူ၍ လည်းကောင်း ရေးသားထားပါသည်။) သွားတော်လေးဆူကို ရရှိတော်မူသည့်အခါ မင်းကြီးသည် လွန်စွာ ရွှင်လန်းအားရတော်မူပြီး သုရာပရန္တဥန္နတ ကုန်းတော်ပေါ်၌ အဝှမ်း(၄၅)တောင်၊ အစောက်(၄၇)တောင် တူးဖော်၍ ဌာပနာမည်ပြုရာ ရှေးဘုရားသုံးဆူတို့၏ ဆံတော်ဓာတ်၊ တောင်ဝှေးတော်နှင့် မြသပိတ်တော်တို့ကို ဖူးတွေ့ရလျှင် မင်းကြီးသည် ဝမ်းမြောက်တော်မူ၍ ရတနာအထူးထူးဖြင့် ဌာပနာတိုက်ကိုမွမ်းမံပြီးသော် မဟာသက္ကရာဇ် ၁၀၅ ခု၊ တပေါင်းလဆန်း (၅)ရက်နေ့တွင် ဌာပနာကာ မြကျောက်ဖျာပိတ်၍ အထက်တွင် စေတီတည်တော်မူလေသည်။ စေတီအား “စီရံဌာတုစေတီ” ဟုအမည်သမုတ်ခဲ့ရာမှ ကာလကြာသော် “စီရံ”မှ “စာရံ” ဖြစ်ကာ “ရွှေစာရံစေတီတော်” ဟူ၍ အမည်တွင်လာခဲ့ရပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_pagoda/1.jpg'),
                        ],
                    title: `ဇင်းကျိုက်ဆံတော်ရှင် စေတီတော် `,
                    status: 0,
                    content: `ဇင်းကျိုက်ဆံတော်ရှင် စေတီတော်သည် မွန်ပြည်နယ်၊ ပေါင်မြို့ရှိ ဇင်းကျိုက် (ဂစ္ဆာဂီရိ) တောင်တော်ပေါ် တွင် ကိန်းဝပ်တော်မူလျက်ရှိသည်။ မြတ်စွာဘုရားသည် မဟာသက္ကရာဇ် ၁၁၁ ခုနှစ်တွင် တပည့်ရဟန္တာ (၅၀၀) နှင့်အတူ သုဝဏ္ဏဘူမိ(သထုံ)ပြည်သို့ ကောင်းကင်ခရီးမှ ကြွမြန်းလာတော်မူသည်။ မြတ်စွာဘုရားသည် ကေလာသ တောင်ပေါ်တွင် တိသကုမာရ၊ သီဟကုမာရ ရသေ့ညီနောင်နှင့်အတူ တိသဓမ္မသီဟရာဇာမင်း၊ ပြည်သူ ပြည်သား အပေါင်းတို့အား တရားရေအေးတိုက်ကျွေးတော်မူပြီးနောက် ရသေ့ခြောက်ပါးတို့အား ဆံတော်ဓာတ်တစ်ဆူစီ ပေးသနားတော်မူသည်။   <br>
                    &nbsp;&nbsp; 
                    ဇင်းကျိုက် (ဂစ္ဆာဂီရိ) တောင်တွင် သီတင်းသုံးတော်မူသော တိသကုမာရသေ့သည် လက်ခံရရှိသော ဆံတော်ကို အများကိုးကွယ်နိုင်စေရန် ရည်သန်ပြီး သုဝဏ္ဏဘူမိပြည့်ရှင် တိသဓမ္မသီဟရာဇာမင်းနှင့် တိုင်ပင်ကာ ဇင်းကျိုက်တောင်အထွတ်တွင် မြတ်စွာဘုရား၏ဆံတော်ကို ဌာပနာပြီး ဉာဏ်တော်(၁၀)တောင်ရှိ စေတီတော်ကို တည်ထားကိုးကွယ်ခဲ့သည်။  <br>
                    &nbsp;&nbsp;သက္ကရာဇ် ၂၃၆ ခုနှစ်တွင် သီရိဓမ္မာသောကမင်းကြီးက သာသနာပြုစေလွှတ်ခဲ့သော အရှင်သောဏမထေရ်၊ အရှင်ဥတ္တရမထေရ်နှင့် အရှင်အနုရုဒ္ဓမထေရ်မြတ်တို့သည် တောချုံအကြား ရောင်ခြည်တော်ခြောက်သွယ် ကွန့်မြူးနေသည့်စေတီတော်ကို ဖူးမြင်ရသဖြင့် သုဝဏ္ဏဘူမိပြည့်ရှင်မင်းအား ဉာဏ်တော်(၁၈)တောင်အထိ တိုးမြှင့်ပြီး စေတီအသစ်တည်ထားစေသည်။ <br>
                    &nbsp;&nbsp;
                    သက္ကရာဇ် ၈၂၈ ခုနှစ်တွင် ဓမ္မစေတီမင်းကြီးသည် စေတီတော်ကို ဉာဏ်တော်(၃၆)တောင်အထိ တိုးမြှင့် တည်ထားခဲ့သည်။ မင်းအဆက်ဆက်၊ ပြည်သူအဆက်ဆက် ထိန်းသိမ်းပြုပြင် ကိုးကွယ်ခဲ့ကြသဖြင့် ဇင်းကျိုက် ဆံတော်ရှင်စေတီတော်သည် ယနေ့တိုင်အောင် သမိုင်းဝင် မြတ်စွာဘုရား၏ ဆံကေသာမဟာ ဓာတုဝင် ဆံတော်ရှင်စေတီတော်အဖြစ် တင့်တယ်စွာ ကိန်းဝပ်တော်မူလျက်ရှိပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/nwarlabohtaung_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/nwarlabohtaung_pagoda/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/nwarlabohtaung_pagoda/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/nwarlabohtaung_pagoda/2.jpg'),
                        ],
                        title: `ဆံတော်ရှင် ဆုတောင်းပြည့် ဗန္ဓိသေလာစေတီတော် (နွားလပို့တောင် ဆံတော်ရှင် စေတီတော်)  `,
                    status: 0,
                    content: `ဗန္ဓိသေလာ နွားလပို့တောင် ဆံတော်ရှင်စေတီတော်သည် မွန်ပြည်နယ်၊ ပေါင်မြို့၊ ကျုံကကျေးရွာအနီး နွားလပို့တောင်ပေါ်တွင် တည်ရှိသည်။ နွားလပို့တောင်ဟု အမည်တွင်ရခြင်းသည် ကျုံကကျေးရွာမှ မြောက်ဘက်သို့ မျှော်ကြည့်လျှင် တောင်တန်းကြီးအလယ်၌ ဤတောင်ကို နွားဥဿဘကြီး၏ လပို့နှင့်အလား သဏ္ဍာန်တူစွာ မြင်တွေ့ရခြင်းကြောင့် နွားလပို့တောင်ဟု အမည်တွင်ခြင်းဖြစ်သည်။ နွားလပို့တောင်သည် အမြင့်ပေ(၁၈၈၈)ရှိပြီး ဇင်းကျိုက်တောင်၊ ကုလားမတောင်တန်းတို့နှင့် ဆက်စပ်နေပါသည်။ <br>
                    &nbsp;&nbsp; 
                    ကျိုက်ထီးရိုးစေတီကို တည်ထားခဲ့သော တိဿရသေ့ကြီးသည် ဇင်းကျိုက်တောင်တွင် သီတင်းသုံး နေထိုင်စဉ် မြတ်စွာဘုရားရှင်ချီးမြှင့်တော်မူခဲ့စဉ်က ရရှိခဲ့သည့် ဆံတော်တစ်ဆူကို ပင့်ဆောင်လာပြီး စေတီတည်ထားကိုးကွယ်ရန် ရည်သန်၍ ရသေ့ဦးခေါင်းတော်သဏ္ဍာန် ကျောက်တုံးကို ရှာဖွေရာ ဤနွားလပို့ တောင်ပေါ်ရှိ လုံးဆင့်တည်နေသည့် ကျောက်တုံးတော်များကို တွေ့ရှိပြီး၊ အလယ်ကျောက်တုံးတော်ကို ထွင်းဖောက်ဌာပနာလျက် ဤစေတီတော်ကြီးကို တည်ထားခဲ့ခြင်းဖြစ်ပါသည်။ <br>
                    &nbsp;&nbsp; စေတီတော်၏ပုံသဏ္ဍာန်မှာ ကျောက်တုံးသုံးလုံးဆင့် တည်ရှိနေသော ကျောက်တုံးတော်များ၏ အပေါ်ဆုံးကျောက်တုံးတွင် တည်ထားသော စေတီဖြစ်သည်။ စေတီတော်ကြီး၏ ပုံသဏ္ဍာန်နှင့်ပတ်သက်၍ ကျောက်တုံးသုံးတုံးဆင့် တည်နေပုံမှာလည်း အရှေ့၊ အနောက်၊ တောင်၊ မြောက် အရပ်လေးမျက်နှာမှ မတူကွဲပြား ဖူးမျှော်ပါက ပုံသဏ္ဍာန်တော်တစ်မျိုးစီ ဖူးမြင်တွေ့ရှိရပါသည်။ အရှေ့မြောက်အရပ်နှင့် အနောက်တောင်အရပ်တို့မှ ဖူးမြော်ပါက ရသေ့တစ်ပါး၏ ဦးခေါင်းတော်၊ ပါးပြင်တော်၊ နားရွက်တော်နှင့် ပခုံးတော်သဏ္ဍာန်တွေ ဖူးမြင်ရ ကြောင်း ဆိုကြပါသည်။ 
                    
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_waterfall/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_waterfall/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_waterfall/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/zin_kyaik_waterfall/2.jpg'),
                        ],
                    title: `ဇင်းကျိုက်ရေတံခွန်`,
                    status: 0,
                    content: `&nbsp; &nbsp; ဇင်းကျိုက်ရေတံခွန်သည် ရန်ကုန်-မော်လမြိုင် ကားလမ်းဘေးတွင်တည်ရှိပြီး မြောက်ဘက်(၁၅)မိုင် အကွာတွင် သထုံမြို့၊ တောင်ဘက်(၆)မိုင်အကွာတွင် ပေါင်မြို့တို့ တည်ရှိပါသည်။ <br>
                    &nbsp; &nbsp;ဇင်းကျိုက်ရေတံခွန်သည် တောတောင်သဘာဝအလှများပြည့်နှက်နေပြီး သာယာကြည်နူးဖွယ် အပန်းဖြေ စရာနေရာတစ်ခုဖြစ်သည်။ ပေ(၃၀၀၀)ကျော်မြင့်မားသည့် ကုလားမတောင်ပေါ်မှ တောတောင်အဆင့်ဆင့် ဖြတ်ကျော်လာသည့် ရေတံခွန်ကို တောင်ပေါ်အချို့နေရာများတွင် အဝေးမှမြင်တွေ့နိုင်ပြီး ကျောက်သင်္ဘောစေတီ အနီးတွင် အရမ်းလှပသည့် ရေတံခွန်အဖြစ် ဖြန့်ကျစီးဆင်းလျက်ရှိပါသည်။ ဇင်းကျိုက်ရေတံခွန်သည် (၂)ဆင့်ရှိပြီး အမြင့်ပေ (၁၀၀)ခန့်မြင့်မားပါသည်။ ရေတံခွန်၏ အလှဆုံးအချိန်သည် နှစ်စဉ် ဇွန်လမှ ဒီဇင်ဘာလအထိဖြစ်ပြီး ထိုကာလများတွင် ခရီးသွားများ လာရောက်မှုများပြားလျက်ရှိပါသည်။  <br>
                    &nbsp; &nbsp;
                    အပေါ်ရေတံခွန်တွင် ရေကူးခြင်းကို တားမြစ်ထားပြီး အောက်ထပ်ရေတံခွန်တွင် ရေကစားကြရသည်။ အပေါ်ရေတံခွန်တွင် ကျောက်သင်္ဘောစေတီကို သပ္ပါယ်စွာ မြင်တွေ့ရမည်ဖြစ်သည်။ စီးဆင်းလာသည့်ရေကို (၁၅)ပေခန့်မြင့်သည့် ကျောက်တုံးကြီးက ထိုးခွဲလျက်ရှိပြီး ၄င်းကျောက်တုံးကြီးသည် သင်္ဘောပုံသဏ္ဍာန်ဖြစ်ကာ အံ့သြစရာကောင်းလှပါသည်။ စေတီတော်တည်ရှိသည့် ကျောက်တုံးပေါ်ကို အန္တရာယ်ရှိသည့်အတွက် တက်ရောက် ခွင့်မပြုဘဲ အဝေးကဖူးမြှော်နိုင်ဖို့ အာရုဏ်ခံတန်ဆောင်များ ပြုလုပ်ပေးထားပါသည်။ စေတီတော်သည် ဉာဏ်တော်အမြင့် (၁၅)တောင်ခန့်ရှိပြီး ရွှေသင်္ကန်းကပ်လှူပူဇော်ထားကာ ကြည်ညိုဖွယ်ဖူးတွေ့နိုင်ပါသည်။  <br>
                    &nbsp; &nbsp;
                        စိမ်းလန်းသည့် တောတောင်သဘာဝအလှအပများဖြင့် သာယာလှပသည့် ရေတံခွန်တွင် အပန်းဖြေ အနားယူနိုင်သလို ထူးခြားအံ့သြဖွယ်စေတီကိုလည်း ဖူးမြှော်ရသည့်အတွက် အမြဲမပျက် ခရီးသွားဧည့်သည်များ လာရောက်ကြပါသည်
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/mahar_myatmuni/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/mahar_myatmuni/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/mahar_myatmuni/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/mahar_myatmuni/4.jpg'),
                        ],
                    title: `မဟာမြတ်မုနိဘုရား (မော်လမြိုင်မြို့)  `,
                    status: 0,
                    content: `မဟာမြတ်မုနိဘုရားသည် မော်လမြိုင်မြို့ အရှေ့ဘက်ရှိ တောင်ရိုးတန်းပေါ်တွင် တည်ရှိသည့် ရုပ်ပွားတော်တစ်ဆူ ဖြစ်သည်။ ခရစ်နှစ် ၁၈၇၈ ပြည့်နှစ်တွင် မင်းတုန်းမင်း နတ်ရွာစံပြီးနောက် ဝဇိရာရာမ ဆရာတော်နှင့် သင်္ဂဇာဆရာတော်တို့သည် မော်လမြိုင်သို့ ကြွတော်မူသည်။ ဆရာတော်တို့ကို ကြည်ညို ရင်းစွဲရှိသည့် စိန်တုံးမိဖုရားကြီးလည်း စုဖုရားလတ်၏ မယ်တော် ဆင်ဖြူမရှင်၏ နန်းတွင်းလူသတ်ပွဲ အန္တရာယ်ကို ရှောင်တိမ်းသည့်သဘောဖြင့် သီပေါမင်းပိုင် အထက်မြန်မာပြည်မှ ဗြိတိသျှပိုင် အောက်မြန်မာပြည်ကို စုန်ဆင်းကာ လိုက်ပါလာခဲ့သည်။ ကာလကြာရှည်လာသည့်အခါ မန္တလေးမြို့ရှိ မဟာမြတ်မုနိဘုရားကြီးကို ဖူးမြှော်လိုစိတ် ဖြစ်လာခဲ့သည်။ မော်လမြိုင်မြို့ရှိ ပြည်သူများလည်း ဖူးမြှော်ခွင့်ရစေရန် ဝဇီရာရာမဆရာတော်သည် ကျောင်းဒါယကာမ ဒေါ်ရွှေပွင့်ကို မန္တလေးရှိ မဟာမြတ်မုနိရုပ်ပွားတော်၏ ပုံတော်ကို ကူးယူစေသည်။<br>
                    &nbsp;&nbsp; ထို့နောက်တွင် ကျိုက်သလ္လံကုန်းတော်မြောက်ဖျား တောင်စွယ်၌ ရုပ်ပွားတော်ကို သွန်းလုပ်ခဲ့ပြီး ရုပ်ပွားတော်ကို သွန်းလုပ်ခဲ့သည့်အချိန်မှာ ၁၂၆၆ ခုနှစ်၊ ကဆုန်လဆန်း (၁၄)ရက်နေ့ ဖြစ်သည်။ <br>
                    &nbsp;&nbsp;ရုပ်ပွားတော်ကို ပြုလုပ်ရာတွင် ရွှေသား ၁၈၄၃ ကျပ်၊ ငွေသား ၆၂၈၄ ကျပ် ထည့်သွင်းကာ ပြုလုပ်ခဲ့သည်။ အိန္ဒိယနိုင်ငံသား မဒရာစီလူမျိုးတစ်ဦးဖြစ်သည့် ဂါနာပတီသည် ၂၃ ရတီရှိ ပတ္တမြားကို သင်းကျစ်တော်တွင် ခြယ်လှယ်ရန် လှူဒါန်းခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaikthalan_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikthalan_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikthalan_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaikthalan_pagoda/1.jpg'),
                        ],
                    title: `ကျိုက်သလ္လံစေတီတော်`,
                    status: 0,
                    content: `ကျိုက်သလ္လံစေတီတော်သည် မွန်ပြည်နယ်၏ မြို့တော် မော်လမြိုင်မြို့တွင် အကြီးဆုံးစေတီတော်ဖြစ်ပြီး မြို့၏အရှေ့ဖက် သံလင်တောင်စွယ်တွင် တည်ရှိသည်။ စေတီတော်၏ဉာဏ်တော်အမြင့်မှာ ပေ(၄၅၀)ရှိပြီး စေတီရံပေါင်း(၃၄)ဆူရှိသည်။ ကျိုက်သလ္လံစေတီကို မွန်ဘာသာဖြင့် “ကျာ်သေမ်လီု” ဟုခေါ်ဆိုပြီး ရှမ်းလူမျိုးများကို ထွက်ပြေးစေနိုင်သော ပျက်စီးစေနိုင်သောဘုရားဟု အဓိပ္ပါယ်ရသည်။ ရှေးယခင်က မွန်လူမျိုးများသည် ထိုင်းလူမျိုး များကို ရှမ်းလူမျိုးများဟု ခေါ်ကြသည်။ မြန်မာ့သမိုင်းတွင် ကံရာဇာကြီး၊ ကံရာဇာငယ် ညီနောင်နှစ်ပါးသည် ဘုရင်အဖြစ်ရရှိရန်အတွက် စေတီတစ်ဆူကို အပြိုင်တည်ခဲ့ကြရသည်။ ကျိုက်သလ္လံစေတီတော် သမိုင်းသည်လည်း ထိုနည်းတူပင် ဖြစ်သည်။ သမိုင်းအရ မွန်လူမျိုးများနှင့် ရှမ်းလူမျိုးများ မကြာခဏစစ်မက်ဖြစ်ပွားရာ စစ်ပွဲမဖြစ်ပွားစေရန် ပညာရှိနည်းဖြင့် တစ်နေ့တည်းနှင့် ဘုရားတစ်ဆူကို မွန်လူမျိုးနှင့် ရှမ်းလူမျိုးတို့ အပြိုင် တည်ရမည်ဖြစ်သည်။  အရင်ဆုံးပြီးအောင်တည်နိုင်သူသည် အနိုင်ရရှိမည် ဖြစ်သည်။  ရှုံးနိမ့်သူက အနိုင်ရရှိသူ၏ ဒေသကို မည်သည့်အခါမှ ကျူးကျော်တိုက်ခိုက်ခြင်းမပြုရန် သဘောတူညီကြပြီး မွန်လူမျိုးတို့မှ ဝါးများဖြင့် စေတီတည်သောကြောင့် အရင်ဆုံးပြီးမြောက်ကာ အနိုင်ရရှိခဲ့သည်။ ရှမ်းလူမျိုးတို့သည် စေတီတော်ကို အုတ်၊ သဲ၊ ကျောက်တို့ဖြင့် တည်ဆောက်သောကြောင့် တစ်နေ့တည်းနှင့်မပြီးပေ။ ထို့ကြောင့် မွန်လူမျိုးတို့က အနိုင်ရရှိခဲ့သည်။ ထိုအချိန်မှစ၍ ရှမ်းတို့သည်လည်း မွန်ဒေသကို မည်သည့်အခါမျှ လာရောက်ကျူးကျော်ခြင်း မပြုတော့ပေ။ <br>
                    &nbsp;&nbsp; ထိုသို့ ရှမ်းများလန်ပြေးသည်ကို အကြောင်းပြု၍ “တည်စောစေတီတော်”ကို “ကျိုက်ရှမ်းလန်” ဟုခေါ်ပြီး နောင်ကာလ ရွေ့လျားသည့်အခါ “ကျိုက်သလ္လံ” ဟုခေါ်ဆိုခဲ့ကြသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/sein_don_mibaya_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/sein_don_mibaya_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/sein_don_mibaya_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/sein_don_mibaya_kyaung/1.jpg'),
                        ],
                    title: `စိန်တုံးမိဖုရားကျောင်း (ခေါ်) ရတနာဘုံမြင့်ကျောင်း`,
                    status: 0,
                    content: `စိန်တုံးမိဖုရားကျောင်း (ခေါ်) ရတနာဘုံမြင့်ကျောင်းသည် မွန်ပြည်နယ်၊ မော်လမြိုင်မြို့တွင် တည်ရှိသည့် သမိုင်းဝင် ဗုဒ္ဓဘာသာ ဘုန်းကြီးကျောင်းတစ်ခု ဖြစ်သည်။ သီပေါမင်းပါတော်မူပြီးခါစ ၁၈၈၆ ခုနှစ်တွင် မော်လမြိုင်သူ သစ်ကုန်သည်ကြီး ဒေါ်ရွှေပွင့်မှ မင်းတုန်းမင်းလက်ထက် သုဓမ္မာသာသနာပြုဆရာတော်ရှစ်ပါးတွင် တစ်ပါးအပါအဝင်ဖြစ်သည့် ဝဇီရာရာမဆရာတော်၊ မင်းတုန်းမင်း၏ မိဖုရားတစ်ပါးဖြစ်သော စိန်တုံး မိဖုရားကြီးတို့၏ အကူအညီဖြင့် တည်ဆောက်ခဲ့သည်။ နှစ်ပေါင်း(၁၂၀)ကျော်သက်တမ်းရှိ ရှေးဟောင်းဗိသုကာ လက်ရာတို့ဖြင့် ထင်ရှားသော ကျောင်းတိုက်ကြီးဖြစ်သည်။ ကျောင်းတိုက်ကြီးသည် အလျားပေ(၁၃၀)ခန့်ရှိပြီး အုတ်လှေကားသုံးခုဖြင့် တည်ဆောက်ထားကာ အတွင်းပိုင်းတွင်လည်း ထီးဟန်၊ နန်းဟန် အမျိုးသားယဉ်ကျေးမှု အနုစိတ်လက်ရာများကို လေ့လာနိုင်ပါသည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/gaung_say_kyun/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gaung_say_kyun/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gaung_say_kyun/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/gaung_say_kyun/1.jpg'),
                        ],
                    title: `ခေါင်းဆေးကျွန်း`,
                    status: 0,
                    content: `&nbsp; &nbsp;ခေါင်းဆေးကျွန်းသည် မော်လမြိုင်မြို့နှင့် မုတ္တမအကြား သံလွင်မြစ်၊ အတ္ထရံမြစ်၊ ဂျိုင်းမြစ်၊ ဒုံသမိမြစ်၊ ဟောင်သရောမြစ် စသည့် မြစ်(၅)ခုတို့ စီးဝင်ပေါင်းစုံရာ (သို့မဟုတ်) သံလွင်၊ အတ္ထရံ၊ ဂျိုင်း၊ ဒုံသမိ မြစ်(၄)စင်း ပင်လယ်သို့ စီးဝင်ပေါင်းဆုံရာ မြစ်(၅)ပွင့်ဆိုင်တွင် တည်ရှိသော ကျွန်းတစ်ကျွန်းဖြစ်သည်။ <br>
                    &nbsp; &nbsp;ခေါင်းဆေးကျွန်းကို ရှေးအခါက အောင်မြေကျွန်း၊ ပတ္တမြားကျွန်း၊ ရတနာကျွန်း၊ မြစ်ဦးခိုက်ကျွန်း၊ ပဒေသာကျွန်း၊ အဗန္ဓရကျွန်း၊ ငွေယားကျွန်း၊ သိုက်ပေါင်းစုံကျွန်း၊ ပွန်စလိုင်ကျွန်း၊ ခေါင်းဆေးကျွန်း၊ ကျီးကျွန်း ဟူ၍ အမျိုးမျိုးခေါ်ဆိုခဲ့ကြသည်။   <br>
                    &nbsp; &nbsp;
                    ရှေးအခါက မွန်ဘုရင်အဆက်ဆက်သည် ခေါင်းဆေးကျွန်း အနောက်တောင်အရပ် စနေထောင့်ရှိ နတ်ရေတွင်းမှရေဖြင့် နန်းတတ်ဘိသိတ်မင်္ဂလာပြုခြင်း၊ ရန်အပေါင်းကို အောင်မြင်ရန် ဦးခေါင်းဆေးမင်္ဂလာပြုခြင်း၊ ဘုန်းတန်ခိုးတက်စေရန် ဦးခေါင်းဆေးမင်္ဂလာပြုခြင်းများကို ဆောင်ရွက်ခဲ့ကြသည်။ မွန်ဘုရင်များသာမက မြန်မာဘုရင်၊ ယိုးဒယားဘုရင်၊ ခမာဘုရင်များသည်လည်း ဤခေါင်းဆေးကျွန်း နတ်ရေတွင်းမှရေဖြင့် ဦးခေါင်းဆေး မင်္ဂလာ ပြုခဲ့ကြသည်။  <br>
                    &nbsp; &nbsp;
                       ခေါင်းဆေးကျွန်းသည် မော်လမြိုင်မြို့၏ အထင်ကရနေရာြဖစ်ပြီး ဘယ်တော့မှ ရေအောက်ကို ရောက်မသွားသည့် တန်ခိုးကြီးနေရာဖြစ်သည်။ စစ်ပွဲမှပြန်လာသည့်အခါတိုင်း ခေါင်းဆေးမင်္ဂလာ လုပ်သည့် နေရာမို့ ခေါင်းဆေးကျွန်းဟုခေါ်ဆိုပြီး ယခုအခါ စေတီပုထိုးများ တည်ထားသည့် သာသနာ့နယ်မြေတစ်ခုဖြစ်သည်။  <br>
                    &nbsp; &nbsp;
                    ယခုထက်တိုင် ခေါင်းဆေးကျွန်းသို့ လာရောက်သူများသည် နတ်ရေတွင်းမှရေကိုဆောင်ယူကာ ခေါင်းဆေး လေ့ရှိကြောင်းသိရသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/u_zee_na_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/u_zee_na_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/u_zee_na_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/u_zee_na_pagoda/1.jpg'),
                        ],
                    title: `ဦးဇိနစေတီတော်`,
                    status: 0,
                    content: `&nbsp; &nbsp;ဦးဇိနစေတီတော်သည် မော်လမြိုင်မြို့ အရှေ့ဘက်တောင်ရိုးတွင် တည်ရှိသည့် စေတီတော်တစ်ဆူ ဖြစ်သည်။ ရှေးအခါက ထိုဘုရားကို ကျိုက်ပတန်(ဘုရားဖြူ)ဟု မွန်ဘာသာဖြင့် ခေါ်ခဲ့သည်။ ဦးဇိန တည်ခဲ့သည့် စေတီဟောင်းသည် အသောကမင်းကြီးတည်ထားခဲ့သည့် ဆံတော်ကိန်းဝပ်လျက်ရှိသည့် စေတီဟု ယုံကြည်မှုများ လည်းရှိသည်။ ခရစ်နှစ် ၁၈၃၈ ခုနှစ်တွင် ပြန်လည်ပြုပြင်ခဲ့သူ ရသေ့ကြီးဦးဇိနကို အစွဲပြုကာ “ဦးဇိနစေတီတော်”ဟု အမည်ပေးခဲ့လေသည်။  <br>
                    &nbsp; &nbsp;မြန်မာသက္ကရာဇ် ၁၂၃၅ ခုနှစ်တွင် မော်လမြိုင်မြို့ခံ သူဌေးဦးမိုးသည် ပျက်စီးနေသည့် စေတီတော်ကို ပြုပြင်ခဲ့သည်။ သို့ရာတွင် စေတီတော်သည် ငှက်ပျောဖူးအထိပြင်ပြီးမှ ပြိုကျခဲ့သည်။ ထို့ကြောင့် ဒုတိယအကြိမ် ထပ်မံပြုပြင်ခဲ့ရာ ဒုတိယအကြိမ်တွင်လည်း ငှက်ပျောဖူးအထိ ပြီးသည့်အခါ ပြိုကျခဲ့ပြန်သည်။ တတိယအကြိမ် တွင်မူ သံခွေပတ်များဖြင့် တည်ခဲ့သဖြင့် အောင်မြင်ခဲ့သည်။ ထီးတော်တင်ပွဲကို လေးလကြာ ကျင်းပခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/taung_wine_buddhawin/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/taung_wine_buddhawin/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/taung_wine_buddhawin/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/taung_wine_buddhawin/1.jpg'),
                        ],
                    title: `တောင်ဝိုင်းဗုဒ္ဓဝင်`,
                    status: 0,
                    content: `&nbsp; &nbsp; တောင်ဝိုင်းဘုရားသည် မွန်ပြည်နယ်၊ မော်လမြိုင်မြို့၊ တက္ကသိုလ်ကျောင်းအနီးတွင် တည်ရှိပြီး “ကုသိနာရုံ ဘုရား”ဟုလည်း ခေါ်ဆိုကြသည်။ ဧရိယာ ၃၇ ဧက အကျယ်အဝန်းပရိဝုဏ်ရှိသည့် တောင်ဝိုင်းဘုရားသည် ဘုရားဖူးဧည့်သည်များဖြင့် အလွန်စည်ကားလှပါသည်။ ဘုရားပရိဝုဏ်အတွင်းထဲတွင် ဗုဒ္ဓဝင်ဘုရားများကို ဖူးမြှော်ရန်အတွက် အမိုးအကာလုံခြုံစွာဖြင့် ဘုရားစောင်းတန်းများရှိသည့်အပြင် နားနေရန် ထိုင်ခုံများလည်း စီစဉ်ထားရှိပါသဖြင့် ဘုရားဖူးများနှင့် လွန်စွာစည်းကားလှပါသည်။ <br>
                    &nbsp; &nbsp;တောင်ဝိုင်းဘုရားအတွင်းမှာ အကျယ်အဝန်း ပေ(၁၀၀)ပတ်လည်ရှိသော အကွေ့အကောက်များစွာနှင့် မျက်စိလည်စေနိုင်သည့် ရှေးအကျဆုံးအုတ်တွေနဲ့ တည်ဆောက်ထားသော ဝင်္ကပါကြီး တစ်ခုလည်း ရှိပါသေးသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/4th_daughter_of_pyathetgu/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/4th_daughter_of_pyathetgu/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/4th_daughter_of_pyathetgu/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/4th_daughter_of_pyathetgu/2.jpg'),
                        ],
                    title: `သီပေါမင်း၏ စတုတ္ထသမီးတော် ပြဿဒ်ဂူ`,
                    status: 0,
                    content: `&nbsp; &nbsp; သီပေါမင်း၏ စတုတ္ထသမီးတော် အရှင်ထိပ်စုမြတ်ဖုရားလေး၏ ပြဿဒ်ဂူသည် မော်လမြိုင်မြို့၊ ကျိုက်သလ္လံစေတီအနီး သုဓမ္မာရာမ သီလင်ရှင်စာသင်တိုက်ရှေ့တွင် တည်ရှိသည်။ <br>
                    &nbsp; &nbsp; ကုန်းဘောင်မင်းဆက် (၁၁)ဆက်တွင် နောက်ဆုံးဖြစ်သော မြန်မာဘုရင် သီပေါမင်းနှင့် စုဖုရားလတ်တို့၏ စတုတ္ထသမီးတော်ဖြစ်ပြီး အိန္ဒိယနိုင်ငံ ရတနာဂီရိ၌ ခရစ်နှစ် ၁၈၈၇ ခုနှစ်၊ ဧပြီလ (၂၅)ရက်နေ့တွင် မွေးဖွားခဲ့သည်။ မွေးချင်းများမှာ မြတ်ဖုရားကြီး၊ မြတ်ဖုရားလတ်၊ မြတ်ဖုရားတို့ ဖြစ်သည်။ မြတ်ဖုရားလေးသည် အင်္ဂလိပ်လို အထူးကျွမ်းကျင်၍ တော်ဝင်မိသားစု၏ ပြောရေးဆိုခွင့်ရှိသူအဖြစ် ဆောင်ရွက်ခဲ့သည်။ သီပေါမင်းတရားသည် သက်တော်(၅၉)နှစ်၌ ရတနာဂီရိစံအိမ်တော်တွင် နတ်ရွာစံသဖြင့် အလောင်းတော်ကို ထိုမြို့၌ပင် သင်္ဂြိုဟ်လေ သည်။ တော်ဝင်မင်းသမီးမြတ်ဖုရားလေးသည် ၁၉၁၅ ခုနှစ်တွင် အိန္ဒိယမှ မြန်မာပြည်သို့ပြန်လာပြီး မော်လမြိုင်အနောက် Cantonment လမ်းရှိ ဗြိတိသျှအစိုးရက သူမအားပေးထားသော စံအိမ်တော်ကြီးတွင် နေထိုင်ခဲ့သည်။   <br>
                    &nbsp; &nbsp;မြတ်ဖုရားလေးသည် အင်္ဂလိပ်ဘာသာဖြင့် “စတုတ္ထသမီးတော်အရေးတော်ပုံစာတမ်း” ကိုရေးသား၍ မြန်မာပြည်ကို ပြန်ပေးရန် တောင်းဆိုခြင်းကြောင့် ဗြိတိသျှတို့က “သူပုန်မင်းသမီး” ဟုခေါ်ခဲ့သည်။ ခရစ်နှစ် ၁၉၂၀ ဇူလိုင်လ (၁) ရက်နေ့တွင် ရန်ကုန်မြို့၌ ဦးကိုကိုနိုင်နှင့် လက်ဆက်ခဲ့သည်။ စတုတ္ထသမီးတော်သည် ခရစ်နှစ် ၁၉၃၆ မတ်လ (၃)ရက်နေ့တွင် မော်လမြိုင်မြို့ရှိ သူမ၏ စံအိမ်တော်၌ပင် ကံတော်ကုန်ခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/ju_dah_tan_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ju_dah_tan_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ju_dah_tan_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ju_dah_tan_church/1.jpg'),
                        ],
                    title: `ယုဒသန်၏ ပထမနှစ်ခြင်းဘုရားရှိခိုးကျောင်း `,
                    status: 0,
                    content: `&nbsp; &nbsp; ဤဘုရားရှိခိုးကျောင်းသည် မော်လမြိုင်မြို့တွင်တည်ရှိပြီး နှစ်ပေါင်း(၂၀၀)နီးပါးရှိ မြန်မာနိုင်ငံ၏ ပထမဆုံး နှစ်ခြင်းခရစ်ယာန် ဘုရားကျောင်းဖြစ်သည်။ ခရစ်နှစ် ၁၈၂၇ တွင် ရှေးဦးပထမဆုံး မြန်မာ - အင်္ဂလိပ်အဘိဓာန်ကို ရေးခဲ့သော အမေရိကန်လူမျိုး ခရစ်ယာန် သာသနာပြုပုဂ္ဂိုလ် အဒိုနီရမ် ဂျပ်ဆင်(ယုဒသန်)မှ တည်ဆောက်ခဲ့သည်။ ၎င်းဘုရားရှိခိုးကျောင်းသည် ကမ္ဘာတစ်ဝန်း နှစ်ခြင်းခရစ်ယာန် လှုပ်ရှားမှုအတွက် အရေးပါသော သမိုင်းမှတ်တိုင်တစ်ခုဖြစ်သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/St._patrick_roman_catholic_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/St._patrick_roman_catholic_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/St._patrick_roman_catholic_church/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/St._patrick_roman_catholic_church/1.jpg'),
                        ],
                    title: `စိန့်ပက်ထရစ် ရိုမန်ကက်သလစ် ဘုရားရှိခိုးကျောင်း `,
                    status: 0,
                    content: `&nbsp; &nbsp; စိန့်ပက်ထရစ် ရိုမန်ကက်သလစ် ဘုရားရှိခိုးကျောင်းကို ခရစ်နှစ် ၁၈၂၉ တွင် မော်လမြိုင်မြို့၌ တည်ဆောက်ခဲ့သည်။ ပြင်သစ်လူမျိုးတို့က ခရစ်နှစ် ၁၈၅၄ တွင် ဤချာ့ချ်၏ နာရီမျှော်စင်ကို ဆောက်လုပ်ခဲ့သည်။ စိန့်ပက်ထရစ်ကျောင်းသည် ကိုလိုနီခေတ်တွင် အထက်တန်းလွှာကလေးများအတွက် ကျော်ကြားသော ဘော်ဒါကျောင်းဖြစ်သည်။ ထိုင်းနိုင်ငံ၏ ချင်းမိုင် တော်ဝင်မင်းသား Sukkasem နှင့် မွန်မိန်းကလေးတို့၏ ဝမ်းနည်းဖွယ် ချစ်ခြင်းမေတ္တာဇာတ်လမ်းသည် ခရစ်နှစ် ၁၈၉၀ ပြည့်လွန်နှစ်များတွင် ဤကျောင်း၌ဖြစ်ခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/ywa_lutt_village/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ywa_lutt_village/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/ywa_lutt_village/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/ywa_lutt_village/4.jpg'),
                        ],
                    title: `ရွာလွတ်ရွာကဆေးတံ `,
                    status: 0,
                    content: `&nbsp; &nbsp; ရွာလွတ်ရွာသည် မွန်ပြည်နယ်၊ ချောင်းဆုံမြို့နယ်၊ ရွာလွတ်ကျေးရွာအုပ်စု၌ တည်ရှိပြီး နေထိုင်သူအများစုမှာ မွန်လူမျိုးများဖြစ်သည်။ ၄င်းကျေးရွာတွင် ဆေးတံ၊ တုတ်ကောက်၊ လက်ကိုင်ဒုတ်၊ ရေနွေးအိတ် စသည့် အိမ်တွင်းမှု၊ လက်မှုပညာများ ထွန်းကားသည်။ ဘီလူးကျွန်း၏ အချက်အချာကျသော နေရာတွင်ရှိပြီး ကျွန်း၏တောင်မြောက် ဆက်သွယ်ထားသော အဓိကလမ်းမကြီးပေါ်တွင် တည်ရှိသည်။ ဆေးတံလုပ်ငန်းဖြင့် ခရီးသွားလုပ်ငန်းဖွံ့ဖြိုးပြီး နိုင်ငံခြားသားခရီးသွားများ မကြာခဏ လာရောက်လည်ပတ်ရာ နေရာတစ်ခုဖြစ်သည်။<br>
                    &nbsp;&nbsp; Made in Ywarlut “ရွာလွတ်ရွာတွင်လုပ်သည်”ဟု တံဆိပ်နှိပ်ထားသော သစ်သားဆေးတံသည် ကမ္ဘာသိ လက်မှုပညာရပ်တစ်ခုဖြစ်ပြီး ယင်းကို ဦးညွှန့်က ကိုလိုနီခေတ်တွင် စတင်တည်ထွင်ခဲ့ခြင်းဖြစ်သည်။ ဆေးတံ၏ လက်မှုပညာရပ်ကြောင့်ပင် ကိုလိုနီခေတ်လက်ထက် အင်္ဂလိပ်မင်းကိုယ်တိုင် ဂုဏ်ထူးဆောင် ဆုတံဆိပ်ကိုပါ ချီးမြှင့်ခံခဲ့ရဖူးသည်။ ထို့ကြောင့်လည်း ဆေးတံအစဦးညွှန့်က၊ ဆေးတံအစ ရွာလွတ်ကဟူသော စကားပုံများလည်း ရှိနေခဲ့ခြင်းပင်ဖြစ်သည်။  
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/mudoon_blackboard/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/mudoon_blackboard/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/mudoon_blackboard/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/mudoon_blackboard/4.jpg'),
                        ],
                    title: `မုဒွန်းရွာနှင့် ကျောက်သင်ပုန်း `,
                    status: 0,
                    content: `&nbsp; &nbsp;ကျောက်သင်ပုန်းကို ၁၉၄၅ ခုနှစ်တွင် မွန်ပြည်နယ်၊ ချောင်းဆုံမြို့နယ်(ဘီလူးကျွန်း)၊ မုဒွန်းရွာတွင် စတင်ပြုလုပ်ခဲ့သည်။ ‌မုဒွန်းရွာ ကျောက်သင်ပုန်း၊ ကျောက်တံလုပ်ငန်းသည် လွန်ခဲ့သည့် နှစ်ပေါင်း(၁၀၀) ဝန်းကျင်က ရိုးရာလက်မှုလုပ်ငန်းအဖြစ် ရွာလုံးကျွတ်နီးပါး လုပ်ကိုင်ခဲ့သည်။  <br>
                    &nbsp;&nbsp; ကျောင်သင်ပုန်းနှင့် ကျောက်တံများ ဖြစ်ပေါ်လာပုံမှာ ၁၉၄၅ ခုနှစ်တွင် ဦးအောင်သိန်းဆိုသူသည် မုဆိုးမတောင်မှ စီးဆင်းနေသော စမ်းချောင်းရှိ ကျောက်ပြားများကို ကောက်ယူပြီး သံပြားနှင့်ခြစ်ကာ မြန်မာ့ ကျောက်သင်ပုန်းကို စတင်ပြုလုပ်ခဲ့သည်။ ထိုအချိန်က စက်မပေါ်သေး၍ လက်ဖြင့်သာ လုပ်ကိုင်ရသဖြင့် တစ်နေ့လျှင် ကျောက်သင်ပုန်း (၅)ချပ်သာပြီးသည်။ တဖြည်းဖြည်းနှင့် အခြားသူများလည်း ယင်းကျောက်မှ ကျောက်သင်ပုန်း ပြုလုပ်ကြကြောင်း သိရှိလာကြသဖြင့် မည်သူမဆို မိမိကြိုက်သည့်နေရာတွင် ကျောက်များကို ခွာယူ၍ စမ်းသပ်ပြုလုပ်ရာမှ ကျောင်းသင်ပုန်းဖြစ်လာသည်။ ၁၉၅၀ ခုနှစ်မှစ၍ ကျောက်များကို ခွာမရတော့ဘဲ တွင်းစတင်တူးဖော်ရာမှ ကျောက်တွင်းများ ဖြစ်လာခဲ့သည်။ မုဒွန်းရွာသည် မွန်တို့၏ လက်မှုပညာတစ်ရပ်အဖြစ် ကျောက်သင်ပုန်းလုပ်ငန်းသည် ကျော်ကြားခဲ့သည်။ <br>
                    &nbsp;&nbsp;ကျောက်သင်ပုန်းကို ယခင်က ကျောင်းသုံးစာရေး ကိရိယာတစ်ခုအနေဖြင့် ထုတ်လုပ်ခဲ့ပြီး ယခုအခါ အမှတ်တရပစ္စည်းများအဖြစ်လည်း ပုံစံအမျိုးမျိုး ဖန်တီးထုတ်လုပ်သဖြင့် စိတ်ဝင်စားမှု ပိုများလာကာ ရောင်းအားပိုလာခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaik_mayaw_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_mayaw_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_mayaw_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_mayaw_pagoda/1.jpg'),
                        ],
                    title: `ကျိုက်မရောဆုတောင်းပြည့်ဘုရားကြီး `,
                    status: 0,
                    content: `&nbsp; &nbsp;ကျိုက်မရောဆုတောင်းပြည့်ဘုရားကြီးသည် မွန်ပြည်နယ် ကျိုက်မရောမြို့တွင် တည်ရှိပြီး ဘုရားကြီး၏ မုဒြာပုံတော်သည် မြန်မာပြည်တွင် ရှားပါးလှသော ပုံတော်ဖြစ်သည်။ မျက်နှာတော်သည် အရှေ့အရပ်သို့ သပ္ပါယ်စွာဖြင့် ဖူးမျှော်ချင်စဖွယ် လှည့်တော်မူနေသည်။ ဘုရားကြီး၏ ပထမမုခ်ဝတွင် လက်ယာဘက်၌ သိကြားမင်းရုပ်တု၊ လက်ဝဲဘက်၌ ဗြဟ္မာမင်းရုပ်တု ပြုလုပ်ထားသည်။ ဒုတိယမုခ်ဝတွင် လက်ယာဘက်၌ ဆင်ဖြူတော်ပေါ်တွင် ခြင်္သေ့စီးပြီး ခြင်္သေ့ပေါ်တွင် ဘီလူးစီးထားသည်။  <br>
                    &nbsp;&nbsp;ဘုရားကြီး၏ ဉာဏ်တော်အမြင့်မှာ (၂၄)ပေရှိပြီး မျက်လုံးတော်ကို မဟူရာကျောက်ဖြင့် ပြုလုပ်ထားပြီး၊ ဦးခေါင်းတော်ကို ရုရှားစိန်များဖြင့် စီခြယ်ထားပါသည်။ ဥဏ္ဏလုံတော်မှာ ပတ္တမြားအစစ်ဖြစ်ပြီး စိန်အစစ်များဖြင့် ရံထားပါသည်။ နဖူးသင်းကျစ်တော်ကိုမူ ရွဲလုံးများဖြင့် လှပသပ္ပာယ်စွာ ပြုလုပ်ထားပါသည်။ ဘုရင်မကြီး ရှင်စောပုမှ သက္ကရာဇ် ၈၁၇ ခုနှစ်တွင် ပြုပြင်မွမ်းမံပူဇော်ခဲ့ပြီး သက္ကရာဇ် ၁၂၆၀ ခုနှစ်တွင် ဆရာတော် ဦးကေတုမာလမှ မူလသစ်သားဆင်းတုတော်ကို ငုံလျက် အင်္ဂတေဖြင့် မူလပုံစံမပျက် ပြုပြင်ခဲ့သည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kan_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kan_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kan_gyi_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kan_gyi_pagoda/1.jpg'),
                        ],
                    title: `ကန်ကြီးစေတီတော် `,
                    status: 0,
                    content: `&nbsp; &nbsp;ကန်ကြီးစေတီတော်သည် မုဒုံမြို့၏ အရှေ့တောင်ဘက် (၅)ဖာလုံခန့်အကွာ မော်လမြိုင်-သံဖြူဇရပ် လမ်းမကြီး၏ အရှေ့ဘက်တွင် တည်ရှိသည်။ ကန်ကြီးစေတီတော်သည် (၄.၆၂)ဧကကျယ်သော မဟာရာမ်တံတိုင်း အလယ်တွင် တည်ရှိပြီး ဉာဏ်တော်အမြင့်(၈၉)တောင်၊ ဖိနပ်တော်အဝန်း(၄၁၈)တောင် ရှည်လျားကာ အုတ်အင်္ဂတေတို့ဖြင့် လက်ရာပြောင်မြောက်စွာ တည်ထားသော စေတီတော်ဖြစ်သည်။ သမိုင်းအထောက် အထားများအရ မြတ်စွာဘုရား သက်တော်ထင်ရှားရှိစဉ်အခါတည်းက မြတ်စွာဘုရားရဲ့ ဆံတော်ရှင်ကို ထည့်သွင်းဌာပနာပြီး ဂဝံအုတ်တို့နဲ့ စတင်တည်ထားခဲ့ကာ နောင်အခါမှလက်ရှိစေတီတော်အတိုင်း ပြုပြင်တည်ထားခဲ့သည်ဟု သိရှိရပါသည်။ စေတီတော်နှင့်ကပ်လျက်တွင် သဘာဝအတိုင်း ကြည်လင်စိမ်းမြ လျက်ရှိသော ကန်ကြီးကန် တည်ရှိသည်။  <br>
                    &nbsp;&nbsp;မြန်မာနှစ်ဆန်း(၁)ရက်နေ့ညတွင် ဆီးမီး(၉၀၀၀) ပန်း(၉၀၀၀) ဗုဒ္ဓပူဇနိယပူဇော်ပွဲကို ကန်ကြီးစေတီတော် ပရဝုဏ်အတွင်းမှာ ကျင်းပကြသလို ကန်ကြီးကန်အတွင်းမှာလည်း ဆီမီးမျှောပွဲ ကျင်းပပူဇော်ကြသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/win_sein_taw_ya/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/win_sein_taw_ya/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/win_sein_taw_ya/3.jpg'),
                            require('@/assets/images/destination/mawlamyine/win_sein_taw_ya/2.jpg'),
                        ],
                    title: `ဝင်းစိန်တောရ လျောင်းတော်မူဘုရားကြီး  `,
                    status: 0,
                    content: `&nbsp; &nbsp;ဝင်းစိန်တောရကျောင်းသည် မော်လမြိုင်-မုဒုံ-သံဖြူဇရပ် ကားလမ်းနံဘေး မော်လမြိုင်မှ (၁၇)မိုင်ခန့် အကွာ မုဒုံမြို့နယ် မြိုင်ကုန်းကျေးရွာတွင် တည်ရှိသည်။ ကားလမ်းမကြီးမှ ကျောင်းသို့ အဝင်လမ်းတစ်လျှောက်တွင် ဗုဒ္ဓရုပ်ပွားတော်သို့ ကြွတော်မူနေဟန် သံဃာတော်ရုပ်ထု(၅၀၀)ကို ဦးစွာတွေ့ရှိရမည်ဖြစ်ပြီး ဗျိုင်းနှစ်ကောင် ဝင်းစိန်တောရ လျောင်းတော်မူဘုရားကြီးဟု ကျော်ကြားသော ဗုဒ္ဓရုပ်ပွားတော်မြတ်သည် ကမ္ဘာ့အကြီး လျောင်းတော်မူ ဘုရားများထဲမှ တစ်ဆူအပါအဝင်ဖြစ်သည်။ ၁၉၉၂ ခုနှစ်တွင် ဝင်းစိန်တောရကျောင်း၌ ဆရာတော် ဘုရားကြီး ဘဒ္ဒန္တကေသရမှ တည်ထားခဲ့ပြီး (၁၈၀)မီတာရှည်လျားကာ (၃၀)မီတာအမြင့်ရှိသည်။ လျောင်းတော်မူ ဘုရာကြီးကို (၃၁)ဘုံ၊ ဗုဒ္ဓဝင်၊ ဇာတ်နိပါတ်တော်တွေ ပြသထားသော ပြခန်းများကို ထည့်သွင်း၍ တည်ထားခဲ့ခြင်း ဖြစ်ပါသည်။ နှစ်စဉ် ဖေဖော်ဝါရီလ အစောပိုင်းတွင် ဝင်းစိန်တောရ ဆရာတော်ဘုရားကြီး ဘဒ္ဒန္တကေသရ၏ မွေးနေ့တော်အားရည်စူး၍ ဘုရားပွဲများ၊ မြန်မာ့ရိုးရာလက်ဝှေ့ပွဲများ ကျင်းပလေ့ရှိသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/khat_ya_khat_yuu/1.jpeg'),
                            require('@/assets/images/destination/mawlamyine/khat_ya_khat_yuu/1.jpeg'),
                            require('@/assets/images/destination/mawlamyine/khat_ya_khat_yuu/1.jpeg'),
                            require('@/assets/images/destination/mawlamyine/khat_ya_khat_yuu/1.jpeg'),
                        ],
                    title: `ခပ်ရခပ်ယူ ထိုင်တော်မူဘုရားကြီး  `,
                    status: 0,
                    content: `&nbsp; &nbsp;ခပ်ရခပ်ယူ ထိုင်တော်မူဘုရားကြီးသည် မွန်ပြည်နယ်၊ မုဒုံ-ကျိုက္ခမီကားလမ်းဘေးရှိ ခပ်ရခပ်ယူ သာသနာပြုစခန်းတွင် တည်ရှိပြီး ဝင်းစိန်တောရ ဆရာတော်ဘုရားကြီး ဘဒ္ဒန္တကေသရမှ တည်ထားခြင်းဖြစ်သည်။ ဉာဏ်တော်အားဖြင့် (၁၈၀)‌ပေရှိသည့် ကြီးမားသပ္ပါယ်လှတဲ့ ထိုင်တော်မူရုပ်ပွားတော်ကြီးဖြစ်ပြီး ရုပ်ပွားတော် အတွင်းကိုလည်း ဝင်ရောက်ဖူးမျှော်နိုင်သည်။
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/kyaik_khamee_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_khamee_pagoda/2.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_khamee_pagoda/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/kyaik_khamee_pagoda/2.jpg'),
                        ],
                    title: `ကျိုက္ခမီရေလည်ဘုရား `,
                    status: 0,
                    content: `&nbsp; &nbsp; ကျိုက္ခမီရေလည်ဘုရားသည် မြန်မာနိုင်ငံတွင် တန်ခိုးကြီးရုပ်ပွားတော်တစ်ဆူဖြစ်ပြီး မွန်ပြည်နယ်၊ ကျိုက္ခမီမြို့၏ အနောက်ဘက် ပင်လယ်ကမ်းခြေမှ တစ်ဖာလုံခန့်ဝေးကွာသော ကျွန်းပေါ်တွင် ကိန်းဝပ်တော်မူ သည်။ <br>
                    &nbsp;&nbsp; ကျိုက္ခမီဘုရားသည် သီဟိုဠ်ကျွန်းမှ ဒေဝါနံပိယတိဿမင်းကြီးက အဓိဋ္ဌာန်ဖြင့်မျှောလိုက်သော ရုပ်ပွားတော် (၄)ဆူအနက် ရုပ်ပွားတော်တစ်ဆူ ဖြစ်သည်ဟု သမိုင်းအဆိုရှိသည်။ ဒေဝါနံပိယတိဿ မင်းကြီးသည် မြတ်စွာဘုရားအား မဖူးမြင်လိုက်ရသော ရှင်လူအများတို့ ကြည်ညိုအားထား ကုသိုလ်ပွားစေခြင်းငှာ သိကြားမင်း ဖန်ဆင်းပေးသော ရုပ်ပွားတော်(၄)ဆူကို ပင်လယ်ရေပြင်၌ မျှောတော်မူလေသည်။ ထို(၄)ဆူအနက် ကျောက်လှည်းဘီးခံသော ရုပ်ပွားတော်သည် ကျိုက်ထိုမြို့သို့ရောက်ရှိ၍ ကျိုက်ပေါလောဘွဲ့အမည်ဖြင့် ထင်ရှားရှိသည်။ ကျွန်းတုံးခံသော ရုပ်ပွားတော်မှာ ရခိုင်ပြည်နယ်သို့ ဆိုက်ရောက်သည်ဟုဆို၏။ ပုသိမ်မြို့သို့ ဆိုက်ရောက်သည်ဟုလည်း အဆိုရှိသည်။ သင်္ကန်းတုံးခံသော ရုပ်ပွားတော်(၂)ဆူအနက် တစ်ဆူမှာ ထားဝယ်မြို့သို့ လည်းကောင်း၊ ကျန်တစ်ဆူမှာ တုံဇောင်းပီမြို့ (ယခုကျိုက္ခမီမြို့)သို့လည်းကောင်း အသီးသီး ဆိုက်ရောက်တော် မူလာလေသည်။ ထားဝယ်မြို့သို့ ရောက်ရှိလာသော ရုပ်ပွားတော်ကို လူအများက ပင့်ဆောင်ကိုးကွယ်ထားရာ ရှင်မုဋ္ဌီးအမည်ဖြင့် အထင်အရှားရှိပေသည်။  <br>
                    &nbsp;&nbsp; ကျိုက္ခမီမြို့သို့ ဆိုက်ရောက်လာသော ရုပ်ပွားတော်သည် ရှေးမင်းများက ဆံတော်ဓာတ် (၁၁)ဆူဌာပနာ၍ တည်ထားခဲ့သော ဧကာဒသစေတီတော် တည်ရှိရာ ရေလယ်ကျောက်ဆောင်အနီးသို့ ဆိုက်ရောက်လာလေသည်။ မြို့သူမြို့သားအပေါင်းတို့သည် ရုပ်ပွားတော်မြတ်ကို အမျိုးမျိုးကြိုးစား၍ ပင့်ဆောင်ကြသော်လည်း ရုပ်ပွားတော်သည် ရွေ့လျားခြင်းမရှိပေ။ နောက်ဆုံး၌ ငါးပါးသီလကို ခါးဝတ်ကဲ့သို့ မြဲမြံအောင်စောင့်ထိန်းသော မုဆိုးမတစ်ဦးက အဓိဋ္ဌာန်ပြု၍ ပင့်ဆောင်သောအခါမှ သာသနာနှစ် ၂၃၇ ခု နတ်တော်လဆန်း (၁၅)ရက်နေ့တွင် ကြွတော်မူလေသည်။ <br>
                    &nbsp;&nbsp; ရုပ်ပွားတော်ကို ရှေးဦးစွာ ဘုရားအရှေ့ဘက်မုခ်တွင် ပင့်ဆောင်ထားသော်လည်း တောင်ဘက်စူးစူးသို့သာ မျက်နှာတော်လှည့်၍ စံနေတော်မူသဖြင့် တောင်ဘက်မုခ်သို့ ပြောင်းရွှေ့ ပင့်ဆောင်ထားရလေသည်။ ရုပ်ပွားတော်သည် တောင်ဘက်သို့သာ မျက်နှာမူလျက် စံပယ်တော်မူသည်မှာ ထားဝယ်မြို့ရှိ ရှင်မုဋ္ဌီး ရုပ်ပွားတော်ကို မျှော်ကြည့်ခြင်းဖြစ်သည်ဟု ဆိုကြသည်။ ထိုသို့မျှော်ကြည့်သည်ကို အစွဲပြု၍ ရုပ်ပွားတော်ကို မွန်ဘာသာဖြင့် “ကျိုက်ဟမီ” ဟုခေါ်ဝေါ်သမုတ်ပြီး မြန်မာဘာသာဖြင့် “ဘုရားမျှော်”ဟု အဓိပ္ပာယ်ရသည်။ ကာလကြာသောအခါ “ကျိုက်ဟမီ”မှ “ကျိုက္ခမီ”ဟု စကားရွေ့လျောလာခဲ့သည်။ ထိုမျှမက ဘုရား၏ဘွဲ့တော်ကို အစွဲပြု၍ “တုံဇောင်းပီမြို့”ကိုလည်း “ကျိုက္ခမီမြို့”ဟု ခေါ်တွင်လာခဲ့ကြသည်။ ရုပ်ပွားတော်မြတ်ရောက်ရှိ၍ ကာလကြာလတ်သော် ဧကာဒသစေတီ ပျက်စီးယိုယွင်းသွားသဖြင့် ဌာပနာတိုက်ကျောက်တုံးကြီးသာ ကျန်ခဲ့လေသည်။ ထို့နောက် ဝတ်ကျောင်းကြီး ဆောက်လုပ်ကာ ရုပ်ပွားတော်ကို ထိုကျောင်းအတွင်းသို့ ပင့်ဆောင်ကိုးကွယ်ကြသည်။ ကျိုက္ခမီရုပ်ပွားတော်တည်ရှိရာ ဝတ်ကျောင်းပေါ်သို့ လှိုင်းတံပိုး မည်မျှပင် ကြီးစေကာမူ ရေမလွှမ်းခြင်းမှာ ဘုရား၏တန်ခိုးတော်ကြောင့်ဖြစ်သည်ဟု ယုံကြည်ကြသည်။ ဘုရားဝတ်ကျောင်း ပေါ်သို့ မိန်းမများ မတက်ရပါ။ တက်ရောက်မိလျှင်လည်း အခါမဲ့ လေပြင်းမုန်တိုင်းကျခြင်း၊ မိုးကြီးသည်းထန်စွာ ရွာခြင်းများ ဖြစ်တတ်သည်ဟုဆိုသည်။ ထိုသို့တက်ရောက်မိသော မိန်းမများတွင်လည်း ဝေဒနာတစ်ခုခု စွဲကပ်တတ်သည်ဟု စွဲလန်းယုံကြည်ကြသည်။ ထို့ကြောင့် မိန်းမများသည် ရုပ်ပွားတော်၏ ရှေ့ဖက်တူရှုတွင် ဆောက်လုပ်ထားရှိသော အာရုံခံဇရပ်ပေါ်မှသာလျှင် ဖူးမြှော်ကြည်ညိုလေ့ရှိသည်။ <br>
                    &nbsp;&nbsp; ကျိုက္ခမီဘုရားပွဲတော်ကို နှစ်စဉ် သီတင်းကျွတ်လဆန်း (၁၂)ရက်နေ့မှ လပြည့်နေ့အထိ ကျင်းပလေ့ ရှိသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/setse_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/setse_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/setse_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/setse_beach/1.jpg'),
                        ],
                    title: `စက်စဲကမ်းခြေ  `,
                    status: 0,
                    content: `&nbsp; &nbsp;စက်စဲကမ်းခြေသည် မွန်ပြည်နယ်၊ သံဖြူဇရပ်မြို့နယ်တွင် တည်ရှိပြီး ကပ္ပလီပင်လယ်၊ မုတ္တမပင်လယ်ကွေ့ရှိ ကမ်းခြေ အပန်းဖြေစခန်းတစ်ခုဖြစ်သည်။ ကမ်းခြေသည် အညို​ရောင်သဲများဖြင့် ဖွဲ့စည်းထားပြီး (၅.၆)ကီလိုမီတာရှည်ကာ အတော်အသင့် ကျယ်ဝန်းသော ကမ်းခြေတစ်ခုဖြစ်သည်။ စက်စဲကမ်းခြေသည် ၁၉ ရာစုတည်းက အပန်းဖြေစခန်းဖြစ်ခဲ့ပြီး ယခုအချိန်ထိ လူသိများထင်ရှားပါသည်။ 
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/ko_yin_lay_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ko_yin_lay_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ko_yin_lay_kyaung/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ko_yin_lay_kyaung/1.jpg'),
                        ],
                    title: `ကိုရင်လေးကျောင်း (ကျိုက်ဒေတမော့ဗရတ်)  `,
                    status: 0,
                    content: `&nbsp; &nbsp; ကျိုက္ခမီရေလည်ဘုရားသည် မြန်မာနိုင်ငံတွင် တန်ခိုးကြီးရုပ်ပွားတော်တစ်ဆူဖြစ်ပြီး မွန်ပြည်နယ်၊ ကျိုက္ခမီမြို့၏ အနောက်ဘက် ပင်လယ်ကမ်းခြေမှ တစ်ဖာလုံခန့်ဝေးကွာသော ကျွန်းပေါ်တွင် ကိန်းဝပ်တော်မူ သည်။ကျိုက်ဒေတမော့ဗရတ် ဆံတော်ရှင်စေတီသည် မော်လမြိုင် - ရေး မော်တော်ကားလမ်းအတိုင်း ရေးမြို့သို့ မရောက်မှီ (၅)မိုင်ခန့်ရှိ ရေးမြို့နယ်၊ ပုပ္ဖဝတီကျေးရွာတွင် တည်ရှိသည်။ <br>
                    &nbsp;&nbsp; ကျိုက္ခမီဘုရားသည် သီဟိုဠ်ကျွန်းမှ ဒေဝါနံပိယတိဿမင်းကြီးက အဓိဋ္ဌာန်ဖြင့်မျှောလိုက်သော ရုပ်ပွားတော် (၄)ဆူအနက် ရုပ်ပွားတော်တစ်ဆူ ဖြစ်သည်ဟု သမိုင်းအဆိုရှိသည်။ ဒေဝါနံပိယတိဿ မင်းကြီးသည် မြတ်စွာဘုရားအား မဖူးမြင်လိုက်ရသော ရှင်လူအများတို့ ကြည်ညိုအားထား ကုသိုလ်ပွားစေခြင်းငှာ သိကြားမင်း ဖန်ဆင်းပေးသော ရုပ်ပွားတော်(၄)ဆူကို ပင်လယ်ရေပြင်၌ မျှောတော်မူလေသည်။ ထို(၄)ဆူအနက် ကျောက်လှည်းဘီးခံသော ရုပ်ပွားတော်သည် ကျိုက်ထိုမြို့သို့ရောက်ရှိ၍ ကျိုက်ပေါလောဘွဲ့အမည်ဖြင့် ထင်ရှားရှိသည်။ ကျွန်းတုံးခံသော ရုပ်ပွားတော်မှာ ရခိုင်ပြည်နယ်သို့ ဆိုက်ရောက်သည်ဟုဆို၏။ ပုသိမ်မြို့သို့ ဆိုက်ရောက်သည်ဟုလည်း အဆိုရှိသည်။ သင်္ကန်းတုံးခံသော ရုပ်ပွားတော်(၂)ဆူအနက် တစ်ဆူမှာ ထားဝယ်မြို့သို့ လည်းကောင်း၊ ကျန်တစ်ဆူမှာ တုံဇောင်းပီမြို့ (ယခုကျိုက္ခမီမြို့)သို့လည်းကောင်း အသီးသီး ဆိုက်ရောက်တော် မူလာလေသည်။ ထားဝယ်မြို့သို့ ရောက်ရှိလာသော ရုပ်ပွားတော်ကို လူအများက ပင့်ဆောင်ကိုးကွယ်ထားရာ ရှင်မုဋ္ဌီးအမည်ဖြင့် အထင်အရှားရှိပေသည်။ ကျိုက်ဒေတမော့ဗရတ် ဟူသည် မွန်ဘာသာစကားဖြစ်ပြီး မြန်မာဘာသာဖြင့် ပြန်ဆိုပါက “ကျောက်ငှက်ပျောတောင်စေတီ” ဟူ၍ အဓိပ္ပာယ်ရသည်။ စေတီတော်တည်ရှိရာ တောင်ကုန်းတွင် ငှက်ပျောသီး သဏ္ဍာန် ကျောက်တုံးများ တွေ့ရှိသဖြင့် ထိုသို့ခေါ်ဆိုဟန်ရှိသည်။ ကျိုက်ဒေတမော့ဗရတ်ဆံတော်ရှင်စေတီသည် မြတ်စွာဘုရား ဝါတော်(၈)ဝါအရ သုဝဏ္ဏဘူမိဒေသသို့ ဒေသစာရီကြွရောက်စဉ် ဒုကရရသေ့အား ချီးမြှင့်သော ဆံတော်တစ်ဆူကို ဌာပနာထားသည့် စေတီဖြစ်ကြောင်း ရှေးမွန်ရာဇဝင်နှင့် သမိုင်းများက ဆိုသည်။ ဆံတော်ရှင် စေတီသည် နှစ်ပေါင်းများစွာ စေတီငုတ်တိုအဖြစ် ကိန်းဝပ်စံပါယ်ခဲ့ရသည်။ ရေးမြို့နယ် အရှေ့ပိုင်းရှိ ဆေးတောင်တွင် သုံးနှစ်အကြာတရားအားထုတ်ပြီး ဇာတိဖြစ်သည့် ရေးမြို့နယ်၊ စုံနံ့သာကျေးရွာသို့ ပြန်လည် ကြွရောက်လာသော သက်တော်(၁၈)နှစ်ရှိ ရှင်ပုပ္ဖရမ္မ(ကိုရင်လေး)သည် အကြောင်းကြောင်းကြောင့် အခြားပုဂ္ဂိုလ်များ ပြုပြင်မွမ်းမံရန် အကြောင်းမညီညွတ်သော ဆံတော်ရှင်စေတီကို မြန်မာသက္ကရာဇ် ၁၃၅၇ ခုနှစ်၊ တော်သလင်းလဆန်း (၁၀)ရက်နေ့တွင် ဉာဏ်တော်အမြင့် ပေ(၂၀)ခန့်ဖြင့် အပြီးသတ် မွမ်းမံတည်ထား၍ ထီးတော်အထွဋ် တင်လှူနိုင်ခဲ့သည်။ ထိုမှတဖန် ကိုရင်လေးမှပင် မူလစေတီကိုငုံ၍ ကိုယ်တိုင်ဗိသုကာပြု ပုံစံချထားသော ဉာဏ်တော် (၁၃၂)ပေအမြင့်ရှိ ဝေဇယန္တာပြဿာဒ်စေတီကို တည်ထားခဲ့သည်။  <br>
                    &nbsp;&nbsp; ဆံတော်ရှင်စေတီဝန်းကျင်နယ်မြေသည် ကိုရင်လေး၏ သဒ္ဓမ္မတရားပြန့်ပွားရာ သာသနာပြုစခန်းအဖြစ် စည်ပင်ထွန်းကားလာခဲ့ပြီး ဘုရား၊ ကျောင်း၊ ကန်၊ သိမ်နှင့် ဓမ္မာရုံများ လေ့လာဖွယ်ရာ သာသနိက အဆောက်အဦများစွာ ပေါ်ထွန်းလာခဲ့သည်။ စာသင်ကျောင်းအပါအဝင် ပုပ္ဖဝတီအမည်ဖြင့် ကျေးရွာသစ် တစ်ရွာသည်လည်း မော်လမြိုင်-ရေးမော်တော်ကားလမ်းမှ ဆံတော်ရှင်စေတီသို့သွားရာ လမ်းမပေါ်တွင် တည်ထောင်ပေါ်ပေါက်လာခဲ့သည်။  <br>
                    &nbsp;&nbsp; ကျိုက်ဒေတမော့ဗရတ်သာသနာပြုနယ်မြေတွင် ဆံတော်ရှင်စေတီကို တည်ထားမွမ်းမံပြီးနောက် ပရိက္ခရာစေတီတော်၊ ဉာဏ်တော် (၁၂၉)ပေရှိ ထိုင်တော်မူလေးဆူနှင့် တစ်ဆက်တည်းဖြစ်သော ဉာဏ်တော် (၁၄၅) ပေရှိ ရာမညအတုလစေတီနှင့် အလျား (၂၂၆)ပေရှိ လျောင်းတော်မူဘုရားတို့ကိုလည်း တည်ထား ကိုးကွယ်ခဲ့သည်။ ယခုအခါ ကမ္ဘာ့အကြီးဆုံး ပိဋကတ်စေတီတော်ကိုလည်း တည်ထားကိုးကွယ်လျက်ရှိပြီး ရေးမြို့နယ်တွင် မွန်လူမျိုးတို့၏ စာပေနှင့်ယဉ်ကျေးမှု၊ သာသနာတော်ဆိုင်ရာ ဗဟိုဌာနတစ်ခုအဖြစ် ထင်ရှားလျက်ရှိသည်။   
                    `,
                },
                {
                    images : [
                            require('@/assets/images/destination/mawlamyine/ka_byar_wa_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ka_byar_wa_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ka_byar_wa_beach/1.jpg'),
                            require('@/assets/images/destination/mawlamyine/ka_byar_wa_beach/1.jpg'),
                        ],
                    title: `ကဗျာဝကမ်းခြေ  `,
                    status: 0,
                    content: `&nbsp; &nbsp; ကဗျာဝကမ်းခြေသည် မွန်ပြည်နယ်၊ ခေါဇာမြို့၊ ကဗျာဝကျေးရွာတွင် တည်ရှိသည့် ပင်လယ်ကမ်းခြေ တစ်ခုဖြစ်ပြီး ရေးမြို့နှင့် မိုင်(၂၀)အကွာတွင်တည်ရှိသည်။ ကမ်းခြေအလျားမှာ ကဗျာဝကျေးရွာအနီးမှ တောင်ဘက် မန်ကျည်းချောင်းဝထိ အရှည် (၈)မိုင်ခန့်ရှိသည်။ <br>
                    &nbsp; &nbsp; ကဗျာဝကမ်းခြေဟိုတယ်နှင့် ပင်လယ်ကမ်းခြေ ခရီးသွားလုပ်ငန်းစီမံကိန်း ဖော်ဆောင်ရန် ၂ဝ၁၄ ခုနှစ် စက်တင်ဘာလက မွန်ပြည်နယ် လွှတ်တော်၌ အဆိုပြုတင်သွင်းခဲ့ကာ ၂ဝ၁၅ ခုနှစ် မတ်လတွင် စီမံကိန်းကို စတင်အကောင်အထည်ဖော်ခဲ့သည်။ <br>
                    &nbsp; &nbsp; ကဗျာဝကမ်းခြေသည် အလျားသိပ်မရှည်သော်လည်း ငွေရောင်သဲဖြူဖြူများနှင့် သဘာဝပတ်ဝန်းကျင် ပျက်စီးမှုမရှိသေးဘဲ အေးချမ်းစွာ အနားယူအပန်းဖြေနိုင်သည်။  ကမ်းခြေတွင် အခွံမာသည့် ခရုအမျိုးအစား တစ်မျိုး၏ အမည်ကိုအစွဲပြုပြီး ကဗျာဝရွာ၊ ကဗျာဝကမ်းခြေဟု ခေါ်တွင်လာခဲ့ကြကြောင်း မှတ်သားရသည်။ ပင်လယ်ပြင်ဘက်သို့ ငေါထွက်နေသော တောင်အငူ၊   ကွေ့ဝိုက်သောပုံသဏ္ဍာန်ဖြင့်   သဲသောင်ဖြူလွလွ   ကမ်းခြေ၊ ညင်သာသော လှိုင်းလုံးလေးများနှင့် ကမ်းခြေအလှသည် တမူထူးခြားနေသည်ကို တွေ့ရှိရမည်ဖြစ်သည်။  <br>
                    &nbsp; &nbsp;ကဗျာဝကမ်းခြေသည်   လူသိများလာသည်နှင့်အတူ  ကမ်းခြေဖွံ့ဖြိုးတိုးတက်ရေး၊ ခရီးသွားလုပ်ငန်း ဖွံ့ဖြိုးတိုးတက်ရေး၊ ဒေသခံများ၏ အလုပ်အကိုင်အခွင့်အလမ်းများ ရရှိစေရေးသည်လည်း ဒေသခံများ၏ မျှော်လင့်ချက်များ ဖြစ်လာသည်။ နယ်မြေဒေသ အေးချမ်းလာခြင်း၊ လမ်းပန်းဆက်သွယ်ရေး ကောင်းမွန်လာခြင်း နှင့်အတူ ကဗျာဝကမ်းခြေသည် သာယာလှပသော ကမ်းခြေတစ်ခုအဖြစ် တဖြည်းဖြည်း လူသိများလာလျက် ရှိသည်။ 
                    `,
                },
            ];

            const nextPage = () => {
                pageNumber.value++;
            }

            const prevPage = () => {
                pageNumber.value--;
            }

            const pageCount = computed(() => {
                let l = places.length
                let s = size;
                return Math.ceil(l/s);
            })

            const paginatedData = computed(() => {
                let start = pageNumber.value * size;
                let end = start + size;

                return places.slice(start, end);
            })

            onMounted(() => {
                swiper.value = new Swiper('.place-swiper', {
                    speed: 600,
                    loop: true,
                    autoplay: {
                        delay: 5000,
                        disableOnInteraction: false
                    },
                    slidesPerView: 'auto',
                    pagination: {
                        el: '.swiper-pagination',
                        clickable: true,
                        type: 'bullets',
                    },
                    breakpoints: {
                        320: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        },

                        1200: {
                            slidesPerView: 1,
                            spaceBetween: 20
                        }
                    }
                });
                
            });

            return { swiper, paginatedData, nextPage, prevPage, pageCount, pageNumber };
        },
    };
</script>