<template>
    <section class="header">
        <div class="sub-banner">
            <div class="slider">
                <img src="@/assets/images/about3.jpg" id="aboutImg">
            </div>
            <div class="sub-overlay">
                <div class="content">
                    <h1>MANDALAY HOTEL ZONE</h1>
                    <h3>
                        <p>CHOOSE THE BEST HOTEL AND PLACE TO VISIT</p>
                    </h3>
                </div>
            </div>
        </div>
    </section>
    <!--- End Header and Menu --->
    <!--------------- Start Famous Place to Visit Section ----------------->
    <section class="famous services famous-section" id="services">
        <h1>FAMOUS PLACES TO VISIT</h1>
        <div class="container">

            <div class="row famous-cards">
                <div class="col-lg-4 famout-card-wrap">
                    <div class="famous-card-wrap">
                        <div class="famous-card" data-card="UI/UX">
                            <div class="card-content z-index">
                                <img src="@/assets/images/zones/mandalay/famous-mdy-01.jpg" class="famous-icon" alt="" />
                                <h3 class="title-sm">ကုသိုလ်တော်ဘုရား </h3>
                                <p class="text">
                                    ကုသိုလ်တော်ဘုရားသည် မန္တလေးတောင်၏ အရှေ့တောင်ဖက်တွင်တည်ရှိပြီး မင်းတုန်းမင်း၏ ကုသိုလ်တော်ဖြစ်သည်။ မြန်မာသက္ကရာဇ် ၁၂၂၄ ခုနှစ်၊ ဝါဆိုလတွင် မင်းတုန်းမင်း တည်ထားကိုးကွယ်ခဲ့သော ဘုရားဖြစ်ပြီး ဘွဲ့အမည်မှာ မဟာလောကမာရဇိန်ဖြစ်သည်။ 

                                    ကုသိုလ်တော်ဘုရားသည် ပုဂံရှိရွှေစည်းခုံဘုရား၏ ပုံစံကိုယူ၍ တည်ထားခြင်းဖြစ်သည်။ ကမ္ဘာ့အကြီးဆုံး စာအုပ်ကြီးဟုခေါ်ဆိုကြသော (၇၂၉)ချပ်သော ကျောက်စာချပ်များသည် ဘုရားပရဝုဏ် အတွင်း တည်ရှိသည်။ စေတီငယ်တစ်ဆူတွင်  (၁၅၃)စင်တီမီတာမြင့်၍ (၁၀၇)အကျယ်ရှိသော ကျောက်စာချပ် တစ်ချပ်စီ ထည့်သွင်းထားပြီး ကျောက်စာချပ်များပေါ်တွင် ဗုဒ္ဓဘုရားရှင်၏ သုတ်၊ ဝိနည်း၊ အဘိဓမ္မာ ဟူသော ပိဋကတ်(၃)ပုံပါစာသားများကို ကျောက်စာ၏ မျက်နှာစာနှစ်ဖက်စလုံးတွင် ရေးထွင်းထားပါသည်။ အဖြူရောင် စေတီငယ်များကြားတွင် လျှောက်လမ်းကလေးများရှိပြီး၊ ဘုရားပရဝုဏ်၏အလယ်တွင် (၇၂)မီတာအမြင့်ရှိ ရွှေရောင်ပုထိုးတော်တစ်ဆူရှိပါသည်။ ကုသိုလ်တော်ဘုရားသည် UNESCO ၏ ကမ္ဘာ့အမွေအနှစ်စာရင်းဝင် အဖြစ် (၂၀၁၃)ခုနှစ်တွင် ထည့်သွင်းခံရသည်။ 
                                </p>
                                <a href="/destination/Mandalay" class="btn transparent">Read more</a>
                            </div>
                        </div>
                    </div>
                </div>

                <div class="col-lg-4 famous-card-wrap">
                    <div class="famous-card-wrap">
                        <div class="famous-card" data-card="Code">
                            <div class="card-content z-index">
                                <img src="@/assets/images/zones/mandalay/famous-mdy-02.jpg" class="famous-icon" alt="" />
                                <h3 class="title-sm">မဟာမြတ်မုနိဘုရားကြီး </h3>
                                <p class="text">
                                    မန္တလေးမြို့၏ သမိုင်းဝင်ကျက်သရေဆောင်သော မဟာမြတ်မုနိဘုရားကြီးသည် မန္တလေးမြို့၊ ချမ်းမြသာစည်မြို့နယ်၊ ကျွန်းလုံးဥသျှောင်ရပ်ကွက် တည်ရှိပါသည်။ ထူးခြားအံ့ဩဖွယ်ကောင်းသော မဟာမြတ်မုနိဘုရားကြီးသည် ဉာဏ်တော် (၄)မီတာ၊ အလေးချိန် (၆.၅)တန်ရှိပြီး စိန်၊ ပတ္တမြား၊ နီလာများဖြင့် စီခြယ်ထားသော သင်းကျစ်တော်နှင့်အတူ ကြေးဖြင့် ပုံသွန်းလောင်းထားပါသည်။ 

                                    မဟာမြတ်မုနိဘုရားကြီး၏ နေ့စဉ်မျက်နှာသစ်တော်ရေနှင့် တံပူတော်ကပ်လှူခြင်း အခမ်းအနားသည် ဘုရားဖူးများကို အထူးဆွဲဆောင်လျက်ရှိပါသည်။ မျက်နှာသစ်တော်ရေ ကပ်လှူပူဇော်ခြင်းကို နံနက်(၄:၀၀-၄:၃၀)နာရီတွင်ပြုလုပ်ပြီး၊ ထေရ်ကြီးဝါကြီး သံဃာတော်အရှင်သူမြတ်များက ဦးဆောင်ကာ ဝတ်ဖြူစင်ကြယ် ဝတ်ဥပသိကာများက ဝေယျာဝစ္စပြုလုပ်ပူဇော်ကြပါသည်။ နံနက်ခင်း မောင်းထိုးသံနှင့်အတူ သံဃာတော် မထေရ်မြတ်ကြီးတစ်ပါးက မျက်နှာသစ်တော်ရေကပ်လှူခြင်း၊ သန့်ရှင်းစင်ကြယ်သော မျက်နှာသုတ်ပုဝါဖြင့် သန့်စင်ပေးခြင်း၊ တံပူတော်များကပ်လှူပေးခြင်းတို့ကို ဆောင်ရွက်ကြပါသည်။ များစွာသော ဘုရားဖူးများသည် သံဃာတော်များစွန့်ကြဲသည့် မျက်နှာသုတ်ပုဝါများ၊ မျက်နှာသစ်တော်ရေ နံ့သာရေများကို ကိုးကွယ်ဆောင် ထားရန် လာရောက်ယူဆောင်ကြပါသည်။ ထို့အပြင် ဆွမ်း၊ ပန်း၊ ရေချမ်း၊ သစ်သီး စသည်တို့ကို ကပ်လှူ ပူဇော်ကြပြီး ဘုရားကြီး၏ နေ့တဓူဝလှုပ်ရှား လုပ်ဆောင်မှုများပင်ဖြစ်ပါသည်။  
                                </p>
                                <a href="/destination/Mandalay" class="btn transparent">Read more</a>
                            </div>
                        </div>
                    </div>
                </div>

                <div class="col-lg-4 famous-card-wrap">
                    <div class="famous-card-wrap">
                        <div class="famous-card" data-card="App">
                            <div class="card-content z-index">
                                <img src="@/assets/images/zones/mandalay/famous-mdy-03.jpg" class="famous-icon" alt="" />
                                <h3 class="title-sm">ဦးပိန်တံတား</h3>
                                <p class="text">
                                    ဦးပိန်တံတားသည် မန္တလေးတိုင်းဒေသကြီး၊ အမရပူရမြို့နယ်ရှိ တောင်သမန်အင်းကို ဖြတ်ကျော်ကာ တည်ဆောက်ထားပြီး (၀.၇၅)မိုင်ရှည်လား၍ ကမ္ဘာပေါ်တွင် အရှည်ဆုံးကျွန်းတံတားဖြစ်သည်။ သက္ကရာဇ် ၁၂၁၁ ခုနှစ် ပုဂံမင်းလက်ထက်တွင် အမရပူရမြို့စာရေး ဦးပိန်တည်ဆောက်ခဲ့သောကြောင့် ဦးပိန်တံတားဟု အမည်ခေါ်တွင်ကြသည်။ ခြေလှမ်းဖြင့်တိုင်းတာ၍ ဆောက်ခဲ့ရသော မြန်မာမှုတံတားကြီးဖြစ်ပြီး လှိုင်းဒဏ် လေဒဏ်ခံနိုင်အောင် ဖြောင့်တန်းစွာမဆောက်ပဲ တောင်ဖက်သို့ဦးမော့ကွေ့ဝိုက်ကာ ကျင်တွယ်ပုံသဏ္ဍာန် ဆောက်လုပ်ထားခြင်းဖြစ်သည်။ တံတားကြီး၏တိုင်များမှာ ဇရပ်လေးဆောင်မှ တိုင်များပါပေါင်းလျှင် တိုင်ပေါင်း (၁၀၈၆)တိုင်ရှိပြီး ယခုအခါ တံတားကြီး၏သက်တမ်းမှာ နှစ်ပေါင်း(၁၅၀)‌ကျော်ပြီဖြစ်သည်။ တံတား၏တိုင်များမှာ အင်းဝနှင့် စစ်ကိုင်းမြို့ဟောင်းများမှ နန်းတော်တိုင်များဖြစ်သည်။ ဦးပိန်တံတားသည် ယနေ့အခါတွင် တောင်သမန်အင်း၏ အထင်ကရပြယုဂ်အနေဖြင့် ထင်ရှားလျက်ရှိပါသည်။ 
                                </p>
                                <a href="/destination/Mandalay" class="btn transparent">Read more</a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <!--------------- End Famous Place to Visit Section ----------------->
</template>

<script>
    export default {
        
    }
</script>

<style >

</style>
